
-----------
QUERY:
-- Tests for range data types.

--
-- test input parser
-- (type textrange was already made in test_setup.sql)
--

-- negative tests /* REPLACED */, should fail
select ''::textrange
RESULT:
	duckdb: Catalog Error: Type with name textrange does not exist!
Did you mean "text"?

-----------
QUERY:
select '-[a,z)'::textrange
RESULT:
	duckdb: Catalog Error: Type with name textrange does not exist!
Did you mean "text"?

-----------
QUERY:
select '[a,z) - '::textrange
RESULT:
	duckdb: Catalog Error: Type with name textrange does not exist!
Did you mean "text"?

-----------
QUERY:
select '(",a)'::textrange
RESULT:
	duckdb: Catalog Error: Type with name textrange does not exist!
Did you mean "text"?

-----------
QUERY:
select '(,,a)'::textrange
RESULT:
	duckdb: Catalog Error: Type with name textrange does not exist!
Did you mean "text"?

-----------
QUERY:
select '(),a)'::textrange
RESULT:
	duckdb: Catalog Error: Type with name textrange does not exist!
Did you mean "text"?

-----------
QUERY:
select '(a,))'::textrange
RESULT:
	duckdb: Catalog Error: Type with name textrange does not exist!
Did you mean "text"?

-----------
QUERY:
select '(],a)'::textrange
RESULT:
	duckdb: Catalog Error: Type with name textrange does not exist!
Did you mean "text"?

-----------
QUERY:
select '(a,])'::textrange
RESULT:
	duckdb: Catalog Error: Type with name textrange does not exist!
Did you mean "text"?

-----------
QUERY:
select '[z,a]'::textrange
RESULT:
	duckdb: Catalog Error: Type with name textrange does not exist!
Did you mean "text"?

-----------
QUERY:
-- should succeed
select '  empty  '::textrange
RESULT:
	duckdb: Catalog Error: Type with name textrange does not exist!
Did you mean "text"?

-----------
QUERY:
select ' ( empty, empty )  '::textrange
RESULT:
	duckdb: Catalog Error: Type with name textrange does not exist!
Did you mean "text"?

-----------
QUERY:
select ' ( " a " " a ", " z " " z " )  '::textrange
RESULT:
	duckdb: Catalog Error: Type with name textrange does not exist!
Did you mean "text"?

-----------
QUERY:
select '(a,)'::textrange
RESULT:
	duckdb: Catalog Error: Type with name textrange does not exist!
Did you mean "text"?

-----------
QUERY:
select '[,z]'::textrange
RESULT:
	duckdb: Catalog Error: Type with name textrange does not exist!
Did you mean "text"?

-----------
QUERY:
select '[a,]'::textrange
RESULT:
	duckdb: Catalog Error: Type with name textrange does not exist!
Did you mean "text"?

-----------
QUERY:
select '(,)'::textrange
RESULT:
	duckdb: Catalog Error: Type with name textrange does not exist!
Did you mean "text"?

-----------
QUERY:
select '[ , ]'::textrange
RESULT:
	duckdb: Catalog Error: Type with name textrange does not exist!
Did you mean "text"?

-----------
QUERY:
select '["",""]'::textrange
RESULT:
	duckdb: Catalog Error: Type with name textrange does not exist!
Did you mean "text"?

-----------
QUERY:
select '[",",","]'::textrange
RESULT:
	duckdb: Catalog Error: Type with name textrange does not exist!
Did you mean "text"?

-----------
QUERY:
select '["\\","\\"]'::textrange
RESULT:
	duckdb: Catalog Error: Type with name textrange does not exist!
Did you mean "text"?

-----------
QUERY:
select '(\\,a)'::textrange
RESULT:
	duckdb: Catalog Error: Type with name textrange does not exist!
Did you mean "text"?

-----------
QUERY:
select '((,z)'::textrange
RESULT:
	duckdb: Catalog Error: Type with name textrange does not exist!
Did you mean "text"?

-----------
QUERY:
select '([,z)'::textrange
RESULT:
	duckdb: Catalog Error: Type with name textrange does not exist!
Did you mean "text"?

-----------
QUERY:
select '(!,()'::textrange
RESULT:
	duckdb: Catalog Error: Type with name textrange does not exist!
Did you mean "text"?

-----------
QUERY:
select '(!,[)'::textrange
RESULT:
	duckdb: Catalog Error: Type with name textrange does not exist!
Did you mean "text"?

-----------
QUERY:
select '[a,a]'::textrange
RESULT:
	duckdb: Catalog Error: Type with name textrange does not exist!
Did you mean "text"?

-----------
QUERY:
-- these are allowed but normalize to empty:
select '[a,a)'::textrange
RESULT:
	duckdb: Catalog Error: Type with name textrange does not exist!
Did you mean "text"?

-----------
QUERY:
select '(a,a]'::textrange
RESULT:
	duckdb: Catalog Error: Type with name textrange does not exist!
Did you mean "text"?

-----------
QUERY:
select '(a,a)'::textrange
RESULT:
	duckdb: Catalog Error: Type with name textrange does not exist!
Did you mean "text"?

-----------
QUERY:
-- Also try it with non-error-throwing API
select pg_input_is_valid('(1,4)', 'int4range')
RESULT:
	duckdb: Catalog Error: Scalar Function with name pg_input_is_valid does not exist!
Did you mean "json_valid"?

-----------
QUERY:
select pg_input_is_valid('(1,4', 'int4range')
RESULT:
	duckdb: Catalog Error: Scalar Function with name pg_input_is_valid does not exist!
Did you mean "json_valid"?

-----------
QUERY:
select * from pg_input_error_info('(1,4', 'int4range')
RESULT:
	duckdb: Catalog Error: Table Function with name pg_input_error_info does not exist!
Did you mean "pragma_storage_info"?

-----------
QUERY:
select pg_input_is_valid('(4,1)', 'int4range')
RESULT:
	duckdb: Catalog Error: Scalar Function with name pg_input_is_valid does not exist!
Did you mean "json_valid"?

-----------
QUERY:
select * from pg_input_error_info('(4,1)', 'int4range')
RESULT:
	duckdb: Catalog Error: Table Function with name pg_input_error_info does not exist!
Did you mean "pragma_storage_info"?

-----------
QUERY:
select pg_input_is_valid('(4,zed)', 'int4range')
RESULT:
	duckdb: Catalog Error: Scalar Function with name pg_input_is_valid does not exist!
Did you mean "json_valid"?

-----------
QUERY:
select * from pg_input_error_info('(4,zed)', 'int4range')
RESULT:
	duckdb: Catalog Error: Table Function with name pg_input_error_info does not exist!
Did you mean "pragma_storage_info"?

-----------
QUERY:
select pg_input_is_valid('[1,2147483647]', 'int4range')
RESULT:
	duckdb: Catalog Error: Scalar Function with name pg_input_is_valid does not exist!
Did you mean "json_valid"?

-----------
QUERY:
select * from pg_input_error_info('[1,2147483647]', 'int4range')
RESULT:
	duckdb: Catalog Error: Table Function with name pg_input_error_info does not exist!
Did you mean "pragma_storage_info"?

-----------
QUERY:
select pg_input_is_valid('[2000-01-01,5874897-12-31]', 'daterange')
RESULT:
	duckdb: Catalog Error: Scalar Function with name pg_input_is_valid does not exist!
Did you mean "json_valid"?

-----------
QUERY:
select * from pg_input_error_info('[2000-01-01,5874897-12-31]', 'daterange')
RESULT:
	duckdb: Catalog Error: Table Function with name pg_input_error_info does not exist!
Did you mean "pragma_storage_info"?

-----------
QUERY:
--
-- create some test data and test the operators
--

CREATE TABLE numrange_test (nr NUMRANGE)
RESULT:
	duckdb: Catalog Error: Type with name NUMRANGE does not exist!
Did you mean "enum"?

-----------
QUERY:
create index numrange_test_btree on numrange_test(nr)
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "temp.pg_catalog.pg_tables"?

-----------
QUERY:
INSERT INTO numrange_test VALUES('[,)')
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
INSERT INTO numrange_test VALUES('[3,]')
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
INSERT INTO numrange_test VALUES('[, 5)')
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
INSERT INTO numrange_test VALUES(numrange(1.1, 2.2))
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
INSERT INTO numrange_test VALUES('empty')
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
INSERT INTO numrange_test VALUES(numrange(1.7, 1.7, '[]'))
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
SELECT nr, isempty(nr), lower(nr), upper(nr) FROM numrange_test
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
SELECT nr, lower_inc(nr), lower_inf(nr), upper_inc(nr), upper_inf(nr) FROM numrange_test
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
SELECT * FROM numrange_test WHERE range_contains(nr, numrange(1.9,1.91))
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
SELECT * FROM numrange_test WHERE nr @> numrange(1.0,10000.1)
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
SELECT * FROM numrange_test WHERE range_contained_by(numrange(-1e7,-10000.1), nr)
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
SELECT * FROM numrange_test WHERE 1.9 <@ nr
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
select * from numrange_test where nr = 'empty'
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
select * from numrange_test where nr = '(1.1, 2.2)'
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
select * from numrange_test where nr = '[1.1, 2.2)'
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
select * from numrange_test where nr < 'empty'
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
select * from numrange_test where nr < numrange(-1000.0, -1000.0,'[]')
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
select * from numrange_test where nr < numrange(0.0, 1.0,'[]')
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
select * from numrange_test where nr < numrange(1000.0, 1001.0,'[]')
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
select * from numrange_test where nr <= 'empty'
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
select * from numrange_test where nr >= 'empty'
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
select * from numrange_test where nr > 'empty'
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
select * from numrange_test where nr > numrange(-1001.0, -1000.0,'[]')
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
select * from numrange_test where nr > numrange(0.0, 1.0,'[]')
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
select * from numrange_test where nr > numrange(1000.0, 1000.0,'[]')
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
select numrange(2.0, 1.0)
RESULT:
	duckdb: Catalog Error: Scalar Function with name numrange does not exist!
Did you mean "enum_range"?

-----------
QUERY:
select numrange(2.0, 3.0) -|- numrange(3.0, 4.0)
RESULT:
	duckdb: Catalog Error: Scalar Function with name -|- does not exist!
Did you mean "-"?

-----------
QUERY:
select range_adjacent(numrange(2.0, 3.0), numrange(3.1, 4.0))
RESULT:
	duckdb: Catalog Error: Scalar Function with name range_adjacent does not exist!
Did you mean "range"?

-----------
QUERY:
select range_adjacent(numrange(2.0, 3.0), numrange(3.1, null))
RESULT:
	duckdb: Catalog Error: Scalar Function with name range_adjacent does not exist!
Did you mean "range"?

-----------
QUERY:
select numrange(2.0, 3.0, '[]') -|- numrange(3.0, 4.0, '()')
RESULT:
	duckdb: Catalog Error: Scalar Function with name -|- does not exist!
Did you mean "-"?

-----------
QUERY:
select numrange(1.0, 2.0) -|- numrange(2.0, 3.0,'[]')
RESULT:
	duckdb: Catalog Error: Scalar Function with name -|- does not exist!
Did you mean "-"?

-----------
QUERY:
select range_adjacent(numrange(2.0, 3.0, '(]'), numrange(1.0, 2.0, '(]'))
RESULT:
	duckdb: Catalog Error: Scalar Function with name range_adjacent does not exist!
Did you mean "range"?

-----------
QUERY:
select numrange(1.1, 3.3) <@ numrange(0.1,10.1)
RESULT:
	duckdb: Catalog Error: Scalar Function with name numrange does not exist!
Did you mean "enum_range"?

-----------
QUERY:
select numrange(0.1, 10.1) <@ numrange(1.1,3.3)
RESULT:
	duckdb: Catalog Error: Scalar Function with name numrange does not exist!
Did you mean "enum_range"?

-----------
QUERY:
select numrange(1.1, 2.2) - numrange(2.0, 3.0)
RESULT:
	duckdb: Catalog Error: Scalar Function with name numrange does not exist!
Did you mean "enum_range"?

-----------
QUERY:
select numrange(1.1, 2.2) - numrange(2.2, 3.0)
RESULT:
	duckdb: Catalog Error: Scalar Function with name numrange does not exist!
Did you mean "enum_range"?

-----------
QUERY:
select numrange(1.1, 2.2,'[]') - numrange(2.0, 3.0)
RESULT:
	duckdb: Catalog Error: Scalar Function with name numrange does not exist!
Did you mean "enum_range"?

-----------
QUERY:
select range_minus(numrange(10.1,12.2,'[]'), numrange(110.0,120.2,'(]'))
RESULT:
	duckdb: Catalog Error: Scalar Function with name range_minus does not exist!
Did you mean "arg_min"?

-----------
QUERY:
select range_minus(numrange(10.1,12.2,'[]'), numrange(0.0,120.2,'(]'))
RESULT:
	duckdb: Catalog Error: Scalar Function with name range_minus does not exist!
Did you mean "arg_min"?

-----------
QUERY:
select numrange(4.5, 5.5, '[]') && numrange(5.5, 6.5)
RESULT:
	duckdb: Catalog Error: Scalar Function with name numrange does not exist!
Did you mean "enum_range"?

-----------
QUERY:
select numrange(1.0, 2.0) << numrange(3.0, 4.0)
RESULT:
	duckdb: Catalog Error: Scalar Function with name numrange does not exist!
Did you mean "enum_range"?

-----------
QUERY:
select numrange(1.0, 3.0,'[]') << numrange(3.0, 4.0,'[]')
RESULT:
	duckdb: Catalog Error: Scalar Function with name numrange does not exist!
Did you mean "enum_range"?

-----------
QUERY:
select numrange(1.0, 3.0,'()') << numrange(3.0, 4.0,'()')
RESULT:
	duckdb: Catalog Error: Scalar Function with name numrange does not exist!
Did you mean "enum_range"?

-----------
QUERY:
select numrange(1.0, 2.0) >> numrange(3.0, 4.0)
RESULT:
	duckdb: Catalog Error: Scalar Function with name numrange does not exist!
Did you mean "enum_range"?

-----------
QUERY:
select numrange(3.0, 70.0) &< numrange(6.6, 100.0)
RESULT:
	duckdb: Catalog Error: Scalar Function with name &< does not exist!
Did you mean "&"?

-----------
QUERY:
select numrange(1.1, 2.2) < numrange(1.0, 200.2)
RESULT:
	duckdb: Catalog Error: Scalar Function with name numrange does not exist!
Did you mean "enum_range"?

-----------
QUERY:
select numrange(1.1, 2.2) < numrange(1.1, 1.2)
RESULT:
	duckdb: Catalog Error: Scalar Function with name numrange does not exist!
Did you mean "enum_range"?

-----------
QUERY:
select numrange(1.0, 2.0) + numrange(2.0, 3.0)
RESULT:
	duckdb: Catalog Error: Scalar Function with name numrange does not exist!
Did you mean "enum_range"?

-----------
QUERY:
select numrange(1.0, 2.0) + numrange(1.5, 3.0)
RESULT:
	duckdb: Catalog Error: Scalar Function with name numrange does not exist!
Did you mean "enum_range"?

-----------
QUERY:
select numrange(1.0, 2.0) + numrange(2.5, 3.0)
RESULT:
	duckdb: Catalog Error: Scalar Function with name numrange does not exist!
Did you mean "enum_range"?

-----------
QUERY:
-- should fail

select range_merge(numrange(1.0, 2.0), numrange(2.0, 3.0))
RESULT:
	duckdb: Catalog Error: Scalar Function with name range_merge does not exist!
Did you mean "range"?

-----------
QUERY:
select range_merge(numrange(1.0, 2.0), numrange(1.5, 3.0))
RESULT:
	duckdb: Catalog Error: Scalar Function with name range_merge does not exist!
Did you mean "range"?

-----------
QUERY:
select range_merge(numrange(1.0, 2.0), numrange(2.5, 3.0))
RESULT:
	duckdb: Catalog Error: Scalar Function with name range_merge does not exist!
Did you mean "range"?

-----------
QUERY:
-- shouldn/* REPLACED */''t fail

select numrange(1.0, 2.0) * numrange(2.0, 3.0)
RESULT:
	duckdb: Catalog Error: Scalar Function with name numrange does not exist!
Did you mean "enum_range"?

-----------
QUERY:
select numrange(1.0, 2.0) * numrange(1.5, 3.0)
RESULT:
	duckdb: Catalog Error: Scalar Function with name numrange does not exist!
Did you mean "enum_range"?

-----------
QUERY:
select numrange(1.0, 2.0) * numrange(2.5, 3.0)
RESULT:
	duckdb: Catalog Error: Scalar Function with name numrange does not exist!
Did you mean "enum_range"?

-----------
QUERY:
select range_intersect_agg(nr) from numrange_test
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
select range_intersect_agg(nr) from numrange_test where false
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
select range_intersect_agg(nr) from numrange_test where nr @> 4.0
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
analyze numrange_test
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "pg_tables"?
LINE 1: analyze numrange_test
                ^

-----------
QUERY:
create table numrange_test2(nr numrange)
RESULT:
	duckdb: Catalog Error: Type with name numrange does not exist!
Did you mean "enum"?

-----------
QUERY:
create index numrange_test2_hash_idx on numrange_test2 using hash (nr)
RESULT:
	duckdb: Catalog Error: Table with name numrange_test2 does not exist!
Did you mean "temp.pg_catalog.pg_tables"?

-----------
QUERY:
INSERT INTO numrange_test2 VALUES('[, 5)')
RESULT:
	duckdb: Catalog Error: Table with name numrange_test2 does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
INSERT INTO numrange_test2 VALUES(numrange(1.1, 2.2))
RESULT:
	duckdb: Catalog Error: Table with name numrange_test2 does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
INSERT INTO numrange_test2 VALUES(numrange(1.1, 2.2))
RESULT:
	duckdb: Catalog Error: Table with name numrange_test2 does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
INSERT INTO numrange_test2 VALUES(numrange(1.1, 2.2,'()'))
RESULT:
	duckdb: Catalog Error: Table with name numrange_test2 does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
INSERT INTO numrange_test2 VALUES('empty')
RESULT:
	duckdb: Catalog Error: Table with name numrange_test2 does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
select * from numrange_test2 where nr = 'empty'::numrange
RESULT:
	duckdb: Catalog Error: Table with name numrange_test2 does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
select * from numrange_test2 where nr = numrange(1.1, 2.2)
RESULT:
	duckdb: Catalog Error: Table with name numrange_test2 does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
select * from numrange_test2 where nr = numrange(1.1, 2.3)
RESULT:
	duckdb: Catalog Error: Table with name numrange_test2 does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
set enable_nestloop=t
RESULT:
	duckdb: Catalog Error: unrecognized configuration parameter "enable_nestloop"

Did you mean: "enable_external_access"

-----------
QUERY:
set enable_hashjoin=f
RESULT:
	duckdb: Catalog Error: unrecognized configuration parameter "enable_hashjoin"

Did you mean: "enable_profiling"

-----------
QUERY:
set enable_mergejoin=f
RESULT:
	duckdb: Catalog Error: unrecognized configuration parameter "enable_mergejoin"

Did you mean: "enable_profiling"

-----------
QUERY:
select * from numrange_test natural join numrange_test2 order by nr
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
set enable_nestloop=f
RESULT:
	duckdb: Catalog Error: unrecognized configuration parameter "enable_nestloop"

Did you mean: "enable_external_access"

-----------
QUERY:
set enable_hashjoin=t
RESULT:
	duckdb: Catalog Error: unrecognized configuration parameter "enable_hashjoin"

Did you mean: "enable_profiling"

-----------
QUERY:
set enable_mergejoin=f
RESULT:
	duckdb: Catalog Error: unrecognized configuration parameter "enable_mergejoin"

Did you mean: "enable_profiling"

-----------
QUERY:
select * from numrange_test natural join numrange_test2 order by nr
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
set enable_nestloop=f
RESULT:
	duckdb: Catalog Error: unrecognized configuration parameter "enable_nestloop"

Did you mean: "enable_external_access"

-----------
QUERY:
set enable_hashjoin=f
RESULT:
	duckdb: Catalog Error: unrecognized configuration parameter "enable_hashjoin"

Did you mean: "enable_profiling"

-----------
QUERY:
set enable_mergejoin=t
RESULT:
	duckdb: Catalog Error: unrecognized configuration parameter "enable_mergejoin"

Did you mean: "enable_profiling"

-----------
QUERY:
select * from numrange_test natural join numrange_test2 order by nr
RESULT:
	duckdb: Catalog Error: Table with name numrange_test does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
set enable_nestloop to default
RESULT:
	duckdb: Catalog Error: unrecognized configuration parameter "enable_nestloop"

Did you mean: "enable_external_access"

-----------
QUERY:
set enable_hashjoin to default
RESULT:
	duckdb: Catalog Error: unrecognized configuration parameter "enable_hashjoin"

Did you mean: "enable_profiling"

-----------
QUERY:
set enable_mergejoin to default
RESULT:
	duckdb: Catalog Error: unrecognized configuration parameter "enable_mergejoin"

Did you mean: "enable_profiling"

-----------
QUERY:
-- keep numrange_test around to help exercise dump/reload
DROP TABLE numrange_test2
RESULT:
	duckdb: Catalog Error: Table with name numrange_test2 does not exist!
Did you mean "pg_tables"?

-----------
QUERY:
--
-- Apply a subset of the above tests on a collatable type, too
--

CREATE TABLE textrange_test (tr textrange)
RESULT:
	duckdb: Catalog Error: Type with name textrange does not exist!
Did you mean "text"?

-----------
QUERY:
create index textrange_test_btree on textrange_test(tr)
RESULT:
	duckdb: Catalog Error: Table with name textrange_test does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
INSERT INTO textrange_test VALUES('[,)')
RESULT:
	duckdb: Catalog Error: Table with name textrange_test does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
INSERT INTO textrange_test VALUES('["a",]')
RESULT:
	duckdb: Catalog Error: Table with name textrange_test does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
INSERT INTO textrange_test VALUES('[,"q")')
RESULT:
	duckdb: Catalog Error: Table with name textrange_test does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
INSERT INTO textrange_test VALUES(textrange('b', 'g'))
RESULT:
	duckdb: Catalog Error: Table with name textrange_test does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
INSERT INTO textrange_test VALUES('empty')
RESULT:
	duckdb: Catalog Error: Table with name textrange_test does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
INSERT INTO textrange_test VALUES(textrange('d', 'd', '[]'))
RESULT:
	duckdb: Catalog Error: Table with name textrange_test does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
SELECT tr, isempty(tr), lower(tr), upper(tr) FROM textrange_test
RESULT:
	duckdb: Catalog Error: Table with name textrange_test does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
SELECT tr, lower_inc(tr), lower_inf(tr), upper_inc(tr), upper_inf(tr) FROM textrange_test
RESULT:
	duckdb: Catalog Error: Table with name textrange_test does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
SELECT * FROM textrange_test WHERE range_contains(tr, textrange('f', 'fx'))
RESULT:
	duckdb: Catalog Error: Table with name textrange_test does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
SELECT * FROM textrange_test WHERE tr @> textrange('a', 'z')
RESULT:
	duckdb: Catalog Error: Table with name textrange_test does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
SELECT * FROM textrange_test WHERE range_contained_by(textrange('0','9'), tr)
RESULT:
	duckdb: Catalog Error: Table with name textrange_test does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
SELECT * FROM textrange_test WHERE 'e'::text <@ tr
RESULT:
	duckdb: Catalog Error: Table with name textrange_test does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select * from textrange_test where tr = 'empty'
RESULT:
	duckdb: Catalog Error: Table with name textrange_test does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select * from textrange_test where tr = '("b","g")'
RESULT:
	duckdb: Catalog Error: Table with name textrange_test does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select * from textrange_test where tr = '["b","g")'
RESULT:
	duckdb: Catalog Error: Table with name textrange_test does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select * from textrange_test where tr < 'empty'
RESULT:
	duckdb: Catalog Error: Table with name textrange_test does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
-- test canonical form for int4range
select int4range(1, 10, '[]')
RESULT:
	duckdb: Catalog Error: Scalar Function with name int4range does not exist!
Did you mean "range"?

-----------
QUERY:
select int4range(1, 10, '[)')
RESULT:
	duckdb: Catalog Error: Scalar Function with name int4range does not exist!
Did you mean "range"?

-----------
QUERY:
select int4range(1, 10, '(]')
RESULT:
	duckdb: Catalog Error: Scalar Function with name int4range does not exist!
Did you mean "range"?

-----------
QUERY:
select int4range(1, 10, '()')
RESULT:
	duckdb: Catalog Error: Scalar Function with name int4range does not exist!
Did you mean "range"?

-----------
QUERY:
select int4range(1, 2, '()')
RESULT:
	duckdb: Catalog Error: Scalar Function with name int4range does not exist!
Did you mean "range"?

-----------
QUERY:
-- test canonical form for daterange
select daterange('2000-01-10'::date, '2000-01-20'::date, '[]')
RESULT:
	duckdb: Catalog Error: Scalar Function with name daterange does not exist!
Did you mean "range"?

-----------
QUERY:
select daterange('2000-01-10'::date, '2000-01-20'::date, '[)')
RESULT:
	duckdb: Catalog Error: Scalar Function with name daterange does not exist!
Did you mean "range"?

-----------
QUERY:
select daterange('2000-01-10'::date, '2000-01-20'::date, '(]')
RESULT:
	duckdb: Catalog Error: Scalar Function with name daterange does not exist!
Did you mean "range"?

-----------
QUERY:
select daterange('2000-01-10'::date, '2000-01-20'::date, '()')
RESULT:
	duckdb: Catalog Error: Scalar Function with name daterange does not exist!
Did you mean "range"?

-----------
QUERY:
select daterange('2000-01-10'::date, '2000-01-11'::date, '()')
RESULT:
	duckdb: Catalog Error: Scalar Function with name daterange does not exist!
Did you mean "range"?

-----------
QUERY:
select daterange('2000-01-10'::date, '2000-01-11'::date, '(]')
RESULT:
	duckdb: Catalog Error: Scalar Function with name daterange does not exist!
Did you mean "range"?

-----------
QUERY:
select daterange('-infinity'::date, '2000-01-01'::date, '()')
RESULT:
	duckdb: Catalog Error: Scalar Function with name daterange does not exist!
Did you mean "range"?

-----------
QUERY:
select daterange('-infinity'::date, '2000-01-01'::date, '[)')
RESULT:
	duckdb: Catalog Error: Scalar Function with name daterange does not exist!
Did you mean "range"?

-----------
QUERY:
select daterange('2000-01-01'::date, 'infinity'::date, '[)')
RESULT:
	duckdb: Catalog Error: Scalar Function with name daterange does not exist!
Did you mean "range"?

-----------
QUERY:
select daterange('2000-01-01'::date, 'infinity'::date, '[]')
RESULT:
	duckdb: Catalog Error: Scalar Function with name daterange does not exist!
Did you mean "range"?

-----------
QUERY:
-- test GiST index that/* REPLACED */''s been built incrementally
create table test_range_gist(ir int4range)
RESULT:
	duckdb: Catalog Error: Type with name int4range does not exist!
Did you mean "int4"?

-----------
QUERY:
create index test_range_gist_idx on test_range_gist using gist (ir)
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
insert into test_range_gist select int4range(g, g+10) from generate_series(1,2000) g
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
insert into test_range_gist select 'empty'::int4range from generate_series(1,500) g
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
insert into test_range_gist select int4range(g, g+10000) from generate_series(1,1000) g
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
insert into test_range_gist select 'empty'::int4range from generate_series(1,500) g
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
insert into test_range_gist select int4range(NULL,g*10,'(]') from generate_series(1,100) g
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
insert into test_range_gist select int4range(g*10,NULL,'(]') from generate_series(1,100) g
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
insert into test_range_gist select int4range(g, g+10) from generate_series(1,2000) g
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
-- test statistics and selectivity estimation as well
--
-- We don/* REPLACED */''t check the accuracy of selectivity estimation, but at least check
-- it doesn/* REPLACED */''t fall.
analyze test_range_gist
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?
LINE 5: analyze test_range_gist
                ^

-----------
QUERY:
-- first, verify non-indexed results
SET enable_seqscan    = t
RESULT:
	duckdb: Catalog Error: unrecognized configuration parameter "enable_seqscan"

Did you mean: "enable_object_cache"

-----------
QUERY:
SET enable_indexscan  = f
RESULT:
	duckdb: Catalog Error: unrecognized configuration parameter "enable_indexscan"

Did you mean: "Calendar"

-----------
QUERY:
SET enable_bitmapscan = f
RESULT:
	duckdb: Catalog Error: unrecognized configuration parameter "enable_bitmapscan"

Did you mean: "enable_object_cache"

-----------
QUERY:
select count(*) from test_range_gist where ir @> 'empty'::int4range
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir = int4range(10,20)
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir @> 10
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir @> int4range(10,20)
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir && int4range(10,20)
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir <@ int4range(10,50)
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir << int4range(100,500)
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir >> int4range(100,500)
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir &< int4range(100,500)
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir &> int4range(100,500)
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir -|- int4range(100,500)
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir @> '{}'::int4multirange
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir @> int4multirange(int4range(10,20), int4range(30,40))
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir && '{(10,20),(30,40),(50,60)}'::int4multirange
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir <@ '{(10,30),(40,60),(70,90)}'::int4multirange
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir << int4multirange(int4range(100,200), int4range(400,500))
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir >> int4multirange(int4range(100,200), int4range(400,500))
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir &< int4multirange(int4range(100,200), int4range(400,500))
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir &> int4multirange(int4range(100,200), int4range(400,500))
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir -|- int4multirange(int4range(100,200), int4range(400,500))
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
-- now check same queries using index
SET enable_seqscan    = f
RESULT:
	duckdb: Catalog Error: unrecognized configuration parameter "enable_seqscan"

Did you mean: "enable_object_cache"

-----------
QUERY:
SET enable_indexscan  = t
RESULT:
	duckdb: Catalog Error: unrecognized configuration parameter "enable_indexscan"

Did you mean: "Calendar"

-----------
QUERY:
SET enable_bitmapscan = f
RESULT:
	duckdb: Catalog Error: unrecognized configuration parameter "enable_bitmapscan"

Did you mean: "enable_object_cache"

-----------
QUERY:
select count(*) from test_range_gist where ir @> 'empty'::int4range
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir = int4range(10,20)
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir @> 10
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir @> int4range(10,20)
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir && int4range(10,20)
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir <@ int4range(10,50)
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir << int4range(100,500)
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir >> int4range(100,500)
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir &< int4range(100,500)
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir &> int4range(100,500)
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir -|- int4range(100,500)
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir @> '{}'::int4multirange
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir @> int4multirange(int4range(10,20), int4range(30,40))
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir && '{(10,20),(30,40),(50,60)}'::int4multirange
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir <@ '{(10,30),(40,60),(70,90)}'::int4multirange
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir << int4multirange(int4range(100,200), int4range(400,500))
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir >> int4multirange(int4range(100,200), int4range(400,500))
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir &< int4multirange(int4range(100,200), int4range(400,500))
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir &> int4multirange(int4range(100,200), int4range(400,500))
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir -|- int4multirange(int4range(100,200), int4range(400,500))
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
-- now check same queries using a bulk-loaded index
drop index test_range_gist_idx
RESULT:
	duckdb: Catalog Error: Index with name test_range_gist_idx does not exist!
Did you mean "concur_reindex_ind1"?

-----------
QUERY:
create index test_range_gist_idx on test_range_gist using gist (ir)
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir @> 'empty'::int4range
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir = int4range(10,20)
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir @> 10
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir @> int4range(10,20)
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir && int4range(10,20)
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir <@ int4range(10,50)
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir << int4range(100,500)
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir >> int4range(100,500)
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir &< int4range(100,500)
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir &> int4range(100,500)
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir -|- int4range(100,500)
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir @> '{}'::int4multirange
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir @> int4multirange(int4range(10,20), int4range(30,40))
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir && '{(10,20),(30,40),(50,60)}'::int4multirange
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir <@ '{(10,30),(40,60),(70,90)}'::int4multirange
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir << int4multirange(int4range(100,200), int4range(400,500))
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir >> int4multirange(int4range(100,200), int4range(400,500))
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir &< int4multirange(int4range(100,200), int4range(400,500))
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir &> int4multirange(int4range(100,200), int4range(400,500))
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_gist where ir -|- int4multirange(int4range(100,200), int4range(400,500))
RESULT:
	duckdb: Catalog Error: Table with name test_range_gist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
-- test SP-GiST index that/* REPLACED */''s been built incrementally
create table test_range_spgist(ir int4range)
RESULT:
	duckdb: Catalog Error: Type with name int4range does not exist!
Did you mean "int4"?

-----------
QUERY:
create index test_range_spgist_idx on test_range_spgist using spgist (ir)
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
insert into test_range_spgist select int4range(g, g+10) from generate_series(1,2000) g
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
insert into test_range_spgist select 'empty'::int4range from generate_series(1,500) g
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
insert into test_range_spgist select int4range(g, g+10000) from generate_series(1,1000) g
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
insert into test_range_spgist select 'empty'::int4range from generate_series(1,500) g
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
insert into test_range_spgist select int4range(NULL,g*10,'(]') from generate_series(1,100) g
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
insert into test_range_spgist select int4range(g*10,NULL,'(]') from generate_series(1,100) g
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
insert into test_range_spgist select int4range(g, g+10) from generate_series(1,2000) g
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
-- first, verify non-indexed results
SET enable_seqscan    = t
RESULT:
	duckdb: Catalog Error: unrecognized configuration parameter "enable_seqscan"

Did you mean: "enable_object_cache"

-----------
QUERY:
SET enable_indexscan  = f
RESULT:
	duckdb: Catalog Error: unrecognized configuration parameter "enable_indexscan"

Did you mean: "Calendar"

-----------
QUERY:
SET enable_bitmapscan = f
RESULT:
	duckdb: Catalog Error: unrecognized configuration parameter "enable_bitmapscan"

Did you mean: "enable_object_cache"

-----------
QUERY:
select count(*) from test_range_spgist where ir @> 'empty'::int4range
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_spgist where ir = int4range(10,20)
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_spgist where ir @> 10
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_spgist where ir @> int4range(10,20)
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_spgist where ir && int4range(10,20)
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_spgist where ir <@ int4range(10,50)
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_spgist where ir << int4range(100,500)
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_spgist where ir >> int4range(100,500)
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_spgist where ir &< int4range(100,500)
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_spgist where ir &> int4range(100,500)
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_spgist where ir -|- int4range(100,500)
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
-- now check same queries using index
SET enable_seqscan    = f
RESULT:
	duckdb: Catalog Error: unrecognized configuration parameter "enable_seqscan"

Did you mean: "enable_object_cache"

-----------
QUERY:
SET enable_indexscan  = t
RESULT:
	duckdb: Catalog Error: unrecognized configuration parameter "enable_indexscan"

Did you mean: "Calendar"

-----------
QUERY:
SET enable_bitmapscan = f
RESULT:
	duckdb: Catalog Error: unrecognized configuration parameter "enable_bitmapscan"

Did you mean: "enable_object_cache"

-----------
QUERY:
select count(*) from test_range_spgist where ir @> 'empty'::int4range
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_spgist where ir = int4range(10,20)
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_spgist where ir @> 10
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_spgist where ir @> int4range(10,20)
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_spgist where ir && int4range(10,20)
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_spgist where ir <@ int4range(10,50)
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_spgist where ir << int4range(100,500)
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_spgist where ir >> int4range(100,500)
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_spgist where ir &< int4range(100,500)
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_spgist where ir &> int4range(100,500)
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_spgist where ir -|- int4range(100,500)
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
-- now check same queries using a bulk-loaded index
drop index test_range_spgist_idx
RESULT:
	duckdb: Catalog Error: Index with name test_range_spgist_idx does not exist!
Did you mean "concur_reindex_ind1"?

-----------
QUERY:
create index test_range_spgist_idx on test_range_spgist using spgist (ir)
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_spgist where ir @> 'empty'::int4range
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_spgist where ir = int4range(10,20)
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_spgist where ir @> 10
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_spgist where ir @> int4range(10,20)
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_spgist where ir && int4range(10,20)
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_spgist where ir <@ int4range(10,50)
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_spgist where ir << int4range(100,500)
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_spgist where ir >> int4range(100,500)
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_spgist where ir &< int4range(100,500)
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_spgist where ir &> int4range(100,500)
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
select count(*) from test_range_spgist where ir -|- int4range(100,500)
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
-- test index-only scans
explain (costs off)
select ir from test_range_spgist where ir -|- int4range(10,20) order by ir
RESULT:
	duckdb: Not implemented Error: Unimplemented explain type: costs

-----------
QUERY:
select ir from test_range_spgist where ir -|- int4range(10,20) order by ir
RESULT:
	duckdb: Catalog Error: Table with name test_range_spgist does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
RESET enable_seqscan
RESULT:
	duckdb: Catalog Error: unrecognized configuration parameter "enable_seqscan"

Did you mean: "enable_object_cache"

-----------
QUERY:
RESET enable_indexscan
RESULT:
	duckdb: Catalog Error: unrecognized configuration parameter "enable_indexscan"

Did you mean: "Calendar"

-----------
QUERY:
RESET enable_bitmapscan
RESULT:
	duckdb: Catalog Error: unrecognized configuration parameter "enable_bitmapscan"

Did you mean: "enable_object_cache"

-----------
QUERY:
-- test elem <@ range operator
create table test_range_elem(i int4)
RESULT:
	duckdb: None

-----------
QUERY:
create index test_range_elem_idx on test_range_elem (i)
RESULT:
	duckdb: None

-----------
QUERY:
insert into test_range_elem select i from generate_series(1,100) i
RESULT:
	duckdb: Conversion Error: Unimplemented type for cast (STRUCT(generate_series BIGINT) -> INTEGER)
LINE 1: insert into test_range_elem select i from generate_series(1,100) i
                                           ^

-----------
QUERY:
SET enable_seqscan    = f
RESULT:
	duckdb: Catalog Error: unrecognized configuration parameter "enable_seqscan"

Did you mean: "enable_object_cache"

-----------
QUERY:
select count(*) from test_range_elem where i <@ int4range(10,50)
RESULT:
	duckdb: Catalog Error: Scalar Function with name int4range does not exist!
Did you mean "range"?

-----------
QUERY:
-- also test spgist index on anyrange expression
create index on test_range_elem using spgist(int4range(i,i+10))
RESULT:
	duckdb: Not implemented Error: Please provide an index name, e.g., CREATE INDEX my_name ...

-----------
QUERY:
explain (costs off)
select count(*) from test_range_elem where int4range(i,i+10) <@ int4range(10,30)
RESULT:
	duckdb: Not implemented Error: Unimplemented explain type: costs

-----------
QUERY:
select count(*) from test_range_elem where int4range(i,i+10) <@ int4range(10,30)
RESULT:
	duckdb: Catalog Error: Scalar Function with name int4range does not exist!
Did you mean "range"?

-----------
QUERY:
RESET enable_seqscan
RESULT:
	duckdb: Catalog Error: unrecognized configuration parameter "enable_seqscan"

Did you mean: "enable_object_cache"

-----------
QUERY:
drop table test_range_elem
RESULT:
	duckdb: None

-----------
QUERY:
--
-- Btree_gist is not included by default, so to test exclusion
-- constraints with range types, use singleton int ranges for the /* REPLACED */''=/* REPLACED */''
-- portion of the constraint.
--

create table test_range_excl(
  room int4range,
  speaker int4range,
  during tsrange,
  exclude using gist (room with =, during with &&),
  exclude using gist (speaker with =, during with &&)
)
RESULT:
	duckdb: Parser Error: syntax error at or near "using"

-----------
QUERY:
insert into test_range_excl
  values(int4range(123, 123, '[]'), int4range(1, 1, '[]'), '[2010-01-02 10:00, 2010-01-02 11:00)')
RESULT:
	duckdb: Catalog Error: Table with name test_range_excl does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
insert into test_range_excl
  values(int4range(123, 123, '[]'), int4range(2, 2, '[]'), '[2010-01-02 11:00, 2010-01-02 12:00)')
RESULT:
	duckdb: Catalog Error: Table with name test_range_excl does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
insert into test_range_excl
  values(int4range(123, 123, '[]'), int4range(3, 3, '[]'), '[2010-01-02 10:10, 2010-01-02 11:00)')
RESULT:
	duckdb: Catalog Error: Table with name test_range_excl does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
insert into test_range_excl
  values(int4range(124, 124, '[]'), int4range(3, 3, '[]'), '[2010-01-02 10:10, 2010-01-02 11:10)')
RESULT:
	duckdb: Catalog Error: Table with name test_range_excl does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
insert into test_range_excl
  values(int4range(125, 125, '[]'), int4range(1, 1, '[]'), '[2010-01-02 10:10, 2010-01-02 11:00)')
RESULT:
	duckdb: Catalog Error: Table with name test_range_excl does not exist!
Did you mean "TEXT_TBL"?

-----------
QUERY:
-- test bigint ranges
select int8range(10000000000::int8, 20000000000::int8,'(]')
RESULT:
	duckdb: Catalog Error: Scalar Function with name int8range does not exist!
Did you mean "range"?

-----------
QUERY:
-- test tstz ranges
set timezone to '-08'
RESULT:
	duckdb: Not implemented Error: Unknown TimeZone setting

-----------
QUERY:
select '[2010-01-01 01:00:00 -05, 2010-01-01 02:00:00 -08)'::tstzrange
RESULT:
	duckdb: Catalog Error: Type with name tstzrange does not exist!
Did you mean "string"?

-----------
QUERY:
-- should fail
select '[2010-01-01 01:00:00 -08, 2010-01-01 02:00:00 -05)'::tstzrange
RESULT:
	duckdb: Catalog Error: Type with name tstzrange does not exist!
Did you mean "string"?

-----------
QUERY:
set timezone to default
RESULT:
	duckdb: None

-----------
QUERY:
--
-- Test user-defined range of floats
-- (type float8range was already made in test_setup.sql)
--

--should fail
create type bogus_float8range as range (subtype=float8, subtype_diff=float4mi)
RESULT:
	duckdb: Parser Error: Expected an integer constant as type modifier

-----------
QUERY:
select '[123.001, 5.e9)'::float8range @> 888.882::float8
RESULT:
	duckdb: Catalog Error: Type with name float8range does not exist!
Did you mean "float8"?

-----------
QUERY:
create table float8range_test(f8r float8range, i int)
RESULT:
	duckdb: Catalog Error: Type with name float8range does not exist!
Did you mean "float8"?

-----------
QUERY:
insert into float8range_test values(float8range(-100.00007, '1.111113e9'), 42)
RESULT:
	duckdb: Catalog Error: Table with name float8range_test does not exist!
Did you mean "FLOAT8_TBL"?

-----------
QUERY:
select * from float8range_test
RESULT:
	duckdb: Catalog Error: Table with name float8range_test does not exist!
Did you mean "FLOAT8_TBL"?

-----------
QUERY:
drop table float8range_test
RESULT:
	duckdb: Catalog Error: Table with name float8range_test does not exist!
Did you mean "FLOAT8_TBL"?

-----------
QUERY:
--
-- Test range types over domains
--

create domain mydomain as int4
RESULT:
	duckdb: Parser Error: syntax error at or near "domain"

-----------
QUERY:
create type mydomainrange as range(subtype=mydomain)
RESULT:
	duckdb: Parser Error: Expected an integer constant as type modifier

-----------
QUERY:
select '[4,50)'::mydomainrange @> 7::mydomain
RESULT:
	duckdb: Catalog Error: Type with name mydomainrange does not exist!
Did you mean "date"?

-----------
QUERY:
drop domain mydomain
RESULT:
	duckdb: Parser Error: syntax error at or near "domain"

-----------
QUERY:
-- fail
drop domain mydomain cascade
RESULT:
	duckdb: Parser Error: syntax error at or near "domain"

-----------
QUERY:
--
-- Test domains over range types
--

create domain restrictedrange as int4range check (upper(value) < 10)
RESULT:
	duckdb: Parser Error: syntax error at or near "domain"

-----------
QUERY:
select '[4,5)'::restrictedrange @> 7
RESULT:
	duckdb: Catalog Error: Type with name restrictedrange does not exist!
Did you mean "string"?

-----------
QUERY:
select '[4,50)'::restrictedrange @> 7
RESULT:
	duckdb: Catalog Error: Type with name restrictedrange does not exist!
Did you mean "string"?

-----------
QUERY:
-- should fail
drop domain restrictedrange
RESULT:
	duckdb: Parser Error: syntax error at or near "domain"

-----------
QUERY:
--
-- Test multiple range types over the same subtype
--

create type textrange1 as range(subtype=text, collation="C")
RESULT:
	duckdb: Parser Error: syntax error at or near "="

-----------
QUERY:
create type textrange2 as range(subtype=text, collation="C")
RESULT:
	duckdb: Parser Error: syntax error at or near "="

-----------
QUERY:
select textrange1('a','Z') @> 'b'::text
RESULT:
	duckdb: Catalog Error: Scalar Function with name textrange1 does not exist!
Did you mean "range"?

-----------
QUERY:
select textrange2('a','z') @> 'b'::text
RESULT:
	duckdb: Catalog Error: Scalar Function with name textrange2 does not exist!
Did you mean "range"?

-----------
QUERY:
drop type textrange1
RESULT:
	duckdb: Catalog Error: Type with name textrange1 does not exist!
Did you mean "text"?

-----------
QUERY:
drop type textrange2
RESULT:
	duckdb: Catalog Error: Type with name textrange2 does not exist!
Did you mean "text"?

-----------
QUERY:
--
-- Test polymorphic type system
--

create function anyarray_anyrange_func(a anyarray, r anyrange)
  returns anyelement as 'select $1[1] + lower($2)
RESULT:
	duckdb: Parser Error: syntax error at or near "anyarray"

-----------
QUERY:
' language sql
RESULT:
	duckdb: Parser Error: unterminated quoted string at or near "' language sql
"

-----------
QUERY:
select anyarray_anyrange_func(ARRAY[1,2], int4range(10,20))
RESULT:
	duckdb: Catalog Error: Scalar Function with name anyarray_anyrange_func does not exist!
Did you mean "array_grade_up"?

-----------
QUERY:
-- should fail
select anyarray_anyrange_func(ARRAY[1,2], numrange(10,20))
RESULT:
	duckdb: Catalog Error: Scalar Function with name anyarray_anyrange_func does not exist!
Did you mean "array_grade_up"?

-----------
QUERY:
drop function anyarray_anyrange_func(anyarray, anyrange)
RESULT:
	duckdb: Parser Error: syntax error at or near "("

-----------
QUERY:
-- should fail
create function bogus_func(anyelement)
  returns anyrange as 'select int4range(1,10)' language sql
RESULT:
	duckdb: Parser Error: syntax error at or near "returns"

-----------
QUERY:
-- should fail
create function bogus_func(int)
  returns anyrange as 'select int4range(1,10)' language sql
RESULT:
	duckdb: Parser Error: syntax error at or near "returns"

-----------
QUERY:
create function range_add_bounds(anyrange)
  returns anyelement as 'select lower($1) + upper($1)' language sql
RESULT:
	duckdb: Parser Error: syntax error at or near "returns"

-----------
QUERY:
select range_add_bounds(int4range(1, 17))
RESULT:
	duckdb: Catalog Error: Scalar Function with name range_add_bounds does not exist!
Did you mean "range"?

-----------
QUERY:
select range_add_bounds(numrange(1.0001, 123.123))
RESULT:
	duckdb: Catalog Error: Scalar Function with name range_add_bounds does not exist!
Did you mean "range"?

-----------
QUERY:
create function rangetypes_sql(q anyrange, b anyarray, out c anyelement)
  as $$ select upper($1) + $2[1] $$
  language sql
RESULT:
	duckdb: Parser Error: syntax error at or near "anyrange"

-----------
QUERY:
select rangetypes_sql(int4range(1,10), ARRAY[2,20])
RESULT:
	duckdb: Catalog Error: Scalar Function with name rangetypes_sql does not exist!
Did you mean "range"?

-----------
QUERY:
select rangetypes_sql(numrange(1,10), ARRAY[2,20])
RESULT:
	duckdb: Catalog Error: Scalar Function with name rangetypes_sql does not exist!
Did you mean "range"?

-----------
QUERY:
-- match failure

create function anycompatiblearray_anycompatiblerange_func(a anycompatiblearray, r anycompatiblerange)
  returns anycompatible as 'select $1[1] + lower($2)
RESULT:
	duckdb: Parser Error: syntax error at or near "anycompatiblearray"

-----------
QUERY:
' language sql
RESULT:
	duckdb: Parser Error: unterminated quoted string at or near "' language sql
"

-----------
QUERY:
select anycompatiblearray_anycompatiblerange_func(ARRAY[1,2], int4range(10,20))
RESULT:
	duckdb: Catalog Error: Scalar Function with name anycompatiblearray_anycompatiblerange_func does not exist!
Did you mean "array_cat"?

-----------
QUERY:
select anycompatiblearray_anycompatiblerange_func(ARRAY[1,2], numrange(10,20))
RESULT:
	duckdb: Catalog Error: Scalar Function with name anycompatiblearray_anycompatiblerange_func does not exist!
Did you mean "array_cat"?

-----------
QUERY:
-- should fail
select anycompatiblearray_anycompatiblerange_func(ARRAY[1.1,2], int4range(10,20))
RESULT:
	duckdb: Catalog Error: Scalar Function with name anycompatiblearray_anycompatiblerange_func does not exist!
Did you mean "array_cat"?

-----------
QUERY:
drop function anycompatiblearray_anycompatiblerange_func(anycompatiblearray, anycompatiblerange)
RESULT:
	duckdb: Parser Error: syntax error at or near "("

-----------
QUERY:
-- should fail
create function bogus_func(anycompatible)
  returns anycompatiblerange as 'select int4range(1,10)' language sql
RESULT:
	duckdb: Parser Error: syntax error at or near "returns"

-----------
QUERY:
--
-- Arrays of ranges
--

select ARRAY[numrange(1.1, 1.2), numrange(12.3, 155.5)]
RESULT:
	duckdb: Catalog Error: Scalar Function with name numrange does not exist!
Did you mean "enum_range"?

-----------
QUERY:
create table i8r_array (f1 int, f2 int8range[])
RESULT:
	duckdb: Catalog Error: Type with name int8range does not exist!
Did you mean "int8"?

-----------
QUERY:
insert into i8r_array values (42, array[int8range(1,10), int8range(2,20)])
RESULT:
	duckdb: Catalog Error: Table with name i8r_array does not exist!
Did you mean "pg_am"?

-----------
QUERY:
select * from i8r_array
RESULT:
	duckdb: Catalog Error: Table with name i8r_array does not exist!
Did you mean "pg_am"?

-----------
QUERY:
drop table i8r_array
RESULT:
	duckdb: Catalog Error: Table with name i8r_array does not exist!
Did you mean "pg_am"?

-----------
QUERY:
--
-- Ranges of arrays
--

create type arrayrange as range (subtype=int4[])
RESULT:
	duckdb: Parser Error: syntax error at or near "]"

-----------
QUERY:
select arrayrange(ARRAY[1,2], ARRAY[2,1])
RESULT:
	duckdb: Catalog Error: Scalar Function with name arrayrange does not exist!
Did you mean "array_agg"?

-----------
QUERY:
select arrayrange(ARRAY[2,1], ARRAY[1,2])
RESULT:
	duckdb: Catalog Error: Scalar Function with name arrayrange does not exist!
Did you mean "array_agg"?

-----------
QUERY:
-- fail

select array[1,1] <@ arrayrange(array[1,2], array[2,1])
RESULT:
	duckdb: Catalog Error: Scalar Function with name arrayrange does not exist!
Did you mean "array_agg"?

-----------
QUERY:
select array[1,3] <@ arrayrange(array[1,2], array[2,1])
RESULT:
	duckdb: Catalog Error: Scalar Function with name arrayrange does not exist!
Did you mean "array_agg"?

-----------
QUERY:
--
-- Ranges of composites
--

create type two_ints as (a int, b int)
RESULT:
	duckdb: Parser Error: syntax error at or near "("

-----------
QUERY:
create type two_ints_range as range (subtype = two_ints)
RESULT:
	duckdb: Parser Error: Expected an integer constant as type modifier

-----------
QUERY:
-- with debug_parallel_query on, this exercises tqueue.c/* REPLACED */''s range remapping
select *, row_to_json(upper(t)) as u from
  (values (two_ints_range(row(1,2), row(3,4))),
          (two_ints_range(row(5,6), row(7,8)))) v(t)
RESULT:
	duckdb: Catalog Error: Scalar Function with name two_ints_range does not exist!
Did you mean "range"?

-----------
QUERY:
-- this must be rejected to avoid self-inclusion issues:
alter type two_ints add attribute c two_ints_range
RESULT:
	duckdb: Parser Error: syntax error at or near "type"

-----------
QUERY:
drop type two_ints cascade
RESULT:
	duckdb: Catalog Error: Type with name two_ints does not exist!
Did you mean "int"?

-----------
QUERY:
--
-- Check behavior when subtype lacks a hash function
--

create type varbitrange as range (subtype = varbit)
RESULT:
	duckdb: Parser Error: Expected an integer constant as type modifier

-----------
QUERY:
set enable_sort = off
RESULT:
	duckdb: Catalog Error: unrecognized configuration parameter "enable_sort"

Did you mean: "enable_fsst_vectors"

-----------
QUERY:
-- try to make it pick a hash setop implementation

select '(01,10)'::varbitrange except select '(10,11)'::varbitrange
RESULT:
	duckdb: Catalog Error: Type with name varbitrange does not exist!
Did you mean "bit"?

-----------
QUERY:
reset enable_sort
RESULT:
	duckdb: Catalog Error: unrecognized configuration parameter "enable_sort"

Did you mean: "enable_fsst_vectors"

-----------
QUERY:
--
-- OUT/INOUT/TABLE functions
--

-- infer anyrange from anyrange
create function outparam_succeed(i anyrange, out r anyrange, out t text)
  as $$ select $1, 'foo'::text $$ language sql
RESULT:
	duckdb: Parser Error: syntax error at or near "anyrange"

-----------
QUERY:
select * from outparam_succeed(int4range(1,2))
RESULT:
	duckdb: Catalog Error: Table Function with name outparam_succeed does not exist!
Did you mean "pandas_scan"?

-----------
QUERY:
create function outparam2_succeed(r anyrange, out lu anyarray, out ul anyarray)
  as $$ select array[lower($1), upper($1)], array[upper($1), lower($1)] $$
  language sql
RESULT:
	duckdb: Parser Error: syntax error at or near "anyrange"

-----------
QUERY:
select * from outparam2_succeed(int4range(1,11))
RESULT:
	duckdb: Catalog Error: Table Function with name outparam2_succeed does not exist!
Did you mean "pandas_scan"?

-----------
QUERY:
-- infer anyarray from anyrange
create function outparam_succeed2(i anyrange, out r anyarray, out t text)
  as $$ select ARRAY[upper($1)], 'foo'::text $$ language sql
RESULT:
	duckdb: Parser Error: syntax error at or near "anyrange"

-----------
QUERY:
select * from outparam_succeed2(int4range(int4range(1,2)))
RESULT:
	duckdb: Catalog Error: Table Function with name outparam_succeed2 does not exist!
Did you mean "pandas_scan"?

-----------
QUERY:
-- infer anyelement from anyrange
create function inoutparam_succeed(out i anyelement, inout r anyrange)
  as $$ select upper($1), $1 $$ language sql
RESULT:
	duckdb: Parser Error: syntax error at or near "i"

-----------
QUERY:
select * from inoutparam_succeed(int4range(1,2))
RESULT:
	duckdb: Catalog Error: Table Function with name inoutparam_succeed does not exist!
Did you mean "pandas_scan"?

-----------
QUERY:
create function table_succeed(r anyrange)
  returns table(l anyelement, u anyelement)
  as $$ select lower($1), upper($1) $$
  language sql
RESULT:
	duckdb: Parser Error: syntax error at or near "anyrange"

-----------
QUERY:
select * from table_succeed(int4range(1,11))
RESULT:
	duckdb: Catalog Error: Table Function with name table_succeed does not exist!
Did you mean "seq_scan"?

-----------
QUERY:
-- should fail
create function outparam_fail(i anyelement, out r anyrange, out t text)
  as $$ select '[1,10]', 'foo' $$ language sql
RESULT:
	duckdb: Parser Error: syntax error at or near "anyelement"

-----------
QUERY:
--should fail
create function inoutparam_fail(inout i anyelement, out r anyrange)
  as $$ select $1, '[1,10]' $$ language sql
RESULT:
	duckdb: Parser Error: syntax error at or near "i"

-----------
QUERY:
--should fail
create function table_fail(i anyelement) returns table(i anyelement, r anyrange)
  as $$ select $1, '[1,10]' $$ language sql
RESULT:
	duckdb: Parser Error: syntax error at or near "anyelement"

-----------
QUERY:
--
-- Test support functions
--

-- empty range
explain (verbose, costs off)
select current_date <@ daterange 'empty'
RESULT:
	duckdb: Not implemented Error: Unimplemented explain type: verbose

-----------
QUERY:
-- unbounded range
explain (verbose, costs off)
select current_date <@ daterange(NULL, NULL)
RESULT:
	duckdb: Not implemented Error: Unimplemented explain type: verbose

-----------
QUERY:
-- only lower bound present
explain (verbose, costs off)
select current_date <@ daterange('2000-01-01', NULL, '[)')
RESULT:
	duckdb: Not implemented Error: Unimplemented explain type: verbose

-----------
QUERY:
-- only upper bound present
explain (verbose, costs off)
select current_date <@ daterange(NULL, '2000-01-01', '(]')
RESULT:
	duckdb: Not implemented Error: Unimplemented explain type: verbose

-----------
QUERY:
-- lower range /* REPLACED */''-Infinity/* REPLACED */'' excluded
explain (verbose, costs off)
select current_date <@ daterange('-Infinity', '1997-04-10'::date, '()')
RESULT:
	duckdb: Not implemented Error: Unimplemented explain type: verbose

-----------
QUERY:
-- lower range /* REPLACED */''-Infinity/* REPLACED */'' included
explain (verbose, costs off)
select current_date <@ daterange('-Infinity', '1997-04-10'::date, '[)')
RESULT:
	duckdb: Not implemented Error: Unimplemented explain type: verbose

-----------
QUERY:
-- upper range /* REPLACED */''Infinity/* REPLACED */'' excluded
explain (verbose, costs off)
select current_date <@ daterange('2002-09-25'::date, 'Infinity', '[)')
RESULT:
	duckdb: Not implemented Error: Unimplemented explain type: verbose

-----------
QUERY:
-- upper range /* REPLACED */''Infinity/* REPLACED */'' included
explain (verbose, costs off)
select current_date <@ daterange('2002-09-25'::date, 'Infinity', '[]')
RESULT:
	duckdb: Not implemented Error: Unimplemented explain type: verbose

-----------
QUERY:
-- should also work if we use /* REPLACED */''@>/* REPLACED */''
explain (verbose, costs off)
select daterange('-Infinity', '1997-04-10'::date, '()') @> current_date
RESULT:
	duckdb: Not implemented Error: Unimplemented explain type: verbose

-----------
QUERY:
explain (verbose, costs off)
select daterange('2002-09-25'::date, 'Infinity', '[]') @> current_date
RESULT:
	duckdb: Not implemented Error: Unimplemented explain type: verbose

-----------
QUERY:
-- Check that volatile cases are not optimized
explain (verbose, costs off)
select now() <@ tstzrange('2024-01-20 00:00', '2024-01-21 00:00')
RESULT:
	duckdb: Not implemented Error: Unimplemented explain type: verbose

-----------
QUERY:
explain (verbose, costs off)  -- unsafe!
select clock_timestamp() <@ tstzrange('2024-01-20 00:00', '2024-01-21 00:00')
RESULT:
	duckdb: Not implemented Error: Unimplemented explain type: verbose

-----------
QUERY:
explain (verbose, costs off)
select clock_timestamp() <@ tstzrange('2024-01-20 00:00', NULL)
RESULT:
	duckdb: Not implemented Error: Unimplemented explain type: verbose

-----------
QUERY:
-- test a custom range type with a non-default operator class
create type textrange_supp as range (
   subtype = text,
   subtype_opclass = text_pattern_ops
)
RESULT:
	duckdb: Parser Error: Expected an integer constant as type modifier

-----------
QUERY:
create temp table text_support_test (t text collate "C")
RESULT:
	duckdb: None

-----------
QUERY:
insert into text_support_test values ('a'), ('c'), ('d'), ('ch')
RESULT:
	duckdb: None

-----------
QUERY:
explain (costs off)
select * from text_support_test where t <@ textrange_supp('a', 'd')
RESULT:
	duckdb: Not implemented Error: Unimplemented explain type: costs

-----------
QUERY:
select * from text_support_test where t <@ textrange_supp('a', 'd')
RESULT:
	duckdb: Catalog Error: Scalar Function with name textrange_supp does not exist!
Did you mean "range"?

-----------
QUERY:
drop table text_support_test
RESULT:
	duckdb: None

-----------
QUERY:
drop type textrange_supp
RESULT:
	duckdb: Catalog Error: Type with name textrange_supp does not exist!
Did you mean "text"?
