
-----------
QUERY:
--
-- DATE
--

CREATE TABLE DATE_TBL (f1 date);
RESULT:
	[]

-----------
QUERY:


INSERT INTO DATE_TBL VALUES ('1957-04-09');
RESULT:
	[]

-----------
QUERY:

INSERT INTO DATE_TBL VALUES ('1957-06-13');
RESULT:
	[]

-----------
QUERY:

INSERT INTO DATE_TBL VALUES ('1996-02-28');
RESULT:
	[]

-----------
QUERY:

INSERT INTO DATE_TBL VALUES ('1996-02-29');
RESULT:
	[]

-----------
QUERY:

INSERT INTO DATE_TBL VALUES ('1996-03-01');
RESULT:
	[]

-----------
QUERY:

INSERT INTO DATE_TBL VALUES ('1996-03-02');
RESULT:
	[]

-----------
QUERY:

INSERT INTO DATE_TBL VALUES ('1997-02-28');
RESULT:
	[]

-----------
QUERY:

INSERT INTO DATE_TBL VALUES ('1997-02-29');
RESULT:
	ERROR - date/time field value out of range: "1997-02-29"
LINE 2: INSERT INTO DATE_TBL VALUES ('1997-02-29');
                                     ^


-----------
QUERY:

INSERT INTO DATE_TBL VALUES ('1997-03-01');
RESULT:
	[]

-----------
QUERY:

INSERT INTO DATE_TBL VALUES ('1997-03-02');
RESULT:
	[]

-----------
QUERY:

INSERT INTO DATE_TBL VALUES ('2000-04-01');
RESULT:
	[]

-----------
QUERY:

INSERT INTO DATE_TBL VALUES ('2000-04-02');
RESULT:
	[]

-----------
QUERY:

INSERT INTO DATE_TBL VALUES ('2000-04-03');
RESULT:
	[]

-----------
QUERY:

INSERT INTO DATE_TBL VALUES ('2038-04-08');
RESULT:
	[]

-----------
QUERY:

INSERT INTO DATE_TBL VALUES ('2039-04-09');
RESULT:
	[]

-----------
QUERY:

INSERT INTO DATE_TBL VALUES ('2040-04-10');
RESULT:
	[]

-----------
QUERY:

INSERT INTO DATE_TBL VALUES ('2040-04-10 BC');
RESULT:
	[]

-----------
QUERY:


SELECT f1 FROM DATE_TBL;
RESULT:
	ERROR - year -2040 is out of range

-----------
QUERY:


SELECT f1 FROM DATE_TBL WHERE f1 < '2000-01-01';
RESULT:
	ERROR - year -2040 is out of range

-----------
QUERY:


SELECT f1 FROM DATE_TBL
  WHERE f1 BETWEEN '2000-01-01' AND '2001-01-01';
RESULT:
	[(datetime.date(2000, 4, 1),), (datetime.date(2000, 4, 2),), (datetime.date(2000, 4, 3),)]

-----------
QUERY:


--
-- Check all the documented input formats
--
SET datestyle TO iso;
RESULT:
	[]

-----------
QUERY:
  -- display results in ISO

SET datestyle TO ymd;
RESULT:
	[]

-----------
QUERY:


SELECT date 'January 8, 1999';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '1999-01-08';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '1999-01-18';
RESULT:
	[(datetime.date(1999, 1, 18),)]

-----------
QUERY:

SELECT date '1/8/1999';
RESULT:
	ERROR - date/time field value out of range: "1/8/1999"
LINE 2: SELECT date '1/8/1999';
                    ^
HINT:  Perhaps you need a different "datestyle" setting.


-----------
QUERY:

SELECT date '1/18/1999';
RESULT:
	ERROR - date/time field value out of range: "1/18/1999"
LINE 2: SELECT date '1/18/1999';
                    ^
HINT:  Perhaps you need a different "datestyle" setting.


-----------
QUERY:

SELECT date '18/1/1999';
RESULT:
	ERROR - date/time field value out of range: "18/1/1999"
LINE 2: SELECT date '18/1/1999';
                    ^
HINT:  Perhaps you need a different "datestyle" setting.


-----------
QUERY:

SELECT date '01/02/03';
RESULT:
	[(datetime.date(2001, 2, 3),)]

-----------
QUERY:

SELECT date '19990108';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '990108';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '1999.008';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date 'J2451187';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date 'January 8, 99 BC';
RESULT:
	ERROR - date/time field value out of range: "January 8, 99 BC"
LINE 2: SELECT date 'January 8, 99 BC';
                    ^
HINT:  Perhaps you need a different "datestyle" setting.


-----------
QUERY:


SELECT date '99-Jan-08';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '1999-Jan-08';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '08-Jan-99';
RESULT:
	ERROR - date/time field value out of range: "08-Jan-99"
LINE 2: SELECT date '08-Jan-99';
                    ^
HINT:  Perhaps you need a different "datestyle" setting.


-----------
QUERY:

SELECT date '08-Jan-1999';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date 'Jan-08-99';
RESULT:
	ERROR - date/time field value out of range: "Jan-08-99"
LINE 2: SELECT date 'Jan-08-99';
                    ^
HINT:  Perhaps you need a different "datestyle" setting.


-----------
QUERY:

SELECT date 'Jan-08-1999';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '99-08-Jan';
RESULT:
	ERROR - invalid input syntax for type date: "99-08-Jan"
LINE 2: SELECT date '99-08-Jan';
                    ^


-----------
QUERY:

SELECT date '1999-08-Jan';
RESULT:
	ERROR - invalid input syntax for type date: "1999-08-Jan"
LINE 2: SELECT date '1999-08-Jan';
                    ^


-----------
QUERY:


SELECT date '99 Jan 08';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '1999 Jan 08';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '08 Jan 99';
RESULT:
	ERROR - date/time field value out of range: "08 Jan 99"
LINE 2: SELECT date '08 Jan 99';
                    ^
HINT:  Perhaps you need a different "datestyle" setting.


-----------
QUERY:

SELECT date '08 Jan 1999';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date 'Jan 08 99';
RESULT:
	ERROR - date/time field value out of range: "Jan 08 99"
LINE 2: SELECT date 'Jan 08 99';
                    ^
HINT:  Perhaps you need a different "datestyle" setting.


-----------
QUERY:

SELECT date 'Jan 08 1999';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '99 08 Jan';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '1999 08 Jan';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:


SELECT date '99-01-08';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '1999-01-08';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '08-01-99';
RESULT:
	ERROR - date/time field value out of range: "08-01-99"
LINE 2: SELECT date '08-01-99';
                    ^
HINT:  Perhaps you need a different "datestyle" setting.


-----------
QUERY:

SELECT date '08-01-1999';
RESULT:
	ERROR - date/time field value out of range: "08-01-1999"
LINE 2: SELECT date '08-01-1999';
                    ^
HINT:  Perhaps you need a different "datestyle" setting.


-----------
QUERY:

SELECT date '01-08-99';
RESULT:
	ERROR - date/time field value out of range: "01-08-99"
LINE 2: SELECT date '01-08-99';
                    ^
HINT:  Perhaps you need a different "datestyle" setting.


-----------
QUERY:

SELECT date '01-08-1999';
RESULT:
	ERROR - date/time field value out of range: "01-08-1999"
LINE 2: SELECT date '01-08-1999';
                    ^
HINT:  Perhaps you need a different "datestyle" setting.


-----------
QUERY:

SELECT date '99-08-01';
RESULT:
	[(datetime.date(1999, 8, 1),)]

-----------
QUERY:

SELECT date '1999-08-01';
RESULT:
	[(datetime.date(1999, 8, 1),)]

-----------
QUERY:


SELECT date '99 01 08';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '1999 01 08';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '08 01 99';
RESULT:
	ERROR - date/time field value out of range: "08 01 99"
LINE 2: SELECT date '08 01 99';
                    ^
HINT:  Perhaps you need a different "datestyle" setting.


-----------
QUERY:

SELECT date '08 01 1999';
RESULT:
	ERROR - date/time field value out of range: "08 01 1999"
LINE 2: SELECT date '08 01 1999';
                    ^
HINT:  Perhaps you need a different "datestyle" setting.


-----------
QUERY:

SELECT date '01 08 99';
RESULT:
	ERROR - date/time field value out of range: "01 08 99"
LINE 2: SELECT date '01 08 99';
                    ^
HINT:  Perhaps you need a different "datestyle" setting.


-----------
QUERY:

SELECT date '01 08 1999';
RESULT:
	ERROR - date/time field value out of range: "01 08 1999"
LINE 2: SELECT date '01 08 1999';
                    ^
HINT:  Perhaps you need a different "datestyle" setting.


-----------
QUERY:

SELECT date '99 08 01';
RESULT:
	[(datetime.date(1999, 8, 1),)]

-----------
QUERY:

SELECT date '1999 08 01';
RESULT:
	[(datetime.date(1999, 8, 1),)]

-----------
QUERY:


SET datestyle TO dmy;
RESULT:
	[]

-----------
QUERY:


SELECT date 'January 8, 1999';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '1999-01-08';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '1999-01-18';
RESULT:
	[(datetime.date(1999, 1, 18),)]

-----------
QUERY:

SELECT date '1/8/1999';
RESULT:
	[(datetime.date(1999, 8, 1),)]

-----------
QUERY:

SELECT date '1/18/1999';
RESULT:
	ERROR - date/time field value out of range: "1/18/1999"
LINE 2: SELECT date '1/18/1999';
                    ^
HINT:  Perhaps you need a different "datestyle" setting.


-----------
QUERY:

SELECT date '18/1/1999';
RESULT:
	[(datetime.date(1999, 1, 18),)]

-----------
QUERY:

SELECT date '01/02/03';
RESULT:
	[(datetime.date(2003, 2, 1),)]

-----------
QUERY:

SELECT date '19990108';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '990108';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '1999.008';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date 'J2451187';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date 'January 8, 99 BC';
RESULT:
	ERROR - year -99 is out of range

-----------
QUERY:


SELECT date '99-Jan-08';
RESULT:
	ERROR - date/time field value out of range: "99-Jan-08"
LINE 3: SELECT date '99-Jan-08';
                    ^
HINT:  Perhaps you need a different "datestyle" setting.


-----------
QUERY:

SELECT date '1999-Jan-08';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '08-Jan-99';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '08-Jan-1999';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date 'Jan-08-99';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date 'Jan-08-1999';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '99-08-Jan';
RESULT:
	ERROR - invalid input syntax for type date: "99-08-Jan"
LINE 2: SELECT date '99-08-Jan';
                    ^


-----------
QUERY:

SELECT date '1999-08-Jan';
RESULT:
	ERROR - invalid input syntax for type date: "1999-08-Jan"
LINE 2: SELECT date '1999-08-Jan';
                    ^


-----------
QUERY:


SELECT date '99 Jan 08';
RESULT:
	ERROR - date/time field value out of range: "99 Jan 08"
LINE 3: SELECT date '99 Jan 08';
                    ^
HINT:  Perhaps you need a different "datestyle" setting.


-----------
QUERY:

SELECT date '1999 Jan 08';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '08 Jan 99';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '08 Jan 1999';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date 'Jan 08 99';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date 'Jan 08 1999';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '99 08 Jan';
RESULT:
	ERROR - invalid input syntax for type date: "99 08 Jan"
LINE 2: SELECT date '99 08 Jan';
                    ^


-----------
QUERY:

SELECT date '1999 08 Jan';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:


SELECT date '99-01-08';
RESULT:
	ERROR - date/time field value out of range: "99-01-08"
LINE 3: SELECT date '99-01-08';
                    ^
HINT:  Perhaps you need a different "datestyle" setting.


-----------
QUERY:

SELECT date '1999-01-08';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '08-01-99';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '08-01-1999';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '01-08-99';
RESULT:
	[(datetime.date(1999, 8, 1),)]

-----------
QUERY:

SELECT date '01-08-1999';
RESULT:
	[(datetime.date(1999, 8, 1),)]

-----------
QUERY:

SELECT date '99-08-01';
RESULT:
	ERROR - date/time field value out of range: "99-08-01"
LINE 2: SELECT date '99-08-01';
                    ^
HINT:  Perhaps you need a different "datestyle" setting.


-----------
QUERY:

SELECT date '1999-08-01';
RESULT:
	[(datetime.date(1999, 8, 1),)]

-----------
QUERY:


SELECT date '99 01 08';
RESULT:
	ERROR - date/time field value out of range: "99 01 08"
LINE 3: SELECT date '99 01 08';
                    ^
HINT:  Perhaps you need a different "datestyle" setting.


-----------
QUERY:

SELECT date '1999 01 08';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '08 01 99';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '08 01 1999';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '01 08 99';
RESULT:
	[(datetime.date(1999, 8, 1),)]

-----------
QUERY:

SELECT date '01 08 1999';
RESULT:
	[(datetime.date(1999, 8, 1),)]

-----------
QUERY:

SELECT date '99 08 01';
RESULT:
	ERROR - date/time field value out of range: "99 08 01"
LINE 2: SELECT date '99 08 01';
                    ^
HINT:  Perhaps you need a different "datestyle" setting.


-----------
QUERY:

SELECT date '1999 08 01';
RESULT:
	[(datetime.date(1999, 8, 1),)]

-----------
QUERY:


SET datestyle TO mdy;
RESULT:
	[]

-----------
QUERY:


SELECT date 'January 8, 1999';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '1999-01-08';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '1999-01-18';
RESULT:
	[(datetime.date(1999, 1, 18),)]

-----------
QUERY:

SELECT date '1/8/1999';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '1/18/1999';
RESULT:
	[(datetime.date(1999, 1, 18),)]

-----------
QUERY:

SELECT date '18/1/1999';
RESULT:
	ERROR - date/time field value out of range: "18/1/1999"
LINE 2: SELECT date '18/1/1999';
                    ^
HINT:  Perhaps you need a different "datestyle" setting.


-----------
QUERY:

SELECT date '01/02/03';
RESULT:
	[(datetime.date(2003, 1, 2),)]

-----------
QUERY:

SELECT date '19990108';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '990108';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '1999.008';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date 'J2451187';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date 'January 8, 99 BC';
RESULT:
	ERROR - year -99 is out of range

-----------
QUERY:


SELECT date '99-Jan-08';
RESULT:
	ERROR - date/time field value out of range: "99-Jan-08"
LINE 3: SELECT date '99-Jan-08';
                    ^
HINT:  Perhaps you need a different "datestyle" setting.


-----------
QUERY:

SELECT date '1999-Jan-08';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '08-Jan-99';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '08-Jan-1999';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date 'Jan-08-99';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date 'Jan-08-1999';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '99-08-Jan';
RESULT:
	ERROR - invalid input syntax for type date: "99-08-Jan"
LINE 2: SELECT date '99-08-Jan';
                    ^


-----------
QUERY:

SELECT date '1999-08-Jan';
RESULT:
	ERROR - invalid input syntax for type date: "1999-08-Jan"
LINE 2: SELECT date '1999-08-Jan';
                    ^


-----------
QUERY:


SELECT date '99 Jan 08';
RESULT:
	ERROR - invalid input syntax for type date: "99 Jan 08"
LINE 3: SELECT date '99 Jan 08';
                    ^


-----------
QUERY:

SELECT date '1999 Jan 08';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '08 Jan 99';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '08 Jan 1999';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date 'Jan 08 99';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date 'Jan 08 1999';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '99 08 Jan';
RESULT:
	ERROR - invalid input syntax for type date: "99 08 Jan"
LINE 2: SELECT date '99 08 Jan';
                    ^


-----------
QUERY:

SELECT date '1999 08 Jan';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:


SELECT date '99-01-08';
RESULT:
	ERROR - date/time field value out of range: "99-01-08"
LINE 3: SELECT date '99-01-08';
                    ^
HINT:  Perhaps you need a different "datestyle" setting.


-----------
QUERY:

SELECT date '1999-01-08';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '08-01-99';
RESULT:
	[(datetime.date(1999, 8, 1),)]

-----------
QUERY:

SELECT date '08-01-1999';
RESULT:
	[(datetime.date(1999, 8, 1),)]

-----------
QUERY:

SELECT date '01-08-99';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '01-08-1999';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '99-08-01';
RESULT:
	ERROR - date/time field value out of range: "99-08-01"
LINE 2: SELECT date '99-08-01';
                    ^
HINT:  Perhaps you need a different "datestyle" setting.


-----------
QUERY:

SELECT date '1999-08-01';
RESULT:
	[(datetime.date(1999, 8, 1),)]

-----------
QUERY:


SELECT date '99 01 08';
RESULT:
	ERROR - date/time field value out of range: "99 01 08"
LINE 3: SELECT date '99 01 08';
                    ^
HINT:  Perhaps you need a different "datestyle" setting.


-----------
QUERY:

SELECT date '1999 01 08';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '08 01 99';
RESULT:
	[(datetime.date(1999, 8, 1),)]

-----------
QUERY:

SELECT date '08 01 1999';
RESULT:
	[(datetime.date(1999, 8, 1),)]

-----------
QUERY:

SELECT date '01 08 99';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '01 08 1999';
RESULT:
	[(datetime.date(1999, 1, 8),)]

-----------
QUERY:

SELECT date '99 08 01';
RESULT:
	ERROR - date/time field value out of range: "99 08 01"
LINE 2: SELECT date '99 08 01';
                    ^
HINT:  Perhaps you need a different "datestyle" setting.


-----------
QUERY:

SELECT date '1999 08 01';
RESULT:
	[(datetime.date(1999, 8, 1),)]

-----------
QUERY:


-- Check upper and lower limits of date range
SELECT date '4714-11-24 BC';
RESULT:
	ERROR - year -4714 is out of range

-----------
QUERY:

SELECT date '4714-11-23 BC';
RESULT:
	ERROR - date out of range: "4714-11-23 BC"
LINE 2: SELECT date '4714-11-23 BC';
                    ^


-----------
QUERY:
  -- out of range
SELECT date '5874897-12-31';
RESULT:
	ERROR - year 5874897 is out of range

-----------
QUERY:

SELECT date '5874898-01-01';
RESULT:
	ERROR - date out of range: "5874898-01-01"
LINE 2: SELECT date '5874898-01-01';
                    ^


-----------
QUERY:
  -- out of range

-- Test non-error-throwing API
SELECT pg_input_is_valid('now', 'date');
RESULT:
	[(True,)]

-----------
QUERY:

SELECT pg_input_is_valid('garbage', 'date');
RESULT:
	[(False,)]

-----------
QUERY:

SELECT pg_input_is_valid('6874898-01-01', 'date');
RESULT:
	[(False,)]

-----------
QUERY:

SELECT * FROM pg_input_error_info('garbage', 'date');
RESULT:
	[('invalid input syntax for type date: "garbage"', None, None, '22007')]

-----------
QUERY:

SELECT * FROM pg_input_error_info('6874898-01-01', 'date');
RESULT:
	[('date out of range: "6874898-01-01"', None, None, '22008')]

-----------
QUERY:


RESET datestyle;
RESULT:
	[]

-----------
QUERY:


--
-- Simple math
-- Leave most of it for the horology tests
--

SELECT f1 - date '2000-01-01' AS "Days From 2K" FROM DATE_TBL;
RESULT:
	[(-15607,), (-15542,), (-1403,), (-1402,), (-1401,), (-1400,), (-1037,), (-1036,), (-1035,), (91,), (92,), (93,), (13977,), (14343,), (14710,), (-1475115,)]

-----------
QUERY:


SELECT f1 - date 'epoch' AS "Days From Epoch" FROM DATE_TBL;
RESULT:
	[(-4650,), (-4585,), (9554,), (9555,), (9556,), (9557,), (9920,), (9921,), (9922,), (11048,), (11049,), (11050,), (24934,), (25300,), (25667,), (-1464158,)]

-----------
QUERY:


SELECT date 'yesterday' - date 'today' AS "One day";
RESULT:
	[(-1,)]

-----------
QUERY:


SELECT date 'today' - date 'tomorrow' AS "One day";
RESULT:
	[(-1,)]

-----------
QUERY:


SELECT date 'yesterday' - date 'tomorrow' AS "Two days";
RESULT:
	[(-2,)]

-----------
QUERY:


SELECT date 'tomorrow' - date 'today' AS "One day";
RESULT:
	[(1,)]

-----------
QUERY:


SELECT date 'today' - date 'yesterday' AS "One day";
RESULT:
	[(1,)]

-----------
QUERY:


SELECT date 'tomorrow' - date 'yesterday' AS "Two days";
RESULT:
	[(2,)]

-----------
QUERY:


--
-- test extract!
--
SELECT f1 as "date",
    date_part('year', f1) AS year,
    date_part('month', f1) AS month,
    date_part('day', f1) AS day,
    date_part('quarter', f1) AS quarter,
    date_part('decade', f1) AS decade,
    date_part('century', f1) AS century,
    date_part('millennium', f1) AS millennium,
    date_part('isoyear', f1) AS isoyear,
    date_part('week', f1) AS week,
    date_part('dow', f1) AS dow,
    date_part('isodow', f1) AS isodow,
    date_part('doy', f1) AS doy,
    date_part('julian', f1) AS julian,
    date_part('epoch', f1) AS epoch
    FROM date_tbl;
RESULT:
	ERROR - year -2040 is out of range

-----------
QUERY:

--
-- epoch
--
SELECT EXTRACT(EPOCH FROM DATE        '1970-01-01');
RESULT:
	[(Decimal('0'),)]

-----------
QUERY:
     --  0
--
-- century
--
SELECT EXTRACT(CENTURY FROM DATE '0101-12-31 BC');
RESULT:
	[(Decimal('-2'),)]

-----------
QUERY:
 -- -2
SELECT EXTRACT(CENTURY FROM DATE '0100-12-31 BC');
RESULT:
	[(Decimal('-1'),)]

-----------
QUERY:
 -- -1
SELECT EXTRACT(CENTURY FROM DATE '0001-12-31 BC');
RESULT:
	[(Decimal('-1'),)]

-----------
QUERY:
 -- -1
SELECT EXTRACT(CENTURY FROM DATE '0001-01-01');
RESULT:
	[(Decimal('1'),)]

-----------
QUERY:
    --  1
SELECT EXTRACT(CENTURY FROM DATE '0001-01-01 AD');
RESULT:
	[(Decimal('1'),)]

-----------
QUERY:
 --  1
SELECT EXTRACT(CENTURY FROM DATE '1900-12-31');
RESULT:
	[(Decimal('19'),)]

-----------
QUERY:
    -- 19
SELECT EXTRACT(CENTURY FROM DATE '1901-01-01');
RESULT:
	[(Decimal('20'),)]

-----------
QUERY:
    -- 20
SELECT EXTRACT(CENTURY FROM DATE '2000-12-31');
RESULT:
	[(Decimal('20'),)]

-----------
QUERY:
    -- 20
SELECT EXTRACT(CENTURY FROM DATE '2001-01-01');
RESULT:
	[(Decimal('21'),)]

-----------
QUERY:
    -- 21
SELECT EXTRACT(CENTURY FROM CURRENT_DATE)>=21 AS True;
RESULT:
	[(True,)]

-----------
QUERY:
     -- true
--
-- millennium
--
SELECT EXTRACT(MILLENNIUM FROM DATE '0001-12-31 BC');
RESULT:
	[(Decimal('-1'),)]

-----------
QUERY:
 -- -1
SELECT EXTRACT(MILLENNIUM FROM DATE '0001-01-01 AD');
RESULT:
	[(Decimal('1'),)]

-----------
QUERY:
 --  1
SELECT EXTRACT(MILLENNIUM FROM DATE '1000-12-31');
RESULT:
	[(Decimal('1'),)]

-----------
QUERY:
    --  1
SELECT EXTRACT(MILLENNIUM FROM DATE '1001-01-01');
RESULT:
	[(Decimal('2'),)]

-----------
QUERY:
    --  2
SELECT EXTRACT(MILLENNIUM FROM DATE '2000-12-31');
RESULT:
	[(Decimal('2'),)]

-----------
QUERY:
    --  2
SELECT EXTRACT(MILLENNIUM FROM DATE '2001-01-01');
RESULT:
	[(Decimal('3'),)]

-----------
QUERY:
    --  3
-- next test to be fixed on the turn of the next millennium /* REPLACED */,-)
SELECT EXTRACT(MILLENNIUM FROM CURRENT_DATE);
RESULT:
	[(Decimal('3'),)]

-----------
QUERY:
         --  3
--
-- decade
--
SELECT EXTRACT(DECADE FROM DATE '1994-12-25');
RESULT:
	[(Decimal('199'),)]

-----------
QUERY:
    -- 199
SELECT EXTRACT(DECADE FROM DATE '0010-01-01');
RESULT:
	[(Decimal('1'),)]

-----------
QUERY:
    --   1
SELECT EXTRACT(DECADE FROM DATE '0009-12-31');
RESULT:
	[(Decimal('0'),)]

-----------
QUERY:
    --   0
SELECT EXTRACT(DECADE FROM DATE '0001-01-01 BC');
RESULT:
	[(Decimal('0'),)]

-----------
QUERY:
 --   0
SELECT EXTRACT(DECADE FROM DATE '0002-12-31 BC');
RESULT:
	[(Decimal('-1'),)]

-----------
QUERY:
 --  -1
SELECT EXTRACT(DECADE FROM DATE '0011-01-01 BC');
RESULT:
	[(Decimal('-1'),)]

-----------
QUERY:
 --  -1
SELECT EXTRACT(DECADE FROM DATE '0012-12-31 BC');
RESULT:
	[(Decimal('-2'),)]

-----------
QUERY:
 --  -2
--
-- all possible fields
--
SELECT EXTRACT(MICROSECONDS  FROM DATE '2020-08-11');
RESULT:
	ERROR - unit "microseconds" not supported for type date


-----------
QUERY:

SELECT EXTRACT(MILLISECONDS  FROM DATE '2020-08-11');
RESULT:
	ERROR - unit "milliseconds" not supported for type date


-----------
QUERY:

SELECT EXTRACT(SECOND        FROM DATE '2020-08-11');
RESULT:
	ERROR - unit "second" not supported for type date


-----------
QUERY:

SELECT EXTRACT(MINUTE        FROM DATE '2020-08-11');
RESULT:
	ERROR - unit "minute" not supported for type date


-----------
QUERY:

SELECT EXTRACT(HOUR          FROM DATE '2020-08-11');
RESULT:
	ERROR - unit "hour" not supported for type date


-----------
QUERY:

SELECT EXTRACT(DAY           FROM DATE '2020-08-11');
RESULT:
	[(Decimal('11'),)]

-----------
QUERY:

SELECT EXTRACT(MONTH         FROM DATE '2020-08-11');
RESULT:
	[(Decimal('8'),)]

-----------
QUERY:

SELECT EXTRACT(YEAR          FROM DATE '2020-08-11');
RESULT:
	[(Decimal('2020'),)]

-----------
QUERY:

SELECT EXTRACT(YEAR          FROM DATE '2020-08-11 BC');
RESULT:
	[(Decimal('-2020'),)]

-----------
QUERY:

SELECT EXTRACT(DECADE        FROM DATE '2020-08-11');
RESULT:
	[(Decimal('202'),)]

-----------
QUERY:

SELECT EXTRACT(CENTURY       FROM DATE '2020-08-11');
RESULT:
	[(Decimal('21'),)]

-----------
QUERY:

SELECT EXTRACT(MILLENNIUM    FROM DATE '2020-08-11');
RESULT:
	[(Decimal('3'),)]

-----------
QUERY:

SELECT EXTRACT(ISOYEAR       FROM DATE '2020-08-11');
RESULT:
	[(Decimal('2020'),)]

-----------
QUERY:

SELECT EXTRACT(ISOYEAR       FROM DATE '2020-08-11 BC');
RESULT:
	[(Decimal('-2020'),)]

-----------
QUERY:

SELECT EXTRACT(QUARTER       FROM DATE '2020-08-11');
RESULT:
	[(Decimal('3'),)]

-----------
QUERY:

SELECT EXTRACT(WEEK          FROM DATE '2020-08-11');
RESULT:
	[(Decimal('33'),)]

-----------
QUERY:

SELECT EXTRACT(DOW           FROM DATE '2020-08-11');
RESULT:
	[(Decimal('2'),)]

-----------
QUERY:

SELECT EXTRACT(DOW           FROM DATE '2020-08-16');
RESULT:
	[(Decimal('0'),)]

-----------
QUERY:

SELECT EXTRACT(ISODOW        FROM DATE '2020-08-11');
RESULT:
	[(Decimal('2'),)]

-----------
QUERY:

SELECT EXTRACT(ISODOW        FROM DATE '2020-08-16');
RESULT:
	[(Decimal('7'),)]

-----------
QUERY:

SELECT EXTRACT(DOY           FROM DATE '2020-08-11');
RESULT:
	[(Decimal('224'),)]

-----------
QUERY:

SELECT EXTRACT(TIMEZONE      FROM DATE '2020-08-11');
RESULT:
	ERROR - unit "timezone" not supported for type date


-----------
QUERY:

SELECT EXTRACT(TIMEZONE_M    FROM DATE '2020-08-11');
RESULT:
	ERROR - unit "timezone_m" not supported for type date


-----------
QUERY:

SELECT EXTRACT(TIMEZONE_H    FROM DATE '2020-08-11');
RESULT:
	ERROR - unit "timezone_h" not supported for type date


-----------
QUERY:

SELECT EXTRACT(EPOCH         FROM DATE '2020-08-11');
RESULT:
	[(Decimal('1597104000'),)]

-----------
QUERY:

SELECT EXTRACT(JULIAN        FROM DATE '2020-08-11');
RESULT:
	[(Decimal('2459073'),)]

-----------
QUERY:

--
-- test trunc function!
--
SELECT DATE_TRUNC('MILLENNIUM', TIMESTAMP '1970-03-20 04:30:00.00000');
RESULT:
	[(datetime.datetime(1001, 1, 1, 0, 0),)]

-----------
QUERY:
 -- 1001
SELECT DATE_TRUNC('MILLENNIUM', DATE '1970-03-20');
RESULT:
	[(datetime.datetime(1001, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=2048))),)]

-----------
QUERY:
 -- 1001-01-01
SELECT DATE_TRUNC('CENTURY', TIMESTAMP '1970-03-20 04:30:00.00000');
RESULT:
	[(datetime.datetime(1901, 1, 1, 0, 0),)]

-----------
QUERY:
 -- 1901
SELECT DATE_TRUNC('CENTURY', DATE '1970-03-20');
RESULT:
	[(datetime.datetime(1901, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))),)]

-----------
QUERY:
 -- 1901
SELECT DATE_TRUNC('CENTURY', DATE '2004-08-10');
RESULT:
	[(datetime.datetime(2001, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))),)]

-----------
QUERY:
 -- 2001-01-01
SELECT DATE_TRUNC('CENTURY', DATE '0002-02-04');
RESULT:
	[(datetime.datetime(1, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=2048))),)]

-----------
QUERY:
 -- 0001-01-01
SELECT DATE_TRUNC('CENTURY', DATE '0055-08-10 BC');
RESULT:
	ERROR - year -100 is out of range

-----------
QUERY:
 -- 0100-01-01 BC
SELECT DATE_TRUNC('DECADE', DATE '1993-12-25');
RESULT:
	[(datetime.datetime(1990, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))),)]

-----------
QUERY:
 -- 1990-01-01
SELECT DATE_TRUNC('DECADE', DATE '0004-12-25');
RESULT:
	ERROR - year -1 is out of range

-----------
QUERY:
 -- 0001-01-01 BC
SELECT DATE_TRUNC('DECADE', DATE '0002-12-31 BC');
RESULT:
	ERROR - year -11 is out of range

-----------
QUERY:
 -- 0011-01-01 BC
--
-- test infinity
--
select 'infinity'::date, '-infinity'::date;
RESULT:
	[(datetime.date(9999, 12, 31), datetime.date(1, 1, 1))]

-----------
QUERY:

select 'infinity'::date > 'today'::date as t;
RESULT:
	[(True,)]

-----------
QUERY:

select '-infinity'::date < 'today'::date as t;
RESULT:
	[(True,)]

-----------
QUERY:

select isfinite('infinity'::date), isfinite('-infinity'::date), isfinite('today'::date);
RESULT:
	[(False, False, True)]

-----------
QUERY:

select 'infinity'::date = '+infinity'::date as t;
RESULT:
	[(True,)]

-----------
QUERY:


--
-- oscillating fields from non-finite date:
--
SELECT EXTRACT(DAY FROM DATE 'infinity');
RESULT:
	[(None,)]

-----------
QUERY:
      -- NULL
SELECT EXTRACT(DAY FROM DATE '-infinity');
RESULT:
	[(None,)]

-----------
QUERY:
     -- NULL
-- all supported fields
SELECT EXTRACT(DAY           FROM DATE 'infinity');
RESULT:
	[(None,)]

-----------
QUERY:
    -- NULL
SELECT EXTRACT(MONTH         FROM DATE 'infinity');
RESULT:
	[(None,)]

-----------
QUERY:
    -- NULL
SELECT EXTRACT(QUARTER       FROM DATE 'infinity');
RESULT:
	[(None,)]

-----------
QUERY:
    -- NULL
SELECT EXTRACT(WEEK          FROM DATE 'infinity');
RESULT:
	[(None,)]

-----------
QUERY:
    -- NULL
SELECT EXTRACT(DOW           FROM DATE 'infinity');
RESULT:
	[(None,)]

-----------
QUERY:
    -- NULL
SELECT EXTRACT(ISODOW        FROM DATE 'infinity');
RESULT:
	[(None,)]

-----------
QUERY:
    -- NULL
SELECT EXTRACT(DOY           FROM DATE 'infinity');
RESULT:
	[(None,)]

-----------
QUERY:
    -- NULL
--
-- monotonic fields from non-finite date:
--
SELECT EXTRACT(EPOCH FROM DATE 'infinity');
RESULT:
	[(Decimal('Infinity'),)]

-----------
QUERY:
         --  Infinity
SELECT EXTRACT(EPOCH FROM DATE '-infinity');
RESULT:
	[(Decimal('-Infinity'),)]

-----------
QUERY:
        -- -Infinity
-- all supported fields
SELECT EXTRACT(YEAR       FROM DATE 'infinity');
RESULT:
	[(Decimal('Infinity'),)]

-----------
QUERY:
    --  Infinity
SELECT EXTRACT(DECADE     FROM DATE 'infinity');
RESULT:
	[(Decimal('Infinity'),)]

-----------
QUERY:
    --  Infinity
SELECT EXTRACT(CENTURY    FROM DATE 'infinity');
RESULT:
	[(Decimal('Infinity'),)]

-----------
QUERY:
    --  Infinity
SELECT EXTRACT(MILLENNIUM FROM DATE 'infinity');
RESULT:
	[(Decimal('Infinity'),)]

-----------
QUERY:
    --  Infinity
SELECT EXTRACT(JULIAN     FROM DATE 'infinity');
RESULT:
	[(Decimal('Infinity'),)]

-----------
QUERY:
    --  Infinity
SELECT EXTRACT(ISOYEAR    FROM DATE 'infinity');
RESULT:
	[(Decimal('Infinity'),)]

-----------
QUERY:
    --  Infinity
SELECT EXTRACT(EPOCH      FROM DATE 'infinity');
RESULT:
	[(Decimal('Infinity'),)]

-----------
QUERY:
    --  Infinity
--
-- wrong fields from non-finite date:
--
SELECT EXTRACT(MICROSEC  FROM DATE 'infinity');
RESULT:
	ERROR - unit "microsec" not recognized for type date


-----------
QUERY:
     -- error

-- test constructors
select make_date(2013, 7, 15);
RESULT:
	[(datetime.date(2013, 7, 15),)]

-----------
QUERY:

select make_date(-44, 3, 15);
RESULT:
	ERROR - year -44 is out of range

-----------
QUERY:

select make_time(8, 20, 0.0);
RESULT:
	[(datetime.time(8, 20),)]

-----------
QUERY:

-- should fail
select make_date(0, 7, 15);
RESULT:
	ERROR - date field value out of range: 0-07-15


-----------
QUERY:

select make_date(2013, 2, 30);
RESULT:
	ERROR - date field value out of range: 2013-02-30


-----------
QUERY:

select make_date(2013, 13, 1);
RESULT:
	ERROR - date field value out of range: 2013-13-01


-----------
QUERY:

select make_date(2013, 11, -1);
RESULT:
	ERROR - date field value out of range: 2013-11--1


-----------
QUERY:

select make_time(10, 55, 100.1);
RESULT:
	ERROR - time field value out of range: 10:55:100.1


-----------
QUERY:

select make_time(24, 0, 2.1);
RESULT:
	ERROR - time field value out of range: 24:00:2.1

