--
-- TRANSACTIONS
--

BEGIN


CREATE TABLE xacttest (a smallint, b real)

INSERT INTO xacttest VALUES
  (56, 7.8),
  (100, 99.097),
  (0, 0.09561),
  (42, 324.78)

INSERT INTO xacttest (a, b) VALUES (777, 777.777)


END


-- should retrieve one value--
SELECT a FROM xacttest WHERE a > 100
RESULT: 
	[(777,)]



BEGIN


CREATE TABLE disappear (a int4)


DELETE FROM xacttest


-- should be empty
SELECT * FROM xacttest
RESULT: 
	[]


ABORT


-- should not exist
SELECT oid FROM pg_class WHERE relname = 'disappear'
RESULT: 
	[]


-- should have members again
SELECT * FROM xacttest
RESULT: 
	[(56, 7.800000190734863), (100, 99.09700012207031), (0, 0.09561000019311905), (42, 324.7799987792969), (777, 777.7769775390625)]


-- Test that transaction characteristics cannot be reset.
BEGIN TRANSACTION ISOLATION LEVEL SERIALIZABLE
ERROR: 

-- Test that transaction characteristics cannot be reset.
BEGIN TRANSACTION ISOLATION LEVEL SERIALIZABLE

Parser Error: syntax error at or near "ISOLATION"

SELECT COUNT(*) FROM xacttest
RESULT: 
	[(5,)]

RESET transaction_isolation
ERROR: 
RESET transaction_isolation

Catalog Error: unrecognized configuration parameter "transaction_isolation"

Did you mean: "default_collation"
 -- error
END
ERROR:  -- error
END

TransactionContext Error: cannot commit - no transaction is active


BEGIN TRANSACTION READ ONLY
ERROR: 

BEGIN TRANSACTION READ ONLY

Parser Error: syntax error at or near "READ"

SELECT COUNT(*) FROM xacttest
RESULT: 
	[(5,)]

RESET transaction_read_only
ERROR: 
RESET transaction_read_only

Catalog Error: unrecognized configuration parameter "transaction_read_only"

Did you mean: "threads"
 -- error
END
ERROR:  -- error
END

TransactionContext Error: cannot commit - no transaction is active


BEGIN TRANSACTION DEFERRABLE
ERROR: 

BEGIN TRANSACTION DEFERRABLE

Parser Error: syntax error at or near "DEFERRABLE"

SELECT COUNT(*) FROM xacttest
RESULT: 
	[(5,)]

RESET transaction_deferrable
ERROR: 
RESET transaction_deferrable

Catalog Error: unrecognized configuration parameter "transaction_deferrable"

Did you mean: "user"
 -- error
END
ERROR:  -- error
END

TransactionContext Error: cannot commit - no transaction is active


CREATE FUNCTION errfunc() RETURNS int LANGUAGE SQL AS 'SELECT 1'
SET transaction_read_only = on
ERROR: 

CREATE FUNCTION errfunc() RETURNS int LANGUAGE SQL AS 'SELECT 1'
SET transaction_read_only = on

Parser Error: syntax error at or near "RETURNS"
 -- error

-- Read-only tests

CREATE TABLE writetest (a int)

CREATE TEMPORARY TABLE temptest (a int)


BEGIN

SET TRANSACTION ISOLATION LEVEL SERIALIZABLE, READ ONLY, DEFERRABLE
ERROR: 
SET TRANSACTION ISOLATION LEVEL SERIALIZABLE, READ ONLY, DEFERRABLE

Parser Error: syntax error at or near "ISOLATION"
 -- ok
SELECT * FROM writetest
RESULT: 
	[]
 -- ok
SET TRANSACTION READ WRITE
ERROR:  -- ok
SET TRANSACTION READ WRITE

Parser Error: syntax error at or near "READ"
 --fail
COMMIT


BEGIN

SET TRANSACTION READ ONLY
ERROR: 
SET TRANSACTION READ ONLY

Parser Error: syntax error at or near "READ"
 -- ok
SET TRANSACTION READ WRITE
ERROR:  -- ok
SET TRANSACTION READ WRITE

Parser Error: syntax error at or near "READ"
 -- ok
SET TRANSACTION READ ONLY
ERROR:  -- ok
SET TRANSACTION READ ONLY

Parser Error: syntax error at or near "READ"
 -- ok
SELECT * FROM writetest
RESULT: 
	[]
 -- ok
SAVEPOINT x
ERROR:  -- ok
SAVEPOINT x

Parser Error: syntax error at or near "SAVEPOINT"

SET TRANSACTION READ ONLY
ERROR: 
SET TRANSACTION READ ONLY

Parser Error: syntax error at or near "READ"
 -- ok
SELECT * FROM writetest
RESULT: 
	[]
 -- ok
SET TRANSACTION READ ONLY
ERROR:  -- ok
SET TRANSACTION READ ONLY

Parser Error: syntax error at or near "READ"
 -- ok
SET TRANSACTION READ WRITE
ERROR:  -- ok
SET TRANSACTION READ WRITE

Parser Error: syntax error at or near "READ"
 --fail
COMMIT


BEGIN

SET TRANSACTION READ WRITE
ERROR: 
SET TRANSACTION READ WRITE

Parser Error: syntax error at or near "READ"
 -- ok
SAVEPOINT x
ERROR:  -- ok
SAVEPOINT x

Parser Error: syntax error at or near "SAVEPOINT"

SET TRANSACTION READ WRITE
ERROR: 
SET TRANSACTION READ WRITE

Parser Error: syntax error at or near "READ"
 -- ok
SET TRANSACTION READ ONLY
ERROR:  -- ok
SET TRANSACTION READ ONLY

Parser Error: syntax error at or near "READ"
 -- ok
SELECT * FROM writetest
RESULT: 
	[]
 -- ok
SET TRANSACTION READ ONLY
ERROR:  -- ok
SET TRANSACTION READ ONLY

Parser Error: syntax error at or near "READ"
 -- ok
SET TRANSACTION READ WRITE
ERROR:  -- ok
SET TRANSACTION READ WRITE

Parser Error: syntax error at or near "READ"
 --fail
COMMIT


BEGIN

SET TRANSACTION READ WRITE
ERROR: 
SET TRANSACTION READ WRITE

Parser Error: syntax error at or near "READ"
 -- ok
SAVEPOINT x
ERROR:  -- ok
SAVEPOINT x

Parser Error: syntax error at or near "SAVEPOINT"

SET TRANSACTION READ ONLY
ERROR: 
SET TRANSACTION READ ONLY

Parser Error: syntax error at or near "READ"
 -- ok
SELECT * FROM writetest
RESULT: 
	[]
 -- ok
ROLLBACK TO SAVEPOINT x
ERROR:  -- ok
ROLLBACK TO SAVEPOINT x

Parser Error: syntax error at or near "TO"

SHOW transaction_read_only
ERROR: 
SHOW transaction_read_only

Catalog Error: Table with name transaction_read_only does not exist!
Did you mean "CHAR_TBL"?
  -- off
SAVEPOINT y
ERROR:   -- off
SAVEPOINT y

Parser Error: syntax error at or near "SAVEPOINT"

SET TRANSACTION READ ONLY
ERROR: 
SET TRANSACTION READ ONLY

Parser Error: syntax error at or near "READ"
 -- ok
SELECT * FROM writetest
RESULT: 
	[]
 -- ok
RELEASE SAVEPOINT y
ERROR:  -- ok
RELEASE SAVEPOINT y

Parser Error: syntax error at or near "RELEASE"

SHOW transaction_read_only
ERROR: 
SHOW transaction_read_only

Catalog Error: Table with name transaction_read_only does not exist!
Did you mean "CHAR_TBL"?
  -- off
COMMIT


SET SESSION CHARACTERISTICS AS TRANSACTION READ ONLY
ERROR: 

SET SESSION CHARACTERISTICS AS TRANSACTION READ ONLY

Parser Error: syntax error at or near "AS"


DROP TABLE writetest
 -- fail
INSERT INTO writetest VALUES (1)
ERROR:  -- fail
INSERT INTO writetest VALUES (1)

Catalog Error: Table with name writetest does not exist!
Did you mean "temptest"?
 -- fail
SELECT * FROM writetest
ERROR:  -- fail
SELECT * FROM writetest

Catalog Error: Table with name writetest does not exist!
Did you mean "temptest"?
 -- ok
DELETE FROM temptest
 -- ok
UPDATE temptest SET a = 0 FROM writetest WHERE temptest.a = 1 AND writetest.a = temptest.a
ERROR:  -- ok
UPDATE temptest SET a = 0 FROM writetest WHERE temptest.a = 1 AND writetest.a = temptest.a

Catalog Error: Table with name writetest does not exist!
Did you mean "temptest"?
LINE 2: UPDATE temptest SET a = 0 FROM writetest WHERE temptest.a = 1 A...
                                       ^
 -- ok
PREPARE test AS UPDATE writetest SET a = 0
ERROR:  -- ok
PREPARE test AS UPDATE writetest SET a = 0

Catalog Error: Table with name writetest does not exist!
Did you mean "temptest"?
LINE 2: PREPARE test AS UPDATE writetest SET a = 0
                               ^
 -- ok
EXECUTE test
ERROR:  -- ok
EXECUTE test

Binder Error: Prepared statement "test" does not exist
 -- fail
SELECT * FROM writetest, temptest
ERROR:  -- fail
SELECT * FROM writetest, temptest

Catalog Error: Table with name writetest does not exist!
Did you mean "temptest"?
 -- ok
CREATE TABLE test AS SELECT * FROM writetest
ERROR:  -- ok
CREATE TABLE test AS SELECT * FROM writetest

Catalog Error: Table with name writetest does not exist!
Did you mean "temptest"?
LINE 2: CREATE TABLE test AS SELECT * FROM writetest
                                           ^
 -- fail

START TRANSACTION READ WRITE
ERROR:  -- fail

START TRANSACTION READ WRITE

Parser Error: syntax error at or near "READ"

DROP TABLE writetest
ERROR: 
DROP TABLE writetest

Catalog Error: Table with name writetest does not exist!
Did you mean "temptest"?
 -- ok
COMMIT
ERROR:  -- ok
COMMIT

TransactionContext Error: cannot commit - no transaction is active


-- Subtransactions, basic tests
-- create & drop tables
SET SESSION CHARACTERISTICS AS TRANSACTION READ WRITE
ERROR: 

-- Subtransactions, basic tests
-- create & drop tables
SET SESSION CHARACTERISTICS AS TRANSACTION READ WRITE

Parser Error: syntax error at or near "AS"

CREATE TABLE trans_foobar (a int)

BEGIN

	CREATE TABLE trans_foo (a int)

	SAVEPOINT one
ERROR: 
	SAVEPOINT one

Parser Error: syntax error at or near "SAVEPOINT"

		DROP TABLE trans_foo

		CREATE TABLE trans_bar (a int)

	ROLLBACK TO SAVEPOINT one
ERROR: 
	ROLLBACK TO SAVEPOINT one

Parser Error: syntax error at or near "TO"

	RELEASE SAVEPOINT one
ERROR: 
	RELEASE SAVEPOINT one

Parser Error: syntax error at or near "RELEASE"

	SAVEPOINT two
ERROR: 
	SAVEPOINT two

Parser Error: syntax error at or near "SAVEPOINT"

		CREATE TABLE trans_baz (a int)

	RELEASE SAVEPOINT two
ERROR: 
	RELEASE SAVEPOINT two

Parser Error: syntax error at or near "RELEASE"

	drop TABLE trans_foobar

	CREATE TABLE trans_barbaz (a int)

COMMIT

-- should exist: trans_barbaz, trans_baz, trans_foo
SELECT * FROM trans_foo
ERROR: 
-- should exist: trans_barbaz, trans_baz, trans_foo
SELECT * FROM trans_foo

Catalog Error: Table with name trans_foo does not exist!
Did you mean "trans_bar"?
		-- should be empty
SELECT * FROM trans_bar
RESULT: 
	[]
		-- shouldn''t exist
SELECT * FROM trans_barbaz
RESULT: 
	[]
	-- should be empty
SELECT * FROM trans_baz
RESULT: 
	[]
		-- should be empty

-- inserts
BEGIN

	INSERT INTO trans_foo VALUES (1)
ERROR: 
	INSERT INTO trans_foo VALUES (1)

Catalog Error: Table with name trans_foo does not exist!
Did you mean "trans_bar"?

	SAVEPOINT one
ERROR: 
	SAVEPOINT one

Parser Error: syntax error at or near "SAVEPOINT"

		INSERT into trans_bar VALUES (1)

	ROLLBACK TO one
ERROR: 
	ROLLBACK TO one

Parser Error: syntax error at or near "TO"

	RELEASE SAVEPOINT one
ERROR: 
	RELEASE SAVEPOINT one

Parser Error: syntax error at or near "RELEASE"

	SAVEPOINT two
ERROR: 
	SAVEPOINT two

Parser Error: syntax error at or near "SAVEPOINT"

		INSERT into trans_barbaz VALUES (1)

	RELEASE two
ERROR: 
	RELEASE two

Parser Error: syntax error at or near "RELEASE"

	SAVEPOINT three
ERROR: 
	SAVEPOINT three

Parser Error: syntax error at or near "SAVEPOINT"

		SAVEPOINT four
ERROR: 
		SAVEPOINT four

Parser Error: syntax error at or near "SAVEPOINT"

			INSERT INTO trans_foo VALUES (2)
ERROR: 
			INSERT INTO trans_foo VALUES (2)

Catalog Error: Table with name trans_foo does not exist!
Did you mean "trans_bar"?

		RELEASE SAVEPOINT four
ERROR: 
		RELEASE SAVEPOINT four

Parser Error: syntax error at or near "RELEASE"

	ROLLBACK TO SAVEPOINT three
ERROR: 
	ROLLBACK TO SAVEPOINT three

Parser Error: syntax error at or near "TO"

	RELEASE SAVEPOINT three
ERROR: 
	RELEASE SAVEPOINT three

Parser Error: syntax error at or near "RELEASE"

	INSERT INTO trans_foo VALUES (3)
ERROR: 
	INSERT INTO trans_foo VALUES (3)

Catalog Error: Table with name trans_foo does not exist!
Did you mean "trans_bar"?

COMMIT

SELECT * FROM trans_foo
ERROR: 
SELECT * FROM trans_foo

Catalog Error: Table with name trans_foo does not exist!
Did you mean "trans_bar"?
		-- should have 1 and 3
SELECT * FROM trans_barbaz
RESULT: 
	[(1,)]
	-- should have 1

-- test whole-tree commit
BEGIN

	SAVEPOINT one
ERROR: 
	SAVEPOINT one

Parser Error: syntax error at or near "SAVEPOINT"

		SELECT trans_foo
ERROR: 
		SELECT trans_foo

Binder Error: Referenced column "trans_foo" not found in FROM clause!

	ROLLBACK TO SAVEPOINT one
ERROR: 
	ROLLBACK TO SAVEPOINT one

Parser Error: syntax error at or near "TO"

	RELEASE SAVEPOINT one
ERROR: 
	RELEASE SAVEPOINT one

Parser Error: syntax error at or near "RELEASE"

	SAVEPOINT two
ERROR: 
	SAVEPOINT two

Parser Error: syntax error at or near "SAVEPOINT"

		CREATE TABLE savepoints (a int)

		SAVEPOINT three
ERROR: 
		SAVEPOINT three

Parser Error: syntax error at or near "SAVEPOINT"

			INSERT INTO savepoints VALUES (1)

			SAVEPOINT four
ERROR: 
			SAVEPOINT four

Parser Error: syntax error at or near "SAVEPOINT"

				INSERT INTO savepoints VALUES (2)

				SAVEPOINT five
ERROR: 
				SAVEPOINT five

Parser Error: syntax error at or near "SAVEPOINT"

					INSERT INTO savepoints VALUES (3)

				ROLLBACK TO SAVEPOINT five
ERROR: 
				ROLLBACK TO SAVEPOINT five

Parser Error: syntax error at or near "TO"

COMMIT

COMMIT
ERROR: 
COMMIT

TransactionContext Error: cannot commit - no transaction is active
		-- should not be in a transaction block
SELECT * FROM savepoints
RESULT: 
	[(1,), (2,), (3,)]


-- test whole-tree rollback
BEGIN

	SAVEPOINT one
ERROR: 
	SAVEPOINT one

Parser Error: syntax error at or near "SAVEPOINT"

		DELETE FROM savepoints WHERE a=1

	RELEASE SAVEPOINT one
ERROR: 
	RELEASE SAVEPOINT one

Parser Error: syntax error at or near "RELEASE"

	SAVEPOINT two
ERROR: 
	SAVEPOINT two

Parser Error: syntax error at or near "SAVEPOINT"

		DELETE FROM savepoints WHERE a=1

		SAVEPOINT three
ERROR: 
		SAVEPOINT three

Parser Error: syntax error at or near "SAVEPOINT"

			DELETE FROM savepoints WHERE a=2

ROLLBACK

COMMIT
ERROR: 
COMMIT

TransactionContext Error: cannot commit - no transaction is active
		-- should not be in a transaction block

SELECT * FROM savepoints
RESULT: 
	[(1,), (2,), (3,)]


-- test whole-tree commit on an aborted subtransaction
BEGIN

	INSERT INTO savepoints VALUES (4)

	SAVEPOINT one
ERROR: 
	SAVEPOINT one

Parser Error: syntax error at or near "SAVEPOINT"

		INSERT INTO savepoints VALUES (5)

		SELECT trans_foo
ERROR: 
		SELECT trans_foo

Binder Error: Referenced column "trans_foo" not found in FROM clause!

COMMIT

SELECT * FROM savepoints
RESULT: 
	[(1,), (2,), (3,), (4,), (5,)]


BEGIN

	INSERT INTO savepoints VALUES (6)

	SAVEPOINT one
ERROR: 
	SAVEPOINT one

Parser Error: syntax error at or near "SAVEPOINT"

		INSERT INTO savepoints VALUES (7)

	RELEASE SAVEPOINT one
ERROR: 
	RELEASE SAVEPOINT one

Parser Error: syntax error at or near "RELEASE"

	INSERT INTO savepoints VALUES (8)

COMMIT

-- rows 6 and 8 should have been created by the same xact
SELECT a.xmin = b.xmin FROM savepoints a, savepoints b WHERE a.a=6 AND b.a=8
ERROR: 
-- rows 6 and 8 should have been created by the same xact
SELECT a.xmin = b.xmin FROM savepoints a, savepoints b WHERE a.a=6 AND b.a=8

Binder Error: Ambiguous reference to column name "a" (use: "b.a" or "a.a")

-- rows 6 and 7 should have been created by different xacts
SELECT a.xmin = b.xmin FROM savepoints a, savepoints b WHERE a.a=6 AND b.a=7
ERROR: 
-- rows 6 and 7 should have been created by different xacts
SELECT a.xmin = b.xmin FROM savepoints a, savepoints b WHERE a.a=6 AND b.a=7

Binder Error: Ambiguous reference to column name "a" (use: "b.a" or "a.a")


BEGIN

	INSERT INTO savepoints VALUES (9)

	SAVEPOINT one
ERROR: 
	SAVEPOINT one

Parser Error: syntax error at or near "SAVEPOINT"

		INSERT INTO savepoints VALUES (10)

	ROLLBACK TO SAVEPOINT one
ERROR: 
	ROLLBACK TO SAVEPOINT one

Parser Error: syntax error at or near "TO"

		INSERT INTO savepoints VALUES (11)

COMMIT

SELECT a FROM savepoints WHERE a in (9, 10, 11)
RESULT: 
	[(9,), (10,), (11,)]

-- rows 9 and 11 should have been created by different xacts
SELECT a.xmin = b.xmin FROM savepoints a, savepoints b WHERE a.a=9 AND b.a=11
ERROR: 
-- rows 9 and 11 should have been created by different xacts
SELECT a.xmin = b.xmin FROM savepoints a, savepoints b WHERE a.a=9 AND b.a=11

Binder Error: Ambiguous reference to column name "a" (use: "b.a" or "a.a")


BEGIN

	INSERT INTO savepoints VALUES (12)

	SAVEPOINT one
ERROR: 
	SAVEPOINT one

Parser Error: syntax error at or near "SAVEPOINT"

		INSERT INTO savepoints VALUES (13)

		SAVEPOINT two
ERROR: 
		SAVEPOINT two

Parser Error: syntax error at or near "SAVEPOINT"

			INSERT INTO savepoints VALUES (14)

	ROLLBACK TO SAVEPOINT one
ERROR: 
	ROLLBACK TO SAVEPOINT one

Parser Error: syntax error at or near "TO"

		INSERT INTO savepoints VALUES (15)

		SAVEPOINT two
ERROR: 
		SAVEPOINT two

Parser Error: syntax error at or near "SAVEPOINT"

			INSERT INTO savepoints VALUES (16)

			SAVEPOINT three
ERROR: 
			SAVEPOINT three

Parser Error: syntax error at or near "SAVEPOINT"

				INSERT INTO savepoints VALUES (17)

COMMIT

SELECT a FROM savepoints WHERE a BETWEEN 12 AND 17
RESULT: 
	[(12,), (13,), (14,), (15,), (16,), (17,)]


BEGIN

	INSERT INTO savepoints VALUES (18)

	SAVEPOINT one
ERROR: 
	SAVEPOINT one

Parser Error: syntax error at or near "SAVEPOINT"

		INSERT INTO savepoints VALUES (19)

		SAVEPOINT two
ERROR: 
		SAVEPOINT two

Parser Error: syntax error at or near "SAVEPOINT"

			INSERT INTO savepoints VALUES (20)

	ROLLBACK TO SAVEPOINT one
ERROR: 
	ROLLBACK TO SAVEPOINT one

Parser Error: syntax error at or near "TO"

		INSERT INTO savepoints VALUES (21)

	ROLLBACK TO SAVEPOINT one
ERROR: 
	ROLLBACK TO SAVEPOINT one

Parser Error: syntax error at or near "TO"

		INSERT INTO savepoints VALUES (22)

COMMIT

SELECT a FROM savepoints WHERE a BETWEEN 18 AND 22
RESULT: 
	[(18,), (19,), (20,), (21,), (22,)]


DROP TABLE savepoints


-- only in a transaction block:
SAVEPOINT one
ERROR: 

-- only in a transaction block:
SAVEPOINT one

Parser Error: syntax error at or near "SAVEPOINT"

ROLLBACK TO SAVEPOINT one
ERROR: 
ROLLBACK TO SAVEPOINT one

Parser Error: syntax error at or near "TO"

RELEASE SAVEPOINT one
ERROR: 
RELEASE SAVEPOINT one

Parser Error: syntax error at or near "RELEASE"


-- Only ''rollback to'' allowed in aborted state
BEGIN

  SAVEPOINT one
ERROR: 
  SAVEPOINT one

Parser Error: syntax error at or near "SAVEPOINT"

  SELECT 0/0
RESULT: 
	[(None,)]

  SAVEPOINT two
ERROR: 
  SAVEPOINT two

Parser Error: syntax error at or near "SAVEPOINT"
    -- ignored till the end of ...
  RELEASE SAVEPOINT one
ERROR:     -- ignored till the end of ...
  RELEASE SAVEPOINT one

Parser Error: syntax error at or near "RELEASE"
      -- ignored till the end of ...
  ROLLBACK TO SAVEPOINT one
ERROR:       -- ignored till the end of ...
  ROLLBACK TO SAVEPOINT one

Parser Error: syntax error at or near "TO"

  SELECT 1
RESULT: 
	[(1,)]

COMMIT

SELECT 1
RESULT: 
	[(1,)]
			-- this should work

-- check non-transactional behavior of cursors
BEGIN

	DECLARE c CURSOR FOR SELECT unique2 FROM tenk1 ORDER BY unique2
ERROR: 
	DECLARE c CURSOR FOR SELECT unique2 FROM tenk1 ORDER BY unique2

Parser Error: syntax error at or near "DECLARE"

	SAVEPOINT one
ERROR: 
	SAVEPOINT one

Parser Error: syntax error at or near "SAVEPOINT"

		FETCH 10 FROM c
ERROR: 
		FETCH 10 FROM c

Parser Error: syntax error at or near "FETCH"

	ROLLBACK TO SAVEPOINT one
ERROR: 
	ROLLBACK TO SAVEPOINT one

Parser Error: syntax error at or near "TO"

		FETCH 10 FROM c
ERROR: 
		FETCH 10 FROM c

Parser Error: syntax error at or near "FETCH"

	RELEASE SAVEPOINT one
ERROR: 
	RELEASE SAVEPOINT one

Parser Error: syntax error at or near "RELEASE"

	FETCH 10 FROM c
ERROR: 
	FETCH 10 FROM c

Parser Error: syntax error at or near "FETCH"

	CLOSE c
ERROR: 
	CLOSE c

Parser Error: syntax error at or near "CLOSE"

	DECLARE c CURSOR FOR SELECT unique2/0 FROM tenk1 ORDER BY unique2
ERROR: 
	DECLARE c CURSOR FOR SELECT unique2/0 FROM tenk1 ORDER BY unique2

Parser Error: syntax error at or near "DECLARE"

	SAVEPOINT two
ERROR: 
	SAVEPOINT two

Parser Error: syntax error at or near "SAVEPOINT"

		FETCH 10 FROM c
ERROR: 
		FETCH 10 FROM c

Parser Error: syntax error at or near "FETCH"

	ROLLBACK TO SAVEPOINT two
ERROR: 
	ROLLBACK TO SAVEPOINT two

Parser Error: syntax error at or near "TO"

	-- c is now dead to the world ...
		FETCH 10 FROM c
ERROR: 
	-- c is now dead to the world ...
		FETCH 10 FROM c

Parser Error: syntax error at or near "FETCH"

	ROLLBACK TO SAVEPOINT two
ERROR: 
	ROLLBACK TO SAVEPOINT two

Parser Error: syntax error at or near "TO"

	RELEASE SAVEPOINT two
ERROR: 
	RELEASE SAVEPOINT two

Parser Error: syntax error at or near "RELEASE"

	FETCH 10 FROM c
ERROR: 
	FETCH 10 FROM c

Parser Error: syntax error at or near "FETCH"

COMMIT


--
-- Check that ''stable'' functions are really stable.  They should not be
-- able to see the partial results of the calling query.  (Ideally we would
-- also check that they don''t see commits of concurrent transactions, but
-- that''s a mite hard to do within the limitations of pg_regress.)
--
select * from xacttest
RESULT: 
	[(56, 7.800000190734863), (100, 99.09700012207031), (0, 0.09561000019311905), (42, 324.7799987792969), (777, 777.7769775390625)]


create or replace function max_xacttest() returns smallint language sql as
'select max(a) from xacttest' stable
ERROR: 

create or replace function max_xacttest() returns smallint language sql as
'select max(a) from xacttest' stable

Parser Error: syntax error at or near "returns"


begin

update xacttest set a = max_xacttest() + 10 where a > 0
ERROR: 
update xacttest set a = max_xacttest() + 10 where a > 0

Catalog Error: Scalar Function with name max_xacttest does not exist!
Did you mean "make_date"?
LINE 2: update xacttest set a = max_xacttest() + 10 where a > 0
                                ^

select * from xacttest
RESULT: 
	[(56, 7.800000190734863), (100, 99.09700012207031), (0, 0.09561000019311905), (42, 324.7799987792969), (777, 777.7769775390625)]

rollback


-- But a volatile function can see the partial results of the calling query
create or replace function max_xacttest() returns smallint language sql as
'select max(a) from xacttest' volatile
ERROR: 

-- But a volatile function can see the partial results of the calling query
create or replace function max_xacttest() returns smallint language sql as
'select max(a) from xacttest' volatile

Parser Error: syntax error at or near "returns"


begin

update xacttest set a = max_xacttest() + 10 where a > 0
ERROR: 
update xacttest set a = max_xacttest() + 10 where a > 0

Catalog Error: Scalar Function with name max_xacttest does not exist!
Did you mean "make_date"?
LINE 2: update xacttest set a = max_xacttest() + 10 where a > 0
                                ^

select * from xacttest
RESULT: 
	[(56, 7.800000190734863), (100, 99.09700012207031), (0, 0.09561000019311905), (42, 324.7799987792969), (777, 777.7769775390625)]

rollback


-- Now the same test with plpgsql (since it depends on SPI which is different)
create or replace function max_xacttest() returns smallint language plpgsql as
'begin return max(a) from xacttest; end' stable
ERROR: 

-- Now the same test with plpgsql (since it depends on SPI which is different)
create or replace function max_xacttest() returns smallint language plpgsql as
'begin return max(a) from xacttest; end' stable

Parser Error: syntax error at or near "returns"


begin

update xacttest set a = max_xacttest() + 10 where a > 0
ERROR: 
update xacttest set a = max_xacttest() + 10 where a > 0

Catalog Error: Scalar Function with name max_xacttest does not exist!
Did you mean "make_date"?
LINE 2: update xacttest set a = max_xacttest() + 10 where a > 0
                                ^

select * from xacttest
RESULT: 
	[(56, 7.800000190734863), (100, 99.09700012207031), (0, 0.09561000019311905), (42, 324.7799987792969), (777, 777.7769775390625)]

rollback


create or replace function max_xacttest() returns smallint language plpgsql as
'begin return max(a) from xacttest; end' volatile
ERROR: 

create or replace function max_xacttest() returns smallint language plpgsql as
'begin return max(a) from xacttest; end' volatile

Parser Error: syntax error at or near "returns"


begin

update xacttest set a = max_xacttest() + 10 where a > 0
ERROR: 
update xacttest set a = max_xacttest() + 10 where a > 0

Catalog Error: Scalar Function with name max_xacttest does not exist!
Did you mean "make_date"?
LINE 2: update xacttest set a = max_xacttest() + 10 where a > 0
                                ^

select * from xacttest
RESULT: 
	[(56, 7.800000190734863), (100, 99.09700012207031), (0, 0.09561000019311905), (42, 324.7799987792969), (777, 777.7769775390625)]

rollback



-- test case for problems with dropping an open relation during abort
BEGIN

	savepoint x
ERROR: 
	savepoint x

Parser Error: syntax error at or near "savepoint"

		CREATE TABLE koju (a INT UNIQUE)

		INSERT INTO koju VALUES (1)

		INSERT INTO koju VALUES (1)
ERROR: 
		INSERT INTO koju VALUES (1)

Constraint Error: PRIMARY KEY or UNIQUE constraint violated: duplicate key "1"

	rollback to x
ERROR: 
	rollback to x

Parser Error: syntax error at or near "to"


	CREATE TABLE koju (a INT UNIQUE)
ERROR: 

	CREATE TABLE koju (a INT UNIQUE)

Invalid Input Error: Attempting to execute an unsuccessful or closed pending query result
Error: TransactionContext Error: Current transaction is aborted (please ROLLBACK)

	INSERT INTO koju VALUES (1)
ERROR: 
	INSERT INTO koju VALUES (1)

Invalid Input Error: Attempting to execute an unsuccessful or closed pending query result
Error: TransactionContext Error: Current transaction is aborted (please ROLLBACK)

	INSERT INTO koju VALUES (1)
ERROR: 
	INSERT INTO koju VALUES (1)

Invalid Input Error: Attempting to execute an unsuccessful or closed pending query result
Error: TransactionContext Error: Current transaction is aborted (please ROLLBACK)

ROLLBACK


DROP TABLE trans_foo
ERROR: 

DROP TABLE trans_foo

Catalog Error: Table with name trans_foo does not exist!
Did you mean "trans_bar"?

DROP TABLE trans_baz

DROP TABLE trans_barbaz



-- test case for problems with revalidating an open relation during abort
create function inverse(int) returns float8 as
$$
begin
  analyze revalidate_bug;
  return 1::float8/$1;
exception
  when division_by_zero then return 0;
end$$ language plpgsql volatile
ERROR: 


-- test case for problems with revalidating an open relation during abort
create function inverse(int) returns float8 as
$$
begin
  analyze revalidate_bug;
  return 1::float8/$1;
exception
  when division_by_zero then return 0;
end$$ language plpgsql volatile

Parser Error: syntax error at or near "returns"


create table revalidate_bug (c float8 unique)

insert into revalidate_bug values (1)

insert into revalidate_bug values (inverse(0))
ERROR: 
insert into revalidate_bug values (inverse(0))

Catalog Error: Scalar Function with name inverse does not exist!
Did you mean "reverse"?
LINE 2: insert into revalidate_bug values (inverse(0))
                                           ^


drop table revalidate_bug

drop function inverse(int)
ERROR: 
drop function inverse(int)

Parser Error: syntax error at or near "("



-- verify that cursors created during an aborted subtransaction are
-- closed, but that we do not rollback the effect of any FETCHs
-- performed in the aborted subtransaction
begin


savepoint x
ERROR: 

savepoint x

Parser Error: syntax error at or near "savepoint"

create table trans_abc (a int)

insert into trans_abc values (5)

insert into trans_abc values (10)

declare foo cursor for select * from trans_abc
ERROR: 
declare foo cursor for select * from trans_abc

Parser Error: syntax error at or near "declare"

fetch from foo
ERROR: 
fetch from foo

Parser Error: syntax error at or near "fetch"

rollback to x
ERROR: 
rollback to x

Parser Error: syntax error at or near "to"


-- should fail
fetch from foo
ERROR: 

-- should fail
fetch from foo

Parser Error: syntax error at or near "fetch"

commit


begin


create table trans_abc (a int)
ERROR: 

create table trans_abc (a int)

Catalog Error: Table with name "trans_abc" already exists!

insert into trans_abc values (5)

insert into trans_abc values (10)

insert into trans_abc values (15)

declare foo cursor for select * from trans_abc
ERROR: 
declare foo cursor for select * from trans_abc

Parser Error: syntax error at or near "declare"


fetch from foo
ERROR: 

fetch from foo

Parser Error: syntax error at or near "fetch"


savepoint x
ERROR: 

savepoint x

Parser Error: syntax error at or near "savepoint"

fetch from foo
ERROR: 
fetch from foo

Parser Error: syntax error at or near "fetch"

rollback to x
ERROR: 
rollback to x

Parser Error: syntax error at or near "to"


fetch from foo
ERROR: 

fetch from foo

Parser Error: syntax error at or near "fetch"


abort



-- Test for proper cleanup after a failure in a cursor portal
-- that was created in an outer subtransaction
CREATE FUNCTION invert(x float8) RETURNS float8 LANGUAGE plpgsql AS
$$ begin return 1/x; end $$
ERROR: 


-- Test for proper cleanup after a failure in a cursor portal
-- that was created in an outer subtransaction
CREATE FUNCTION invert(x float8) RETURNS float8 LANGUAGE plpgsql AS
$$ begin return 1/x; end $$

Parser Error: syntax error at or near "float8"


CREATE FUNCTION create_temp_tab() RETURNS text
LANGUAGE plpgsql AS $$
BEGIN
  CREATE TEMP TABLE new_table (f1 float8);
  -- case of interest is that we fail while holding an open
  -- relcache reference to new_table
  INSERT INTO new_table SELECT invert(0.0);
  RETURN 'foo';
END $$
ERROR: 

CREATE FUNCTION create_temp_tab() RETURNS text
LANGUAGE plpgsql AS $$
BEGIN
  CREATE TEMP TABLE new_table (f1 float8);
  -- case of interest is that we fail while holding an open
  -- relcache reference to new_table
  INSERT INTO new_table SELECT invert(0.0);
  RETURN 'foo';
END $$

Parser Error: syntax error at or near "RETURNS"


BEGIN

DECLARE ok CURSOR FOR SELECT * FROM int8_tbl
ERROR: 
DECLARE ok CURSOR FOR SELECT * FROM int8_tbl

Parser Error: syntax error at or near "DECLARE"

DECLARE ctt CURSOR FOR SELECT create_temp_tab()
ERROR: 
DECLARE ctt CURSOR FOR SELECT create_temp_tab()

Parser Error: syntax error at or near "DECLARE"

FETCH ok
ERROR: 
FETCH ok

Parser Error: syntax error at or near "FETCH"

SAVEPOINT s1
ERROR: 
SAVEPOINT s1

Parser Error: syntax error at or near "SAVEPOINT"

FETCH ok
ERROR: 
FETCH ok

Parser Error: syntax error at or near "FETCH"
  -- should work
FETCH ctt
ERROR:   -- should work
FETCH ctt

Parser Error: syntax error at or near "FETCH"
 -- error occurs here
ROLLBACK TO s1
ERROR:  -- error occurs here
ROLLBACK TO s1

Parser Error: syntax error at or near "TO"

FETCH ok
ERROR: 
FETCH ok

Parser Error: syntax error at or near "FETCH"
  -- should work
FETCH ctt
ERROR:   -- should work
FETCH ctt

Parser Error: syntax error at or near "FETCH"
 -- must be rejected
COMMIT


DROP FUNCTION create_temp_tab()
ERROR: 

DROP FUNCTION create_temp_tab()

Parser Error: syntax error at or near "("

DROP FUNCTION invert(x float8)
ERROR: 
DROP FUNCTION invert(x float8)

Parser Error: syntax error at or near "("



-- Tests for AND CHAIN

CREATE TABLE trans_abc (a int)
ERROR: 


-- Tests for AND CHAIN

CREATE TABLE trans_abc (a int)

Catalog Error: Table with name "trans_abc" already exists!


-- set nondefault value so we have something to override below
SET default_transaction_read_only = on
ERROR: 

-- set nondefault value so we have something to override below
SET default_transaction_read_only = on

Parser Error: syntax error at or near "on"


START TRANSACTION ISOLATION LEVEL REPEATABLE READ, READ WRITE, DEFERRABLE
ERROR: 

START TRANSACTION ISOLATION LEVEL REPEATABLE READ, READ WRITE, DEFERRABLE

Parser Error: syntax error at or near "ISOLATION"

SHOW transaction_isolation
ERROR: 
SHOW transaction_isolation

Catalog Error: Table with name transaction_isolation does not exist!
Did you mean "trans_abc"?

SHOW transaction_read_only
ERROR: 
SHOW transaction_read_only

Catalog Error: Table with name transaction_read_only does not exist!
Did you mean "trans_abc"?

SHOW transaction_deferrable
ERROR: 
SHOW transaction_deferrable

Catalog Error: Table with name transaction_deferrable does not exist!
Did you mean "trans_abc"?

INSERT INTO trans_abc VALUES (1)

INSERT INTO trans_abc VALUES (2)

COMMIT AND CHAIN
ERROR: 
COMMIT AND CHAIN

Parser Error: syntax error at or near "AND"
  -- TBLOCK_END
SHOW transaction_isolation
ERROR:   -- TBLOCK_END
SHOW transaction_isolation

Catalog Error: Table with name transaction_isolation does not exist!
Did you mean "trans_abc"?

SHOW transaction_read_only
ERROR: 
SHOW transaction_read_only

Catalog Error: Table with name transaction_read_only does not exist!
Did you mean "trans_abc"?

SHOW transaction_deferrable
ERROR: 
SHOW transaction_deferrable

Catalog Error: Table with name transaction_deferrable does not exist!
Did you mean "trans_abc"?

INSERT INTO trans_abc VALUES ('error')
ERROR: 
INSERT INTO trans_abc VALUES ('error')

Conversion Error: Could not convert string 'error' to INT32
LINE 2: INSERT INTO trans_abc VALUES ('error')
                                      ^

INSERT INTO trans_abc VALUES (3)
  -- check it''s really aborted
COMMIT AND CHAIN
ERROR:   -- check it''s really aborted
COMMIT AND CHAIN

Parser Error: syntax error at or near "AND"
  -- TBLOCK_ABORT_END
SHOW transaction_isolation
ERROR:   -- TBLOCK_ABORT_END
SHOW transaction_isolation

Catalog Error: Table with name transaction_isolation does not exist!
Did you mean "trans_abc"?

SHOW transaction_read_only
ERROR: 
SHOW transaction_read_only

Catalog Error: Table with name transaction_read_only does not exist!
Did you mean "trans_abc"?

SHOW transaction_deferrable
ERROR: 
SHOW transaction_deferrable

Catalog Error: Table with name transaction_deferrable does not exist!
Did you mean "trans_abc"?

INSERT INTO trans_abc VALUES (4)

COMMIT
ERROR: 
COMMIT

TransactionContext Error: cannot commit - no transaction is active


START TRANSACTION ISOLATION LEVEL REPEATABLE READ, READ WRITE, DEFERRABLE
ERROR: 

START TRANSACTION ISOLATION LEVEL REPEATABLE READ, READ WRITE, DEFERRABLE

Parser Error: syntax error at or near "ISOLATION"

SHOW transaction_isolation
ERROR: 
SHOW transaction_isolation

Catalog Error: Table with name transaction_isolation does not exist!
Did you mean "trans_abc"?

SHOW transaction_read_only
ERROR: 
SHOW transaction_read_only

Catalog Error: Table with name transaction_read_only does not exist!
Did you mean "trans_abc"?

SHOW transaction_deferrable
ERROR: 
SHOW transaction_deferrable

Catalog Error: Table with name transaction_deferrable does not exist!
Did you mean "trans_abc"?

SAVEPOINT x
ERROR: 
SAVEPOINT x

Parser Error: syntax error at or near "SAVEPOINT"

INSERT INTO trans_abc VALUES ('error')
ERROR: 
INSERT INTO trans_abc VALUES ('error')

Conversion Error: Could not convert string 'error' to INT32
LINE 2: INSERT INTO trans_abc VALUES ('error')
                                      ^

COMMIT AND CHAIN
ERROR: 
COMMIT AND CHAIN

Parser Error: syntax error at or near "AND"
  -- TBLOCK_ABORT_PENDING
SHOW transaction_isolation
ERROR:   -- TBLOCK_ABORT_PENDING
SHOW transaction_isolation

Catalog Error: Table with name transaction_isolation does not exist!
Did you mean "trans_abc"?

SHOW transaction_read_only
ERROR: 
SHOW transaction_read_only

Catalog Error: Table with name transaction_read_only does not exist!
Did you mean "trans_abc"?

SHOW transaction_deferrable
ERROR: 
SHOW transaction_deferrable

Catalog Error: Table with name transaction_deferrable does not exist!
Did you mean "trans_abc"?

INSERT INTO trans_abc VALUES (5)

COMMIT
ERROR: 
COMMIT

TransactionContext Error: cannot commit - no transaction is active


START TRANSACTION ISOLATION LEVEL REPEATABLE READ, READ WRITE, DEFERRABLE
ERROR: 

START TRANSACTION ISOLATION LEVEL REPEATABLE READ, READ WRITE, DEFERRABLE

Parser Error: syntax error at or near "ISOLATION"

SHOW transaction_isolation
ERROR: 
SHOW transaction_isolation

Catalog Error: Table with name transaction_isolation does not exist!
Did you mean "trans_abc"?

SHOW transaction_read_only
ERROR: 
SHOW transaction_read_only

Catalog Error: Table with name transaction_read_only does not exist!
Did you mean "trans_abc"?

SHOW transaction_deferrable
ERROR: 
SHOW transaction_deferrable

Catalog Error: Table with name transaction_deferrable does not exist!
Did you mean "trans_abc"?

SAVEPOINT x
ERROR: 
SAVEPOINT x

Parser Error: syntax error at or near "SAVEPOINT"

COMMIT AND CHAIN
ERROR: 
COMMIT AND CHAIN

Parser Error: syntax error at or near "AND"
  -- TBLOCK_SUBCOMMIT
SHOW transaction_isolation
ERROR:   -- TBLOCK_SUBCOMMIT
SHOW transaction_isolation

Catalog Error: Table with name transaction_isolation does not exist!
Did you mean "trans_abc"?

SHOW transaction_read_only
ERROR: 
SHOW transaction_read_only

Catalog Error: Table with name transaction_read_only does not exist!
Did you mean "trans_abc"?

SHOW transaction_deferrable
ERROR: 
SHOW transaction_deferrable

Catalog Error: Table with name transaction_deferrable does not exist!
Did you mean "trans_abc"?

COMMIT
ERROR: 
COMMIT

TransactionContext Error: cannot commit - no transaction is active


START TRANSACTION ISOLATION LEVEL READ COMMITTED, READ WRITE, DEFERRABLE
ERROR: 

START TRANSACTION ISOLATION LEVEL READ COMMITTED, READ WRITE, DEFERRABLE

Parser Error: syntax error at or near "ISOLATION"

SHOW transaction_isolation
ERROR: 
SHOW transaction_isolation

Catalog Error: Table with name transaction_isolation does not exist!
Did you mean "trans_abc"?

SHOW transaction_read_only
ERROR: 
SHOW transaction_read_only

Catalog Error: Table with name transaction_read_only does not exist!
Did you mean "trans_abc"?

SHOW transaction_deferrable
ERROR: 
SHOW transaction_deferrable

Catalog Error: Table with name transaction_deferrable does not exist!
Did you mean "trans_abc"?

SAVEPOINT x
ERROR: 
SAVEPOINT x

Parser Error: syntax error at or near "SAVEPOINT"

COMMIT AND CHAIN
ERROR: 
COMMIT AND CHAIN

Parser Error: syntax error at or near "AND"
  -- TBLOCK_SUBCOMMIT
SHOW transaction_isolation
ERROR:   -- TBLOCK_SUBCOMMIT
SHOW transaction_isolation

Catalog Error: Table with name transaction_isolation does not exist!
Did you mean "trans_abc"?

SHOW transaction_read_only
ERROR: 
SHOW transaction_read_only

Catalog Error: Table with name transaction_read_only does not exist!
Did you mean "trans_abc"?

SHOW transaction_deferrable
ERROR: 
SHOW transaction_deferrable

Catalog Error: Table with name transaction_deferrable does not exist!
Did you mean "trans_abc"?

COMMIT
ERROR: 
COMMIT

TransactionContext Error: cannot commit - no transaction is active


-- different mix of options just for fun
START TRANSACTION ISOLATION LEVEL SERIALIZABLE, READ WRITE, NOT DEFERRABLE
ERROR: 

-- different mix of options just for fun
START TRANSACTION ISOLATION LEVEL SERIALIZABLE, READ WRITE, NOT DEFERRABLE

Parser Error: syntax error at or near "ISOLATION"

SHOW transaction_isolation
ERROR: 
SHOW transaction_isolation

Catalog Error: Table with name transaction_isolation does not exist!
Did you mean "trans_abc"?

SHOW transaction_read_only
ERROR: 
SHOW transaction_read_only

Catalog Error: Table with name transaction_read_only does not exist!
Did you mean "trans_abc"?

SHOW transaction_deferrable
ERROR: 
SHOW transaction_deferrable

Catalog Error: Table with name transaction_deferrable does not exist!
Did you mean "trans_abc"?

INSERT INTO trans_abc VALUES (6)

ROLLBACK AND CHAIN
ERROR: 
ROLLBACK AND CHAIN

Parser Error: syntax error at or near "AND"
  -- TBLOCK_ABORT_PENDING
SHOW transaction_isolation
ERROR:   -- TBLOCK_ABORT_PENDING
SHOW transaction_isolation

Catalog Error: Table with name transaction_isolation does not exist!
Did you mean "trans_abc"?

SHOW transaction_read_only
ERROR: 
SHOW transaction_read_only

Catalog Error: Table with name transaction_read_only does not exist!
Did you mean "trans_abc"?

SHOW transaction_deferrable
ERROR: 
SHOW transaction_deferrable

Catalog Error: Table with name transaction_deferrable does not exist!
Did you mean "trans_abc"?

INSERT INTO trans_abc VALUES ('error')
ERROR: 
INSERT INTO trans_abc VALUES ('error')

Conversion Error: Could not convert string 'error' to INT32
LINE 2: INSERT INTO trans_abc VALUES ('error')
                                      ^

ROLLBACK AND CHAIN
ERROR: 
ROLLBACK AND CHAIN

Parser Error: syntax error at or near "AND"
  -- TBLOCK_ABORT_END
SHOW transaction_isolation
ERROR:   -- TBLOCK_ABORT_END
SHOW transaction_isolation

Catalog Error: Table with name transaction_isolation does not exist!
Did you mean "trans_abc"?

SHOW transaction_read_only
ERROR: 
SHOW transaction_read_only

Catalog Error: Table with name transaction_read_only does not exist!
Did you mean "trans_abc"?

SHOW transaction_deferrable
ERROR: 
SHOW transaction_deferrable

Catalog Error: Table with name transaction_deferrable does not exist!
Did you mean "trans_abc"?

ROLLBACK
ERROR: 
ROLLBACK

TransactionContext Error: cannot rollback - no transaction is active


-- not allowed outside a transaction block
COMMIT AND CHAIN
ERROR: 

-- not allowed outside a transaction block
COMMIT AND CHAIN

Parser Error: syntax error at or near "AND"
  -- error
ROLLBACK AND CHAIN
ERROR:   -- error
ROLLBACK AND CHAIN

Parser Error: syntax error at or near "AND"
  -- error

SELECT * FROM trans_abc ORDER BY 1
RESULT: 
	[(1,), (2,), (3,), (4,), (5,), (5,), (6,), (10,)]


RESET default_transaction_read_only
ERROR: 

RESET default_transaction_read_only

Catalog Error: unrecognized configuration parameter "default_transaction_read_only"

Did you mean: "default_order"


DROP TABLE trans_abc



-- Test assorted behaviors around the implicit transaction block created
-- when multiple SQL commands are sent in a single Query message.  These
-- tests rely on the fact that psql will not break SQL commands apart at a
-- backslash-quoted semicolon, but will send them as one Query.

create temp table i_table (f1 int)


-- psql will show all results of a multi-statement Query
SELECT 1\
ERROR: 

-- psql will show all results of a multi-statement Query
SELECT 1\

Parser Error: syntax error at or near "\"
 SELECT 2\
ERROR:  SELECT 2\

Parser Error: syntax error at or near "\"
 SELECT 3
RESULT: 
	[(3,)]


-- this implicitly commits:
insert into i_table values(1)\
ERROR: 

-- this implicitly commits:
insert into i_table values(1)\

Parser Error: syntax error at or near "\"
 select * from i_table
RESULT: 
	[]

-- 1/0 error will cause rolling back the whole implicit transaction
insert into i_table values(2)\
ERROR: 
-- 1/0 error will cause rolling back the whole implicit transaction
insert into i_table values(2)\

Parser Error: syntax error at or near "\"
 select * from i_table\
ERROR:  select * from i_table\

Parser Error: syntax error at or near "\"
 select 1/0
RESULT: 
	[(None,)]

select * from i_table
RESULT: 
	[]


rollback
ERROR: 

rollback

TransactionContext Error: cannot rollback - no transaction is active
  -- we are not in a transaction at this point

-- can use regular begin/commit/rollback within a single Query
begin\
ERROR:   -- we are not in a transaction at this point

-- can use regular begin/commit/rollback within a single Query
begin\

Parser Error: syntax error at or near "\"
 insert into i_table values(3)\
ERROR:  insert into i_table values(3)\

Parser Error: syntax error at or near "\"
 commit
ERROR:  commit

TransactionContext Error: cannot commit - no transaction is active

rollback
ERROR: 
rollback

TransactionContext Error: cannot rollback - no transaction is active
  -- we are not in a transaction at this point
begin\
ERROR:   -- we are not in a transaction at this point
begin\

Parser Error: syntax error at or near "\"
 insert into i_table values(4)\
ERROR:  insert into i_table values(4)\

Parser Error: syntax error at or near "\"
 rollback
ERROR:  rollback

TransactionContext Error: cannot rollback - no transaction is active

rollback
ERROR: 
rollback

TransactionContext Error: cannot rollback - no transaction is active
  -- we are not in a transaction at this point

-- begin converts implicit transaction into a regular one that
-- can extend past the end of the Query
select 1\
ERROR:   -- we are not in a transaction at this point

-- begin converts implicit transaction into a regular one that
-- can extend past the end of the Query
select 1\

Parser Error: syntax error at or near "\"
 begin\
ERROR:  begin\

Parser Error: syntax error at or near "\"
 insert into i_table values(5)

commit
ERROR: 
commit

TransactionContext Error: cannot commit - no transaction is active

select 1\
ERROR: 
select 1\

Parser Error: syntax error at or near "\"
 begin\
ERROR:  begin\

Parser Error: syntax error at or near "\"
 insert into i_table values(6)

rollback
ERROR: 
rollback

TransactionContext Error: cannot rollback - no transaction is active


-- commit in implicit-transaction state commits but issues a warning.
insert into i_table values(7)\
ERROR: 

-- commit in implicit-transaction state commits but issues a warning.
insert into i_table values(7)\

Parser Error: syntax error at or near "\"
 commit\
ERROR:  commit\

Parser Error: syntax error at or near "\"
 insert into i_table values(8)\
ERROR:  insert into i_table values(8)\

Parser Error: syntax error at or near "\"
 select 1/0
RESULT: 
	[(None,)]

-- similarly, rollback aborts but issues a warning.
insert into i_table values(9)\
ERROR: 
-- similarly, rollback aborts but issues a warning.
insert into i_table values(9)\

Parser Error: syntax error at or near "\"
 rollback\
ERROR:  rollback\

Parser Error: syntax error at or near "\"
 select 2
RESULT: 
	[(2,)]


select * from i_table
RESULT: 
	[(5,), (6,)]


rollback
ERROR: 

rollback

TransactionContext Error: cannot rollback - no transaction is active
  -- we are not in a transaction at this point

-- implicit transaction block is still a transaction block, for e.g. VACUUM
SELECT 1\
ERROR:   -- we are not in a transaction at this point

-- implicit transaction block is still a transaction block, for e.g. VACUUM
SELECT 1\

Parser Error: syntax error at or near "\"
 VACUUM

SELECT 1\
ERROR: 
SELECT 1\

Parser Error: syntax error at or near "\"
 COMMIT\
ERROR:  COMMIT\

Parser Error: syntax error at or near "\"
 VACUUM


-- we disallow savepoint-related commands in implicit-transaction state
SELECT 1\
ERROR: 

-- we disallow savepoint-related commands in implicit-transaction state
SELECT 1\

Parser Error: syntax error at or near "\"
 SAVEPOINT sp
ERROR:  SAVEPOINT sp

Parser Error: syntax error at or near "SAVEPOINT"

SELECT 1\
ERROR: 
SELECT 1\

Parser Error: syntax error at or near "\"
 COMMIT\
ERROR:  COMMIT\

Parser Error: syntax error at or near "\"
 SAVEPOINT sp
ERROR:  SAVEPOINT sp

Parser Error: syntax error at or near "SAVEPOINT"

ROLLBACK TO SAVEPOINT sp\
ERROR: 
ROLLBACK TO SAVEPOINT sp\

Parser Error: syntax error at or near "TO"
 SELECT 2
RESULT: 
	[(2,)]

SELECT 2\
ERROR: 
SELECT 2\

Parser Error: syntax error at or near "\"
 RELEASE SAVEPOINT sp\
ERROR:  RELEASE SAVEPOINT sp\

Parser Error: syntax error at or near "RELEASE"
 SELECT 3
RESULT: 
	[(3,)]


-- but this is OK, because the BEGIN converts it to a regular xact
SELECT 1\
ERROR: 

-- but this is OK, because the BEGIN converts it to a regular xact
SELECT 1\

Parser Error: syntax error at or near "\"
 BEGIN\
ERROR:  BEGIN\

Parser Error: syntax error at or near "\"
 SAVEPOINT sp\
ERROR:  SAVEPOINT sp\

Parser Error: syntax error at or near "SAVEPOINT"
 ROLLBACK TO SAVEPOINT sp\
ERROR:  ROLLBACK TO SAVEPOINT sp\

Parser Error: syntax error at or near "TO"
 COMMIT
ERROR:  COMMIT

TransactionContext Error: cannot commit - no transaction is active



-- Tests for AND CHAIN in implicit transaction blocks

SET TRANSACTION READ ONLY\
ERROR: 


-- Tests for AND CHAIN in implicit transaction blocks

SET TRANSACTION READ ONLY\

Parser Error: syntax error at or near "READ"
 COMMIT AND CHAIN
ERROR:  COMMIT AND CHAIN

Parser Error: syntax error at or near "AND"
  -- error
SHOW transaction_read_only
ERROR:   -- error
SHOW transaction_read_only

Catalog Error: Table with name transaction_read_only does not exist!
Did you mean "trans_bar"?


SET TRANSACTION READ ONLY\
ERROR: 

SET TRANSACTION READ ONLY\

Parser Error: syntax error at or near "READ"
 ROLLBACK AND CHAIN
ERROR:  ROLLBACK AND CHAIN

Parser Error: syntax error at or near "AND"
  -- error
SHOW transaction_read_only
ERROR:   -- error
SHOW transaction_read_only

Catalog Error: Table with name transaction_read_only does not exist!
Did you mean "trans_bar"?


CREATE TABLE trans_abc (a int)


-- COMMIT/ROLLBACK + COMMIT/ROLLBACK AND CHAIN
INSERT INTO trans_abc VALUES (7)\
ERROR: 

-- COMMIT/ROLLBACK + COMMIT/ROLLBACK AND CHAIN
INSERT INTO trans_abc VALUES (7)\

Parser Error: syntax error at or near "\"
 COMMIT\
ERROR:  COMMIT\

Parser Error: syntax error at or near "\"
 INSERT INTO trans_abc VALUES (8)\
ERROR:  INSERT INTO trans_abc VALUES (8)\

Parser Error: syntax error at or near "\"
 COMMIT AND CHAIN
ERROR:  COMMIT AND CHAIN

Parser Error: syntax error at or near "AND"
  -- 7 commit, 8 error
INSERT INTO trans_abc VALUES (9)\
ERROR:   -- 7 commit, 8 error
INSERT INTO trans_abc VALUES (9)\

Parser Error: syntax error at or near "\"
 ROLLBACK\
ERROR:  ROLLBACK\

Parser Error: syntax error at or near "\"
 INSERT INTO trans_abc VALUES (10)\
ERROR:  INSERT INTO trans_abc VALUES (10)\

Parser Error: syntax error at or near "\"
 ROLLBACK AND CHAIN
ERROR:  ROLLBACK AND CHAIN

Parser Error: syntax error at or near "AND"
  -- 9 rollback, 10 error

-- COMMIT/ROLLBACK AND CHAIN + COMMIT/ROLLBACK
INSERT INTO trans_abc VALUES (11)\
ERROR:   -- 9 rollback, 10 error

-- COMMIT/ROLLBACK AND CHAIN + COMMIT/ROLLBACK
INSERT INTO trans_abc VALUES (11)\

Parser Error: syntax error at or near "\"
 COMMIT AND CHAIN\
ERROR:  COMMIT AND CHAIN\

Parser Error: syntax error at or near "AND"
 INSERT INTO trans_abc VALUES (12)\
ERROR:  INSERT INTO trans_abc VALUES (12)\

Parser Error: syntax error at or near "\"
 COMMIT
ERROR:  COMMIT

TransactionContext Error: cannot commit - no transaction is active
  -- 11 error, 12 not reached
INSERT INTO trans_abc VALUES (13)\
ERROR:   -- 11 error, 12 not reached
INSERT INTO trans_abc VALUES (13)\

Parser Error: syntax error at or near "\"
 ROLLBACK AND CHAIN\
ERROR:  ROLLBACK AND CHAIN\

Parser Error: syntax error at or near "AND"
 INSERT INTO trans_abc VALUES (14)\
ERROR:  INSERT INTO trans_abc VALUES (14)\

Parser Error: syntax error at or near "\"
 ROLLBACK
ERROR:  ROLLBACK

TransactionContext Error: cannot rollback - no transaction is active
  -- 13 error, 14 not reached

-- START TRANSACTION + COMMIT/ROLLBACK AND CHAIN
START TRANSACTION ISOLATION LEVEL REPEATABLE READ\
ERROR:   -- 13 error, 14 not reached

-- START TRANSACTION + COMMIT/ROLLBACK AND CHAIN
START TRANSACTION ISOLATION LEVEL REPEATABLE READ\

Parser Error: syntax error at or near "ISOLATION"
 INSERT INTO trans_abc VALUES (15)\
ERROR:  INSERT INTO trans_abc VALUES (15)\

Parser Error: syntax error at or near "\"
 COMMIT AND CHAIN
ERROR:  COMMIT AND CHAIN

Parser Error: syntax error at or near "AND"
  -- 15 ok
SHOW transaction_isolation
ERROR:   -- 15 ok
SHOW transaction_isolation

Catalog Error: Table with name transaction_isolation does not exist!
Did you mean "trans_abc"?
  -- transaction is active at this point
COMMIT
ERROR:   -- transaction is active at this point
COMMIT

TransactionContext Error: cannot commit - no transaction is active


START TRANSACTION ISOLATION LEVEL REPEATABLE READ\
ERROR: 

START TRANSACTION ISOLATION LEVEL REPEATABLE READ\

Parser Error: syntax error at or near "ISOLATION"
 INSERT INTO trans_abc VALUES (16)\
ERROR:  INSERT INTO trans_abc VALUES (16)\

Parser Error: syntax error at or near "\"
 ROLLBACK AND CHAIN
ERROR:  ROLLBACK AND CHAIN

Parser Error: syntax error at or near "AND"
  -- 16 ok
SHOW transaction_isolation
ERROR:   -- 16 ok
SHOW transaction_isolation

Catalog Error: Table with name transaction_isolation does not exist!
Did you mean "trans_abc"?
  -- transaction is active at this point
ROLLBACK
ERROR:   -- transaction is active at this point
ROLLBACK

TransactionContext Error: cannot rollback - no transaction is active


SET default_transaction_isolation = 'read committed'
ERROR: 

SET default_transaction_isolation = 'read committed'

Catalog Error: unrecognized configuration parameter "default_transaction_isolation"

Did you mean: "default_collation"


-- START TRANSACTION + COMMIT/ROLLBACK + COMMIT/ROLLBACK AND CHAIN
START TRANSACTION ISOLATION LEVEL REPEATABLE READ\
ERROR: 

-- START TRANSACTION + COMMIT/ROLLBACK + COMMIT/ROLLBACK AND CHAIN
START TRANSACTION ISOLATION LEVEL REPEATABLE READ\

Parser Error: syntax error at or near "ISOLATION"
 INSERT INTO trans_abc VALUES (17)\
ERROR:  INSERT INTO trans_abc VALUES (17)\

Parser Error: syntax error at or near "\"
 COMMIT\
ERROR:  COMMIT\

Parser Error: syntax error at or near "\"
 INSERT INTO trans_abc VALUES (18)\
ERROR:  INSERT INTO trans_abc VALUES (18)\

Parser Error: syntax error at or near "\"
 COMMIT AND CHAIN
ERROR:  COMMIT AND CHAIN

Parser Error: syntax error at or near "AND"
  -- 17 commit, 18 error
SHOW transaction_isolation
ERROR:   -- 17 commit, 18 error
SHOW transaction_isolation

Catalog Error: Table with name transaction_isolation does not exist!
Did you mean "trans_abc"?
  -- out of transaction block

START TRANSACTION ISOLATION LEVEL REPEATABLE READ\
ERROR:   -- out of transaction block

START TRANSACTION ISOLATION LEVEL REPEATABLE READ\

Parser Error: syntax error at or near "ISOLATION"
 INSERT INTO trans_abc VALUES (19)\
ERROR:  INSERT INTO trans_abc VALUES (19)\

Parser Error: syntax error at or near "\"
 ROLLBACK\
ERROR:  ROLLBACK\

Parser Error: syntax error at or near "\"
 INSERT INTO trans_abc VALUES (20)\
ERROR:  INSERT INTO trans_abc VALUES (20)\

Parser Error: syntax error at or near "\"
 ROLLBACK AND CHAIN
ERROR:  ROLLBACK AND CHAIN

Parser Error: syntax error at or near "AND"
  -- 19 rollback, 20 error
SHOW transaction_isolation
ERROR:   -- 19 rollback, 20 error
SHOW transaction_isolation

Catalog Error: Table with name transaction_isolation does not exist!
Did you mean "trans_abc"?
  -- out of transaction block

RESET default_transaction_isolation
ERROR:   -- out of transaction block

RESET default_transaction_isolation

Catalog Error: unrecognized configuration parameter "default_transaction_isolation"

Did you mean: "default_collation"


SELECT * FROM trans_abc ORDER BY 1
RESULT: 
	[]


DROP TABLE trans_abc


-- TRANSACTION SNAPSHOT
-- Incorrect identifier.
BEGIN TRANSACTION ISOLATION LEVEL REPEATABLE READ
ERROR: 

-- TRANSACTION SNAPSHOT
-- Incorrect identifier.
BEGIN TRANSACTION ISOLATION LEVEL REPEATABLE READ

Parser Error: syntax error at or near "ISOLATION"

SET TRANSACTION SNAPSHOT 'Incorrect Identifier'
ERROR: 
SET TRANSACTION SNAPSHOT 'Incorrect Identifier'

Parser Error: syntax error at or near "SNAPSHOT"

ROLLBACK
ERROR: 
ROLLBACK

TransactionContext Error: cannot rollback - no transaction is active

-- Correct identifier, missing file.
BEGIN TRANSACTION ISOLATION LEVEL REPEATABLE READ
ERROR: 
-- Correct identifier, missing file.
BEGIN TRANSACTION ISOLATION LEVEL REPEATABLE READ

Parser Error: syntax error at or near "ISOLATION"

SET TRANSACTION SNAPSHOT 'FFF-FFF-F'
ERROR: 
SET TRANSACTION SNAPSHOT 'FFF-FFF-F'

Parser Error: syntax error at or near "SNAPSHOT"

ROLLBACK
ERROR: 
ROLLBACK

TransactionContext Error: cannot rollback - no transaction is active


-- Test for successful cleanup of an aborted transaction at session exit.
-- THIS MUST BE THE LAST TEST IN THIS FILE.

begin

select 1/0
RESULT: 
	[(None,)]

rollback to X
ERROR: 
rollback to X

Parser Error: syntax error at or near "to"


-- DO NOT ADD ANYTHING HERE.

