--
-- PUBLICATION
--
CREATE ROLE regress_publication_user LOGIN SUPERUSER
ERROR: --
-- PUBLICATION
--
CREATE ROLE regress_publication_user LOGIN SUPERUSER

Parser Error: syntax error at or near "ROLE"

CREATE ROLE regress_publication_user2
ERROR: 
CREATE ROLE regress_publication_user2

Parser Error: syntax error at or near "ROLE"

CREATE ROLE regress_publication_user_dummy LOGIN NOSUPERUSER
ERROR: 
CREATE ROLE regress_publication_user_dummy LOGIN NOSUPERUSER

Parser Error: syntax error at or near "ROLE"

SET SESSION AUTHORIZATION 'regress_publication_user'
ERROR: 
SET SESSION AUTHORIZATION 'regress_publication_user'

Parser Error: syntax error at or near "AUTHORIZATION"


-- suppress warning that depends on wal_level
SET client_min_messages = 'ERROR'
ERROR: 

-- suppress warning that depends on wal_level
SET client_min_messages = 'ERROR'

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE PUBLICATION testpub_default
ERROR: 
CREATE PUBLICATION testpub_default

Parser Error: syntax error at or near "PUBLICATION"

RESET client_min_messages
ERROR: 
RESET client_min_messages

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"


COMMENT ON PUBLICATION testpub_default IS 'test publication'
ERROR: 

COMMENT ON PUBLICATION testpub_default IS 'test publication'

Parser Error: syntax error at or near "PUBLICATION"

SELECT obj_description(p.oid, 'pg_publication') FROM pg_publication p
ERROR: 
SELECT obj_description(p.oid, 'pg_publication') FROM pg_publication p

Catalog Error: Table with name pg_publication does not exist!
Did you mean "pg_am"?


SET client_min_messages = 'ERROR'
ERROR: 

SET client_min_messages = 'ERROR'

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE PUBLICATION testpib_ins_trunct WITH (publish = insert)
ERROR: 
CREATE PUBLICATION testpib_ins_trunct WITH (publish = insert)

Parser Error: syntax error at or near "PUBLICATION"

RESET client_min_messages
ERROR: 
RESET client_min_messages

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"


ALTER PUBLICATION testpub_default SET (publish = update)
ERROR: 

ALTER PUBLICATION testpub_default SET (publish = update)

Parser Error: syntax error at or near "PUBLICATION"


-- error cases
CREATE PUBLICATION testpub_xxx WITH (foo)
ERROR: 

-- error cases
CREATE PUBLICATION testpub_xxx WITH (foo)

Parser Error: syntax error at or near "PUBLICATION"

CREATE PUBLICATION testpub_xxx WITH (publish = 'cluster, vacuum')
ERROR: 
CREATE PUBLICATION testpub_xxx WITH (publish = 'cluster, vacuum')

Parser Error: syntax error at or near "PUBLICATION"

CREATE PUBLICATION testpub_xxx WITH (publish_via_partition_root = 'true', publish_via_partition_root = '0')
ERROR: 
CREATE PUBLICATION testpub_xxx WITH (publish_via_partition_root = 'true', publish_via_partition_root = '0')

Parser Error: syntax error at or near "PUBLICATION"


-- \dRp

ALTER PUBLICATION testpub_default SET (publish = 'insert, update, delete')
ERROR: 

-- \dRp

ALTER PUBLICATION testpub_default SET (publish = 'insert, update, delete')

Parser Error: syntax error at or near "PUBLICATION"


-- \dRp

--- adding tables
CREATE SCHEMA pub_test

CREATE TABLE testpub_tbl1 (id serial primary key, data text)
ERROR: 
CREATE TABLE testpub_tbl1 (id serial primary key, data text)

Catalog Error: Type with name serial does not exist!
Did you mean "real"?

CREATE TABLE pub_test.testpub_nopk (foo int, bar int)

CREATE VIEW testpub_view AS SELECT 1

CREATE TABLE testpub_parted (a int) PARTITION BY LIST (a)
ERROR: 
CREATE TABLE testpub_parted (a int) PARTITION BY LIST (a)

Parser Error: syntax error at or near "PARTITION"


SET client_min_messages = 'ERROR'
ERROR: 

SET client_min_messages = 'ERROR'

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE PUBLICATION testpub_foralltables FOR ALL TABLES WITH (publish = 'insert')
ERROR: 
CREATE PUBLICATION testpub_foralltables FOR ALL TABLES WITH (publish = 'insert')

Parser Error: syntax error at or near "PUBLICATION"

RESET client_min_messages
ERROR: 
RESET client_min_messages

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

ALTER PUBLICATION testpub_foralltables SET (publish = 'insert, update')
ERROR: 
ALTER PUBLICATION testpub_foralltables SET (publish = 'insert, update')

Parser Error: syntax error at or near "PUBLICATION"


CREATE TABLE testpub_tbl2 (id serial primary key, data text)
ERROR: 

CREATE TABLE testpub_tbl2 (id serial primary key, data text)

Catalog Error: Type with name serial does not exist!
Did you mean "real"?

-- fail - can''t add to for all tables publication
ALTER PUBLICATION testpub_foralltables ADD TABLE testpub_tbl2
ERROR: 
-- fail - can''t add to for all tables publication
ALTER PUBLICATION testpub_foralltables ADD TABLE testpub_tbl2

Parser Error: syntax error at or near "PUBLICATION"

-- fail - can''t drop from all tables publication
ALTER PUBLICATION testpub_foralltables DROP TABLE testpub_tbl2
ERROR: 
-- fail - can''t drop from all tables publication
ALTER PUBLICATION testpub_foralltables DROP TABLE testpub_tbl2

Parser Error: syntax error at or near "PUBLICATION"

-- fail - can''t add to for all tables publication
ALTER PUBLICATION testpub_foralltables SET TABLE pub_test.testpub_nopk
ERROR: 
-- fail - can''t add to for all tables publication
ALTER PUBLICATION testpub_foralltables SET TABLE pub_test.testpub_nopk

Parser Error: syntax error at or near "PUBLICATION"


-- fail - can''t add schema to ''FOR ALL TABLES'' publication
ALTER PUBLICATION testpub_foralltables ADD TABLES IN SCHEMA pub_test
ERROR: 

-- fail - can''t add schema to ''FOR ALL TABLES'' publication
ALTER PUBLICATION testpub_foralltables ADD TABLES IN SCHEMA pub_test

Parser Error: syntax error at or near "PUBLICATION"

-- fail - can''t drop schema from ''FOR ALL TABLES'' publication
ALTER PUBLICATION testpub_foralltables DROP TABLES IN SCHEMA pub_test
ERROR: 
-- fail - can''t drop schema from ''FOR ALL TABLES'' publication
ALTER PUBLICATION testpub_foralltables DROP TABLES IN SCHEMA pub_test

Parser Error: syntax error at or near "PUBLICATION"

-- fail - can''t set schema to ''FOR ALL TABLES'' publication
ALTER PUBLICATION testpub_foralltables SET TABLES IN SCHEMA pub_test
ERROR: 
-- fail - can''t set schema to ''FOR ALL TABLES'' publication
ALTER PUBLICATION testpub_foralltables SET TABLES IN SCHEMA pub_test

Parser Error: syntax error at or near "PUBLICATION"


SET client_min_messages = 'ERROR'
ERROR: 

SET client_min_messages = 'ERROR'

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE PUBLICATION testpub_fortable FOR TABLE testpub_tbl1
ERROR: 
CREATE PUBLICATION testpub_fortable FOR TABLE testpub_tbl1

Parser Error: syntax error at or near "PUBLICATION"

RESET client_min_messages
ERROR: 
RESET client_min_messages

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

-- should be able to add schema to ''FOR TABLE'' publication
ALTER PUBLICATION testpub_fortable ADD TABLES IN SCHEMA pub_test
ERROR: 
-- should be able to add schema to ''FOR TABLE'' publication
ALTER PUBLICATION testpub_fortable ADD TABLES IN SCHEMA pub_test

Parser Error: syntax error at or near "PUBLICATION"

-- \dRp+ testpub_fortable
-- should be able to drop schema from ''FOR TABLE'' publication
ALTER PUBLICATION testpub_fortable DROP TABLES IN SCHEMA pub_test
ERROR: 
-- \dRp+ testpub_fortable
-- should be able to drop schema from ''FOR TABLE'' publication
ALTER PUBLICATION testpub_fortable DROP TABLES IN SCHEMA pub_test

Parser Error: syntax error at or near "PUBLICATION"

-- \dRp+ testpub_fortable
-- should be able to set schema to ''FOR TABLE'' publication
ALTER PUBLICATION testpub_fortable SET TABLES IN SCHEMA pub_test
ERROR: 
-- \dRp+ testpub_fortable
-- should be able to set schema to ''FOR TABLE'' publication
ALTER PUBLICATION testpub_fortable SET TABLES IN SCHEMA pub_test

Parser Error: syntax error at or near "PUBLICATION"

-- \dRp+ testpub_fortable

SET client_min_messages = 'ERROR'
ERROR: 
-- \dRp+ testpub_fortable

SET client_min_messages = 'ERROR'

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE PUBLICATION testpub_forschema FOR TABLES IN SCHEMA pub_test
ERROR: 
CREATE PUBLICATION testpub_forschema FOR TABLES IN SCHEMA pub_test

Parser Error: syntax error at or near "PUBLICATION"

-- should be able to create publication with schema and table of the same
-- schema
CREATE PUBLICATION testpub_for_tbl_schema FOR TABLES IN SCHEMA pub_test, TABLE pub_test.testpub_nopk
ERROR: 
-- should be able to create publication with schema and table of the same
-- schema
CREATE PUBLICATION testpub_for_tbl_schema FOR TABLES IN SCHEMA pub_test, TABLE pub_test.testpub_nopk

Parser Error: syntax error at or near "PUBLICATION"

RESET client_min_messages
ERROR: 
RESET client_min_messages

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

-- \dRp+ testpub_for_tbl_schema

-- weird parser corner case
CREATE PUBLICATION testpub_parsertst FOR TABLE pub_test.testpub_nopk, CURRENT_SCHEMA
ERROR: 
-- \dRp+ testpub_for_tbl_schema

-- weird parser corner case
CREATE PUBLICATION testpub_parsertst FOR TABLE pub_test.testpub_nopk, CURRENT_SCHEMA

Parser Error: syntax error at or near "PUBLICATION"

CREATE PUBLICATION testpub_parsertst FOR TABLES IN SCHEMA foo, test.foo
ERROR: 
CREATE PUBLICATION testpub_parsertst FOR TABLES IN SCHEMA foo, test.foo

Parser Error: syntax error at or near "PUBLICATION"


-- should be able to add a table of the same schema to the schema publication
ALTER PUBLICATION testpub_forschema ADD TABLE pub_test.testpub_nopk
ERROR: 

-- should be able to add a table of the same schema to the schema publication
ALTER PUBLICATION testpub_forschema ADD TABLE pub_test.testpub_nopk

Parser Error: syntax error at or near "PUBLICATION"

-- \dRp+ testpub_forschema

-- should be able to drop the table
ALTER PUBLICATION testpub_forschema DROP TABLE pub_test.testpub_nopk
ERROR: 
-- \dRp+ testpub_forschema

-- should be able to drop the table
ALTER PUBLICATION testpub_forschema DROP TABLE pub_test.testpub_nopk

Parser Error: syntax error at or near "PUBLICATION"

-- \dRp+ testpub_forschema

-- fail - can''t drop a table from the schema publication which isn''t in the
-- publication
ALTER PUBLICATION testpub_forschema DROP TABLE pub_test.testpub_nopk
ERROR: 
-- \dRp+ testpub_forschema

-- fail - can''t drop a table from the schema publication which isn''t in the
-- publication
ALTER PUBLICATION testpub_forschema DROP TABLE pub_test.testpub_nopk

Parser Error: syntax error at or near "PUBLICATION"

-- should be able to set table to schema publication
ALTER PUBLICATION testpub_forschema SET TABLE pub_test.testpub_nopk
ERROR: 
-- should be able to set table to schema publication
ALTER PUBLICATION testpub_forschema SET TABLE pub_test.testpub_nopk

Parser Error: syntax error at or near "PUBLICATION"

-- \dRp+ testpub_forschema

SELECT pubname, puballtables FROM pg_publication WHERE pubname = 'testpub_foralltables'
ERROR: 
-- \dRp+ testpub_forschema

SELECT pubname, puballtables FROM pg_publication WHERE pubname = 'testpub_foralltables'

Catalog Error: Table with name pg_publication does not exist!
Did you mean "pg_am"?

-- \d+ testpub_tbl2
-- \dRp+ testpub_foralltables

DROP TABLE testpub_tbl2
ERROR: 
-- \d+ testpub_tbl2
-- \dRp+ testpub_foralltables

DROP TABLE testpub_tbl2

Catalog Error: Table with name testpub_tbl2 does not exist!
Did you mean "TEXT_TBL"?

DROP PUBLICATION testpub_foralltables, testpub_fortable, testpub_forschema, testpub_for_tbl_schema
ERROR: 
DROP PUBLICATION testpub_foralltables, testpub_fortable, testpub_forschema, testpub_for_tbl_schema

Not implemented Error: Can only drop one object at a time


CREATE TABLE testpub_tbl3 (a int)

CREATE TABLE testpub_tbl3a (b text) INHERITS (testpub_tbl3)
ERROR: 
CREATE TABLE testpub_tbl3a (b text) INHERITS (testpub_tbl3)

Parser Error: syntax error at or near "INHERITS"

SET client_min_messages = 'ERROR'
ERROR: 
SET client_min_messages = 'ERROR'

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE PUBLICATION testpub3 FOR TABLE testpub_tbl3
ERROR: 
CREATE PUBLICATION testpub3 FOR TABLE testpub_tbl3

Parser Error: syntax error at or near "PUBLICATION"

CREATE PUBLICATION testpub4 FOR TABLE ONLY testpub_tbl3
ERROR: 
CREATE PUBLICATION testpub4 FOR TABLE ONLY testpub_tbl3

Parser Error: syntax error at or near "PUBLICATION"

RESET client_min_messages
ERROR: 
RESET client_min_messages

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

-- \dRp+ testpub3
-- \dRp+ testpub4

DROP TABLE testpub_tbl3, testpub_tbl3a
ERROR: 
-- \dRp+ testpub3
-- \dRp+ testpub4

DROP TABLE testpub_tbl3, testpub_tbl3a

Not implemented Error: Can only drop one object at a time

DROP PUBLICATION testpub3, testpub4
ERROR: 
DROP PUBLICATION testpub3, testpub4

Not implemented Error: Can only drop one object at a time


-- Tests for partitioned tables
SET client_min_messages = 'ERROR'
ERROR: 

-- Tests for partitioned tables
SET client_min_messages = 'ERROR'

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE PUBLICATION testpub_forparted
ERROR: 
CREATE PUBLICATION testpub_forparted

Parser Error: syntax error at or near "PUBLICATION"

CREATE PUBLICATION testpub_forparted1
ERROR: 
CREATE PUBLICATION testpub_forparted1

Parser Error: syntax error at or near "PUBLICATION"

RESET client_min_messages
ERROR: 
RESET client_min_messages

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE TABLE testpub_parted1 (LIKE testpub_parted)
ERROR: 
CREATE TABLE testpub_parted1 (LIKE testpub_parted)

Not implemented Error: ColumnDef type not handled yet

CREATE TABLE testpub_parted2 (LIKE testpub_parted)
ERROR: 
CREATE TABLE testpub_parted2 (LIKE testpub_parted)

Not implemented Error: ColumnDef type not handled yet

ALTER PUBLICATION testpub_forparted1 SET (publish='insert')
ERROR: 
ALTER PUBLICATION testpub_forparted1 SET (publish='insert')

Parser Error: syntax error at or near "PUBLICATION"

ALTER TABLE testpub_parted ATTACH PARTITION testpub_parted1 FOR VALUES IN (1)
ERROR: 
ALTER TABLE testpub_parted ATTACH PARTITION testpub_parted1 FOR VALUES IN (1)

Parser Error: syntax error at or near "ATTACH"

ALTER TABLE testpub_parted ATTACH PARTITION testpub_parted2 FOR VALUES IN (2)
ERROR: 
ALTER TABLE testpub_parted ATTACH PARTITION testpub_parted2 FOR VALUES IN (2)

Parser Error: syntax error at or near "ATTACH"

-- works despite missing REPLICA IDENTITY, because updates are not replicated
UPDATE testpub_parted1 SET a = 1
ERROR: 
-- works despite missing REPLICA IDENTITY, because updates are not replicated
UPDATE testpub_parted1 SET a = 1

Catalog Error: Table with name testpub_parted1 does not exist!
Did you mean "testpub_tbl3"?
LINE 3: UPDATE testpub_parted1 SET a = 1
               ^

-- only parent is listed as being in publication, not the partition
ALTER PUBLICATION testpub_forparted ADD TABLE testpub_parted
ERROR: 
-- only parent is listed as being in publication, not the partition
ALTER PUBLICATION testpub_forparted ADD TABLE testpub_parted

Parser Error: syntax error at or near "PUBLICATION"

-- \dRp+ testpub_forparted
-- works despite missing REPLICA IDENTITY, because no actual update happened
UPDATE testpub_parted SET a = 1 WHERE false
ERROR: 
-- \dRp+ testpub_forparted
-- works despite missing REPLICA IDENTITY, because no actual update happened
UPDATE testpub_parted SET a = 1 WHERE false

Catalog Error: Table with name testpub_parted does not exist!
Did you mean "testpub_tbl3"?
LINE 4: UPDATE testpub_parted SET a = 1 WHERE false
               ^

-- should now fail, because parent''s publication replicates updates
UPDATE testpub_parted1 SET a = 1
ERROR: 
-- should now fail, because parent''s publication replicates updates
UPDATE testpub_parted1 SET a = 1

Catalog Error: Table with name testpub_parted1 does not exist!
Did you mean "testpub_tbl3"?
LINE 3: UPDATE testpub_parted1 SET a = 1
               ^

ALTER TABLE testpub_parted DETACH PARTITION testpub_parted1
ERROR: 
ALTER TABLE testpub_parted DETACH PARTITION testpub_parted1

Parser Error: syntax error at or near "DETACH"

-- works again, because parent''s publication is no longer considered
UPDATE testpub_parted1 SET a = 1
ERROR: 
-- works again, because parent''s publication is no longer considered
UPDATE testpub_parted1 SET a = 1

Catalog Error: Table with name testpub_parted1 does not exist!
Did you mean "testpub_tbl3"?
LINE 3: UPDATE testpub_parted1 SET a = 1
               ^

ALTER PUBLICATION testpub_forparted SET (publish_via_partition_root = true)
ERROR: 
ALTER PUBLICATION testpub_forparted SET (publish_via_partition_root = true)

Parser Error: syntax error at or near "PUBLICATION"

-- \dRp+ testpub_forparted
-- still fail, because parent''s publication replicates updates
UPDATE testpub_parted2 SET a = 2
ERROR: 
-- \dRp+ testpub_forparted
-- still fail, because parent''s publication replicates updates
UPDATE testpub_parted2 SET a = 2

Catalog Error: Table with name testpub_parted2 does not exist!
Did you mean "testpub_tbl3"?
LINE 4: UPDATE testpub_parted2 SET a = 2
               ^

ALTER PUBLICATION testpub_forparted DROP TABLE testpub_parted
ERROR: 
ALTER PUBLICATION testpub_forparted DROP TABLE testpub_parted

Parser Error: syntax error at or near "PUBLICATION"

-- works again, because update is no longer replicated
UPDATE testpub_parted2 SET a = 2
ERROR: 
-- works again, because update is no longer replicated
UPDATE testpub_parted2 SET a = 2

Catalog Error: Table with name testpub_parted2 does not exist!
Did you mean "testpub_tbl3"?
LINE 3: UPDATE testpub_parted2 SET a = 2
               ^

DROP TABLE testpub_parted1, testpub_parted2
ERROR: 
DROP TABLE testpub_parted1, testpub_parted2

Not implemented Error: Can only drop one object at a time

DROP PUBLICATION testpub_forparted, testpub_forparted1
ERROR: 
DROP PUBLICATION testpub_forparted, testpub_forparted1

Not implemented Error: Can only drop one object at a time


-- Tests for row filters
CREATE TABLE testpub_rf_tbl1 (a integer, b text)

CREATE TABLE testpub_rf_tbl2 (c text, d integer)

CREATE TABLE testpub_rf_tbl3 (e integer)

CREATE TABLE testpub_rf_tbl4 (g text)

CREATE TABLE testpub_rf_tbl5 (a xml)
ERROR: 
CREATE TABLE testpub_rf_tbl5 (a xml)

Catalog Error: Type with name xml does not exist!
Did you mean "map"?

CREATE SCHEMA testpub_rf_schema1

CREATE TABLE testpub_rf_schema1.testpub_rf_tbl5 (h integer)

CREATE SCHEMA testpub_rf_schema2

CREATE TABLE testpub_rf_schema2.testpub_rf_tbl6 (i integer)

SET client_min_messages = 'ERROR'
ERROR: 
SET client_min_messages = 'ERROR'

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

-- Firstly, test using the option publish=''insert'' because the row filter
-- validation of referenced columns is less strict than for delete/update.
CREATE PUBLICATION testpub5 FOR TABLE testpub_rf_tbl1, testpub_rf_tbl2 WHERE (c <> 'test' AND d < 5) WITH (publish = 'insert')
ERROR: 
-- Firstly, test using the option publish=''insert'' because the row filter
-- validation of referenced columns is less strict than for delete/update.
CREATE PUBLICATION testpub5 FOR TABLE testpub_rf_tbl1, testpub_rf_tbl2 WHERE (c <> 'test' AND d < 5) WITH (publish = 'insert')

Parser Error: syntax error at or near "PUBLICATION"

RESET client_min_messages
ERROR: 
RESET client_min_messages

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

-- \dRp+ testpub5
-- \d testpub_rf_tbl3
ALTER PUBLICATION testpub5 ADD TABLE testpub_rf_tbl3 WHERE (e > 1000 AND e < 2000)
ERROR: 
-- \dRp+ testpub5
-- \d testpub_rf_tbl3
ALTER PUBLICATION testpub5 ADD TABLE testpub_rf_tbl3 WHERE (e > 1000 AND e < 2000)

Parser Error: syntax error at or near "PUBLICATION"

-- \dRp+ testpub5
-- \d testpub_rf_tbl3
ALTER PUBLICATION testpub5 DROP TABLE testpub_rf_tbl2
ERROR: 
-- \dRp+ testpub5
-- \d testpub_rf_tbl3
ALTER PUBLICATION testpub5 DROP TABLE testpub_rf_tbl2

Parser Error: syntax error at or near "PUBLICATION"

-- \dRp+ testpub5
-- remove testpub_rf_tbl1 and add testpub_rf_tbl3 again (another WHERE expression)
ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl3 WHERE (e > 300 AND e < 500)
ERROR: 
-- \dRp+ testpub5
-- remove testpub_rf_tbl1 and add testpub_rf_tbl3 again (another WHERE expression)
ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl3 WHERE (e > 300 AND e < 500)

Parser Error: syntax error at or near "PUBLICATION"

-- \dRp+ testpub5
-- \d testpub_rf_tbl3
-- test \d <tablename> (now it displays filter information)
SET client_min_messages = 'ERROR'
ERROR: 
-- \dRp+ testpub5
-- \d testpub_rf_tbl3
-- test \d <tablename> (now it displays filter information)
SET client_min_messages = 'ERROR'

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE PUBLICATION testpub_rf_yes FOR TABLE testpub_rf_tbl1 WHERE (a > 1) WITH (publish = 'insert')
ERROR: 
CREATE PUBLICATION testpub_rf_yes FOR TABLE testpub_rf_tbl1 WHERE (a > 1) WITH (publish = 'insert')

Parser Error: syntax error at or near "PUBLICATION"

CREATE PUBLICATION testpub_rf_no FOR TABLE testpub_rf_tbl1
ERROR: 
CREATE PUBLICATION testpub_rf_no FOR TABLE testpub_rf_tbl1

Parser Error: syntax error at or near "PUBLICATION"

RESET client_min_messages
ERROR: 
RESET client_min_messages

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

-- \d testpub_rf_tbl1
DROP PUBLICATION testpub_rf_yes, testpub_rf_no
ERROR: 
-- \d testpub_rf_tbl1
DROP PUBLICATION testpub_rf_yes, testpub_rf_no

Not implemented Error: Can only drop one object at a time

-- some more syntax tests to exercise other parser pathways
SET client_min_messages = 'ERROR'
ERROR: 
-- some more syntax tests to exercise other parser pathways
SET client_min_messages = 'ERROR'

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE PUBLICATION testpub_syntax1 FOR TABLE testpub_rf_tbl1, ONLY testpub_rf_tbl3 WHERE (e < 999) WITH (publish = 'insert')
ERROR: 
CREATE PUBLICATION testpub_syntax1 FOR TABLE testpub_rf_tbl1, ONLY testpub_rf_tbl3 WHERE (e < 999) WITH (publish = 'insert')

Parser Error: syntax error at or near "PUBLICATION"

RESET client_min_messages
ERROR: 
RESET client_min_messages

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

-- \dRp+ testpub_syntax1
DROP PUBLICATION testpub_syntax1
ERROR: 
-- \dRp+ testpub_syntax1
DROP PUBLICATION testpub_syntax1

Not implemented Error: Cannot drop this type yet

SET client_min_messages = 'ERROR'
ERROR: 
SET client_min_messages = 'ERROR'

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE PUBLICATION testpub_syntax2 FOR TABLE testpub_rf_tbl1, testpub_rf_schema1.testpub_rf_tbl5 WHERE (h < 999) WITH (publish = 'insert')
ERROR: 
CREATE PUBLICATION testpub_syntax2 FOR TABLE testpub_rf_tbl1, testpub_rf_schema1.testpub_rf_tbl5 WHERE (h < 999) WITH (publish = 'insert')

Parser Error: syntax error at or near "PUBLICATION"

RESET client_min_messages
ERROR: 
RESET client_min_messages

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

-- \dRp+ testpub_syntax2
DROP PUBLICATION testpub_syntax2
ERROR: 
-- \dRp+ testpub_syntax2
DROP PUBLICATION testpub_syntax2

Not implemented Error: Cannot drop this type yet

-- fail - schemas don''t allow WHERE clause
SET client_min_messages = 'ERROR'
ERROR: 
-- fail - schemas don''t allow WHERE clause
SET client_min_messages = 'ERROR'

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE PUBLICATION testpub_syntax3 FOR TABLES IN SCHEMA testpub_rf_schema1 WHERE (a = 123)
ERROR: 
CREATE PUBLICATION testpub_syntax3 FOR TABLES IN SCHEMA testpub_rf_schema1 WHERE (a = 123)

Parser Error: syntax error at or near "PUBLICATION"

CREATE PUBLICATION testpub_syntax3 FOR TABLES IN SCHEMA testpub_rf_schema1, testpub_rf_schema1 WHERE (a = 123)
ERROR: 
CREATE PUBLICATION testpub_syntax3 FOR TABLES IN SCHEMA testpub_rf_schema1, testpub_rf_schema1 WHERE (a = 123)

Parser Error: syntax error at or near "PUBLICATION"

RESET client_min_messages
ERROR: 
RESET client_min_messages

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

-- fail - duplicate tables are not allowed if that table has any WHERE clause
SET client_min_messages = 'ERROR'
ERROR: 
-- fail - duplicate tables are not allowed if that table has any WHERE clause
SET client_min_messages = 'ERROR'

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE PUBLICATION testpub_dups FOR TABLE testpub_rf_tbl1 WHERE (a = 1), testpub_rf_tbl1 WITH (publish = 'insert')
ERROR: 
CREATE PUBLICATION testpub_dups FOR TABLE testpub_rf_tbl1 WHERE (a = 1), testpub_rf_tbl1 WITH (publish = 'insert')

Parser Error: syntax error at or near "PUBLICATION"

CREATE PUBLICATION testpub_dups FOR TABLE testpub_rf_tbl1, testpub_rf_tbl1 WHERE (a = 2) WITH (publish = 'insert')
ERROR: 
CREATE PUBLICATION testpub_dups FOR TABLE testpub_rf_tbl1, testpub_rf_tbl1 WHERE (a = 2) WITH (publish = 'insert')

Parser Error: syntax error at or near "PUBLICATION"

RESET client_min_messages
ERROR: 
RESET client_min_messages

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

-- fail - publication WHERE clause must be boolean
ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl3 WHERE (1234)
ERROR: 
-- fail - publication WHERE clause must be boolean
ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl3 WHERE (1234)

Parser Error: syntax error at or near "PUBLICATION"

-- fail - aggregate functions not allowed in WHERE clause
ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl3 WHERE (e < AVG(e))
ERROR: 
-- fail - aggregate functions not allowed in WHERE clause
ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl3 WHERE (e < AVG(e))

Parser Error: syntax error at or near "PUBLICATION"

-- fail - user-defined operators are not allowed
CREATE FUNCTION testpub_rf_func1(integer, integer) RETURNS boolean AS $$ SELECT hashint4($1) > $2 $$ LANGUAGE SQL
ERROR: 
-- fail - user-defined operators are not allowed
CREATE FUNCTION testpub_rf_func1(integer, integer) RETURNS boolean AS $$ SELECT hashint4($1) > $2 $$ LANGUAGE SQL

Parser Error: syntax error at or near "RETURNS"

CREATE OPERATOR =#> (PROCEDURE = testpub_rf_func1, LEFTARG = integer, RIGHTARG = integer)
ERROR: 
CREATE OPERATOR =#> (PROCEDURE = testpub_rf_func1, LEFTARG = integer, RIGHTARG = integer)

Parser Error: syntax error at or near "OPERATOR"

CREATE PUBLICATION testpub6 FOR TABLE testpub_rf_tbl3 WHERE (e =#> 27)
ERROR: 
CREATE PUBLICATION testpub6 FOR TABLE testpub_rf_tbl3 WHERE (e =#> 27)

Parser Error: syntax error at or near "PUBLICATION"

-- fail - user-defined functions are not allowed
CREATE FUNCTION testpub_rf_func2() RETURNS integer AS $$ BEGIN RETURN 123; END; $$ LANGUAGE plpgsql
ERROR: 
-- fail - user-defined functions are not allowed
CREATE FUNCTION testpub_rf_func2() RETURNS integer AS $$ BEGIN RETURN 123; END; $$ LANGUAGE plpgsql

Parser Error: syntax error at or near "RETURNS"

ALTER PUBLICATION testpub5 ADD TABLE testpub_rf_tbl1 WHERE (a >= testpub_rf_func2())
ERROR: 
ALTER PUBLICATION testpub5 ADD TABLE testpub_rf_tbl1 WHERE (a >= testpub_rf_func2())

Parser Error: syntax error at or near "PUBLICATION"

-- fail - non-immutable functions are not allowed. random() is volatile.
ALTER PUBLICATION testpub5 ADD TABLE testpub_rf_tbl1 WHERE (a < random())
ERROR: 
-- fail - non-immutable functions are not allowed. random() is volatile.
ALTER PUBLICATION testpub5 ADD TABLE testpub_rf_tbl1 WHERE (a < random())

Parser Error: syntax error at or near "PUBLICATION"

-- fail - user-defined collations are not allowed
CREATE COLLATION user_collation FROM "C"
ERROR: 
-- fail - user-defined collations are not allowed
CREATE COLLATION user_collation FROM "C"

Parser Error: syntax error at or near "COLLATION"

ALTER PUBLICATION testpub5 ADD TABLE testpub_rf_tbl1 WHERE (b < '2' COLLATE user_collation)
ERROR: 
ALTER PUBLICATION testpub5 ADD TABLE testpub_rf_tbl1 WHERE (b < '2' COLLATE user_collation)

Parser Error: syntax error at or near "PUBLICATION"

-- ok - NULLIF is allowed
ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl1 WHERE (NULLIF(1,2) = a)
ERROR: 
-- ok - NULLIF is allowed
ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl1 WHERE (NULLIF(1,2) = a)

Parser Error: syntax error at or near "PUBLICATION"

-- ok - built-in operators are allowed
ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl1 WHERE (a IS NULL)
ERROR: 
-- ok - built-in operators are allowed
ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl1 WHERE (a IS NULL)

Parser Error: syntax error at or near "PUBLICATION"

ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl1 WHERE ((a > 5) IS FALSE)
ERROR: 
ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl1 WHERE ((a > 5) IS FALSE)

Parser Error: syntax error at or near "PUBLICATION"

ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl1 WHERE (a IS DISTINCT FROM 5)
ERROR: 
ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl1 WHERE (a IS DISTINCT FROM 5)

Parser Error: syntax error at or near "PUBLICATION"

ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl1 WHERE ((a, a + 1) < (2, 3))
ERROR: 
ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl1 WHERE ((a, a + 1) < (2, 3))

Parser Error: syntax error at or near "PUBLICATION"

-- ok - built-in type coercions between two binary compatible datatypes are allowed
ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl1 WHERE (b::varchar < '2')
ERROR: 
-- ok - built-in type coercions between two binary compatible datatypes are allowed
ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl1 WHERE (b::varchar < '2')

Parser Error: syntax error at or near "PUBLICATION"

-- ok - immutable built-in functions are allowed
ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl4 WHERE (length(g) < 6)
ERROR: 
-- ok - immutable built-in functions are allowed
ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl4 WHERE (length(g) < 6)

Parser Error: syntax error at or near "PUBLICATION"

-- fail - user-defined types are not allowed
CREATE TYPE rf_bug_status AS ENUM ('new', 'open', 'closed')

CREATE TABLE rf_bug (id serial, description text, status rf_bug_status)
ERROR: 
CREATE TABLE rf_bug (id serial, description text, status rf_bug_status)

Catalog Error: Type with name serial does not exist!
Did you mean "real"?

CREATE PUBLICATION testpub6 FOR TABLE rf_bug WHERE (status = 'open') WITH (publish = 'insert')
ERROR: 
CREATE PUBLICATION testpub6 FOR TABLE rf_bug WHERE (status = 'open') WITH (publish = 'insert')

Parser Error: syntax error at or near "PUBLICATION"

DROP TABLE rf_bug
ERROR: 
DROP TABLE rf_bug

Catalog Error: Table with name rf_bug does not exist!
Did you mean "CHAR_TBL"?

DROP TYPE rf_bug_status

-- fail - row filter expression is not simple
CREATE PUBLICATION testpub6 FOR TABLE testpub_rf_tbl1 WHERE (a IN (SELECT generate_series(1,5)))
ERROR: 
-- fail - row filter expression is not simple
CREATE PUBLICATION testpub6 FOR TABLE testpub_rf_tbl1 WHERE (a IN (SELECT generate_series(1,5)))

Parser Error: syntax error at or near "PUBLICATION"

-- fail - system columns are not allowed
CREATE PUBLICATION testpub6 FOR TABLE testpub_rf_tbl1 WHERE ('(0,1)'::tid = ctid)
ERROR: 
-- fail - system columns are not allowed
CREATE PUBLICATION testpub6 FOR TABLE testpub_rf_tbl1 WHERE ('(0,1)'::tid = ctid)

Parser Error: syntax error at or near "PUBLICATION"

-- ok - conditional expressions are allowed
ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl5 WHERE (a IS DOCUMENT)
ERROR: 
-- ok - conditional expressions are allowed
ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl5 WHERE (a IS DOCUMENT)

Parser Error: syntax error at or near "PUBLICATION"

ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl5 WHERE (xmlexists('//foo[text() = ''bar'']' PASSING BY VALUE a))
ERROR: 
ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl5 WHERE (xmlexists('//foo[text() = ''bar'']' PASSING BY VALUE a))

Parser Error: syntax error at or near "PUBLICATION"

ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl1 WHERE (NULLIF(1, 2) = a)
ERROR: 
ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl1 WHERE (NULLIF(1, 2) = a)

Parser Error: syntax error at or near "PUBLICATION"

ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl1 WHERE (CASE a WHEN 5 THEN true ELSE false END)
ERROR: 
ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl1 WHERE (CASE a WHEN 5 THEN true ELSE false END)

Parser Error: syntax error at or near "PUBLICATION"

ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl1 WHERE (COALESCE(b, 'foo') = 'foo')
ERROR: 
ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl1 WHERE (COALESCE(b, 'foo') = 'foo')

Parser Error: syntax error at or near "PUBLICATION"

ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl1 WHERE (GREATEST(a, 10) > 10)
ERROR: 
ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl1 WHERE (GREATEST(a, 10) > 10)

Parser Error: syntax error at or near "PUBLICATION"

ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl1 WHERE (a IN (2, 4, 6))
ERROR: 
ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl1 WHERE (a IN (2, 4, 6))

Parser Error: syntax error at or near "PUBLICATION"

ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl1 WHERE (ARRAY[a] <@ ARRAY[2, 4, 6])
ERROR: 
ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl1 WHERE (ARRAY[a] <@ ARRAY[2, 4, 6])

Parser Error: syntax error at or near "PUBLICATION"

ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl1 WHERE (ROW(a, 2) IS NULL)
ERROR: 
ALTER PUBLICATION testpub5 SET TABLE testpub_rf_tbl1 WHERE (ROW(a, 2) IS NULL)

Parser Error: syntax error at or near "PUBLICATION"

-- fail - WHERE not allowed in DROP
ALTER PUBLICATION testpub5 DROP TABLE testpub_rf_tbl1 WHERE (e < 27)
ERROR: 
-- fail - WHERE not allowed in DROP
ALTER PUBLICATION testpub5 DROP TABLE testpub_rf_tbl1 WHERE (e < 27)

Parser Error: syntax error at or near "PUBLICATION"

-- fail - cannot ALTER SET table which is a member of a pre-existing schema
SET client_min_messages = 'ERROR'
ERROR: 
-- fail - cannot ALTER SET table which is a member of a pre-existing schema
SET client_min_messages = 'ERROR'

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE PUBLICATION testpub6 FOR TABLES IN SCHEMA testpub_rf_schema2
ERROR: 
CREATE PUBLICATION testpub6 FOR TABLES IN SCHEMA testpub_rf_schema2

Parser Error: syntax error at or near "PUBLICATION"

-- should be able to set publication with schema and table of the same schema
ALTER PUBLICATION testpub6 SET TABLES IN SCHEMA testpub_rf_schema2, TABLE testpub_rf_schema2.testpub_rf_tbl6 WHERE (i < 99)
ERROR: 
-- should be able to set publication with schema and table of the same schema
ALTER PUBLICATION testpub6 SET TABLES IN SCHEMA testpub_rf_schema2, TABLE testpub_rf_schema2.testpub_rf_tbl6 WHERE (i < 99)

Parser Error: syntax error at or near "PUBLICATION"

RESET client_min_messages
ERROR: 
RESET client_min_messages

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

-- \dRp+ testpub6

DROP TABLE testpub_rf_tbl1

DROP TABLE testpub_rf_tbl2

DROP TABLE testpub_rf_tbl3

DROP TABLE testpub_rf_tbl4

DROP TABLE testpub_rf_tbl5
ERROR: 
DROP TABLE testpub_rf_tbl5

Catalog Error: Table with name testpub_rf_tbl5 does not exist!
Did you mean "testpub_rf_schema1.testpub_rf_tbl5"?

DROP TABLE testpub_rf_schema1.testpub_rf_tbl5

DROP TABLE testpub_rf_schema2.testpub_rf_tbl6

DROP SCHEMA testpub_rf_schema1

DROP SCHEMA testpub_rf_schema2

DROP PUBLICATION testpub5
ERROR: 
DROP PUBLICATION testpub5

Not implemented Error: Cannot drop this type yet

DROP PUBLICATION testpub6
ERROR: 
DROP PUBLICATION testpub6

Not implemented Error: Cannot drop this type yet

DROP OPERATOR =#>(integer, integer)
ERROR: 
DROP OPERATOR =#>(integer, integer)

Parser Error: syntax error at or near "OPERATOR"

DROP FUNCTION testpub_rf_func1(integer, integer)
ERROR: 
DROP FUNCTION testpub_rf_func1(integer, integer)

Parser Error: syntax error at or near "("

DROP FUNCTION testpub_rf_func2()
ERROR: 
DROP FUNCTION testpub_rf_func2()

Parser Error: syntax error at or near "("

DROP COLLATION user_collation
ERROR: 
DROP COLLATION user_collation

Not implemented Error: Cannot drop this type yet


-- ======================================================
-- More row filter tests for validating column references
CREATE TABLE rf_tbl_abcd_nopk(a int, b int, c int, d int)

CREATE TABLE rf_tbl_abcd_pk(a int, b int, c int, d int, PRIMARY KEY(a,b))

CREATE TABLE rf_tbl_abcd_part_pk (a int PRIMARY KEY, b int) PARTITION by RANGE (a)
ERROR: 
CREATE TABLE rf_tbl_abcd_part_pk (a int PRIMARY KEY, b int) PARTITION by RANGE (a)

Parser Error: syntax error at or near "PARTITION"

CREATE TABLE rf_tbl_abcd_part_pk_1 (b int, a int PRIMARY KEY)

ALTER TABLE rf_tbl_abcd_part_pk ATTACH PARTITION rf_tbl_abcd_part_pk_1 FOR VALUES FROM (1) TO (10)
ERROR: 
ALTER TABLE rf_tbl_abcd_part_pk ATTACH PARTITION rf_tbl_abcd_part_pk_1 FOR VALUES FROM (1) TO (10)

Parser Error: syntax error at or near "ATTACH"


-- Case 1. REPLICA IDENTITY DEFAULT (means use primary key or nothing)
-- 1a. REPLICA IDENTITY is DEFAULT and table has a PK.
SET client_min_messages = 'ERROR'
ERROR: 

-- Case 1. REPLICA IDENTITY DEFAULT (means use primary key or nothing)
-- 1a. REPLICA IDENTITY is DEFAULT and table has a PK.
SET client_min_messages = 'ERROR'

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE PUBLICATION testpub6 FOR TABLE rf_tbl_abcd_pk WHERE (a > 99)
ERROR: 
CREATE PUBLICATION testpub6 FOR TABLE rf_tbl_abcd_pk WHERE (a > 99)

Parser Error: syntax error at or near "PUBLICATION"

RESET client_min_messages
ERROR: 
RESET client_min_messages

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

-- ok - ''a'' is a PK col
UPDATE rf_tbl_abcd_pk SET a = 1

ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_pk WHERE (b > 99)
ERROR: 
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_pk WHERE (b > 99)

Parser Error: syntax error at or near "PUBLICATION"

-- ok - ''b'' is a PK col
UPDATE rf_tbl_abcd_pk SET a = 1

ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_pk WHERE (c > 99)
ERROR: 
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_pk WHERE (c > 99)

Parser Error: syntax error at or near "PUBLICATION"

-- fail - ''c'' is not part of the PK
UPDATE rf_tbl_abcd_pk SET a = 1

ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_pk WHERE (d > 99)
ERROR: 
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_pk WHERE (d > 99)

Parser Error: syntax error at or near "PUBLICATION"

-- fail - ''d'' is not part of the PK
UPDATE rf_tbl_abcd_pk SET a = 1

-- 1b. REPLICA IDENTITY is DEFAULT and table has no PK
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_nopk WHERE (a > 99)
ERROR: 
-- 1b. REPLICA IDENTITY is DEFAULT and table has no PK
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_nopk WHERE (a > 99)

Parser Error: syntax error at or near "PUBLICATION"

-- fail - ''a'' is not part of REPLICA IDENTITY
UPDATE rf_tbl_abcd_nopk SET a = 1


-- Case 2. REPLICA IDENTITY FULL
ALTER TABLE rf_tbl_abcd_pk REPLICA IDENTITY FULL
ERROR: 

-- Case 2. REPLICA IDENTITY FULL
ALTER TABLE rf_tbl_abcd_pk REPLICA IDENTITY FULL

Parser Error: syntax error at or near "REPLICA"

ALTER TABLE rf_tbl_abcd_nopk REPLICA IDENTITY FULL
ERROR: 
ALTER TABLE rf_tbl_abcd_nopk REPLICA IDENTITY FULL

Parser Error: syntax error at or near "REPLICA"

ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_pk WHERE (c > 99)
ERROR: 
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_pk WHERE (c > 99)

Parser Error: syntax error at or near "PUBLICATION"

-- ok - ''c'' is in REPLICA IDENTITY now even though not in PK
UPDATE rf_tbl_abcd_pk SET a = 1

ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_nopk WHERE (a > 99)
ERROR: 
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_nopk WHERE (a > 99)

Parser Error: syntax error at or near "PUBLICATION"

-- ok - ''a'' is in REPLICA IDENTITY now
UPDATE rf_tbl_abcd_nopk SET a = 1


-- Case 3. REPLICA IDENTITY NOTHING
ALTER TABLE rf_tbl_abcd_pk REPLICA IDENTITY NOTHING
ERROR: 

-- Case 3. REPLICA IDENTITY NOTHING
ALTER TABLE rf_tbl_abcd_pk REPLICA IDENTITY NOTHING

Parser Error: syntax error at or near "REPLICA"

ALTER TABLE rf_tbl_abcd_nopk REPLICA IDENTITY NOTHING
ERROR: 
ALTER TABLE rf_tbl_abcd_nopk REPLICA IDENTITY NOTHING

Parser Error: syntax error at or near "REPLICA"

ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_pk WHERE (a > 99)
ERROR: 
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_pk WHERE (a > 99)

Parser Error: syntax error at or near "PUBLICATION"

-- fail - ''a'' is in PK but it is not part of REPLICA IDENTITY NOTHING
UPDATE rf_tbl_abcd_pk SET a = 1

ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_pk WHERE (c > 99)
ERROR: 
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_pk WHERE (c > 99)

Parser Error: syntax error at or near "PUBLICATION"

-- fail - ''c'' is not in PK and not in REPLICA IDENTITY NOTHING
UPDATE rf_tbl_abcd_pk SET a = 1

ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_nopk WHERE (a > 99)
ERROR: 
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_nopk WHERE (a > 99)

Parser Error: syntax error at or near "PUBLICATION"

-- fail - ''a'' is not in REPLICA IDENTITY NOTHING
UPDATE rf_tbl_abcd_nopk SET a = 1


-- Case 4. REPLICA IDENTITY INDEX
ALTER TABLE rf_tbl_abcd_pk ALTER COLUMN c SET NOT NULL

CREATE UNIQUE INDEX idx_abcd_pk_c ON rf_tbl_abcd_pk(c)

ALTER TABLE rf_tbl_abcd_pk REPLICA IDENTITY USING INDEX idx_abcd_pk_c
ERROR: 
ALTER TABLE rf_tbl_abcd_pk REPLICA IDENTITY USING INDEX idx_abcd_pk_c

Parser Error: syntax error at or near "REPLICA"

ALTER TABLE rf_tbl_abcd_nopk ALTER COLUMN c SET NOT NULL

CREATE UNIQUE INDEX idx_abcd_nopk_c ON rf_tbl_abcd_nopk(c)

ALTER TABLE rf_tbl_abcd_nopk REPLICA IDENTITY USING INDEX idx_abcd_nopk_c
ERROR: 
ALTER TABLE rf_tbl_abcd_nopk REPLICA IDENTITY USING INDEX idx_abcd_nopk_c

Parser Error: syntax error at or near "REPLICA"

ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_pk WHERE (a > 99)
ERROR: 
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_pk WHERE (a > 99)

Parser Error: syntax error at or near "PUBLICATION"

-- fail - ''a'' is in PK but it is not part of REPLICA IDENTITY INDEX
UPDATE rf_tbl_abcd_pk SET a = 1

ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_pk WHERE (c > 99)
ERROR: 
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_pk WHERE (c > 99)

Parser Error: syntax error at or near "PUBLICATION"

-- ok - ''c'' is not in PK but it is part of REPLICA IDENTITY INDEX
UPDATE rf_tbl_abcd_pk SET a = 1

ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_nopk WHERE (a > 99)
ERROR: 
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_nopk WHERE (a > 99)

Parser Error: syntax error at or near "PUBLICATION"

-- fail - ''a'' is not in REPLICA IDENTITY INDEX
UPDATE rf_tbl_abcd_nopk SET a = 1

ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_nopk WHERE (c > 99)
ERROR: 
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_nopk WHERE (c > 99)

Parser Error: syntax error at or near "PUBLICATION"

-- ok - ''c'' is part of REPLICA IDENTITY INDEX
UPDATE rf_tbl_abcd_nopk SET a = 1


-- Tests for partitioned table

-- set PUBLISH_VIA_PARTITION_ROOT to false and test row filter for partitioned
-- table
ALTER PUBLICATION testpub6 SET (PUBLISH_VIA_PARTITION_ROOT=0)
ERROR: 

-- Tests for partitioned table

-- set PUBLISH_VIA_PARTITION_ROOT to false and test row filter for partitioned
-- table
ALTER PUBLICATION testpub6 SET (PUBLISH_VIA_PARTITION_ROOT=0)

Parser Error: syntax error at or near "PUBLICATION"

-- fail - cannot use row filter for partitioned table
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_part_pk WHERE (a > 99)
ERROR: 
-- fail - cannot use row filter for partitioned table
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_part_pk WHERE (a > 99)

Parser Error: syntax error at or near "PUBLICATION"

-- ok - can use row filter for partition
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_part_pk_1 WHERE (a > 99)
ERROR: 
-- ok - can use row filter for partition
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_part_pk_1 WHERE (a > 99)

Parser Error: syntax error at or near "PUBLICATION"

-- ok - ''a'' is a PK col
UPDATE rf_tbl_abcd_part_pk SET a = 1
ERROR: 
-- ok - ''a'' is a PK col
UPDATE rf_tbl_abcd_part_pk SET a = 1

Catalog Error: Table with name rf_tbl_abcd_part_pk does not exist!
Did you mean "rf_tbl_abcd_part_pk_1"?
LINE 3: UPDATE rf_tbl_abcd_part_pk SET a = 1
               ^

-- set PUBLISH_VIA_PARTITION_ROOT to true and test row filter for partitioned
-- table
ALTER PUBLICATION testpub6 SET (PUBLISH_VIA_PARTITION_ROOT=1)
ERROR: 
-- set PUBLISH_VIA_PARTITION_ROOT to true and test row filter for partitioned
-- table
ALTER PUBLICATION testpub6 SET (PUBLISH_VIA_PARTITION_ROOT=1)

Parser Error: syntax error at or near "PUBLICATION"

-- ok - can use row filter for partitioned table
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_part_pk WHERE (a > 99)
ERROR: 
-- ok - can use row filter for partitioned table
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_part_pk WHERE (a > 99)

Parser Error: syntax error at or near "PUBLICATION"

-- ok - ''a'' is a PK col
UPDATE rf_tbl_abcd_part_pk SET a = 1
ERROR: 
-- ok - ''a'' is a PK col
UPDATE rf_tbl_abcd_part_pk SET a = 1

Catalog Error: Table with name rf_tbl_abcd_part_pk does not exist!
Did you mean "rf_tbl_abcd_part_pk_1"?
LINE 3: UPDATE rf_tbl_abcd_part_pk SET a = 1
               ^

-- fail - cannot set PUBLISH_VIA_PARTITION_ROOT to false if any row filter is
-- used for partitioned table
ALTER PUBLICATION testpub6 SET (PUBLISH_VIA_PARTITION_ROOT=0)
ERROR: 
-- fail - cannot set PUBLISH_VIA_PARTITION_ROOT to false if any row filter is
-- used for partitioned table
ALTER PUBLICATION testpub6 SET (PUBLISH_VIA_PARTITION_ROOT=0)

Parser Error: syntax error at or near "PUBLICATION"

-- remove partitioned table''s row filter
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_part_pk
ERROR: 
-- remove partitioned table''s row filter
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_part_pk

Parser Error: syntax error at or near "PUBLICATION"

-- ok - we don''t have row filter for partitioned table.
ALTER PUBLICATION testpub6 SET (PUBLISH_VIA_PARTITION_ROOT=0)
ERROR: 
-- ok - we don''t have row filter for partitioned table.
ALTER PUBLICATION testpub6 SET (PUBLISH_VIA_PARTITION_ROOT=0)

Parser Error: syntax error at or near "PUBLICATION"

-- Now change the root filter to use a column ''b''
-- (which is not in the replica identity)
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_part_pk_1 WHERE (b > 99)
ERROR: 
-- Now change the root filter to use a column ''b''
-- (which is not in the replica identity)
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_part_pk_1 WHERE (b > 99)

Parser Error: syntax error at or near "PUBLICATION"

-- ok - we don''t have row filter for partitioned table.
ALTER PUBLICATION testpub6 SET (PUBLISH_VIA_PARTITION_ROOT=0)
ERROR: 
-- ok - we don''t have row filter for partitioned table.
ALTER PUBLICATION testpub6 SET (PUBLISH_VIA_PARTITION_ROOT=0)

Parser Error: syntax error at or near "PUBLICATION"

-- fail - ''b'' is not in REPLICA IDENTITY INDEX
UPDATE rf_tbl_abcd_part_pk SET a = 1
ERROR: 
-- fail - ''b'' is not in REPLICA IDENTITY INDEX
UPDATE rf_tbl_abcd_part_pk SET a = 1

Catalog Error: Table with name rf_tbl_abcd_part_pk does not exist!
Did you mean "rf_tbl_abcd_part_pk_1"?
LINE 3: UPDATE rf_tbl_abcd_part_pk SET a = 1
               ^

-- set PUBLISH_VIA_PARTITION_ROOT to true
-- can use row filter for partitioned table
ALTER PUBLICATION testpub6 SET (PUBLISH_VIA_PARTITION_ROOT=1)
ERROR: 
-- set PUBLISH_VIA_PARTITION_ROOT to true
-- can use row filter for partitioned table
ALTER PUBLICATION testpub6 SET (PUBLISH_VIA_PARTITION_ROOT=1)

Parser Error: syntax error at or near "PUBLICATION"

-- ok - can use row filter for partitioned table
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_part_pk WHERE (b > 99)
ERROR: 
-- ok - can use row filter for partitioned table
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_part_pk WHERE (b > 99)

Parser Error: syntax error at or near "PUBLICATION"

-- fail - ''b'' is not in REPLICA IDENTITY INDEX
UPDATE rf_tbl_abcd_part_pk SET a = 1
ERROR: 
-- fail - ''b'' is not in REPLICA IDENTITY INDEX
UPDATE rf_tbl_abcd_part_pk SET a = 1

Catalog Error: Table with name rf_tbl_abcd_part_pk does not exist!
Did you mean "rf_tbl_abcd_part_pk_1"?
LINE 3: UPDATE rf_tbl_abcd_part_pk SET a = 1
               ^


DROP PUBLICATION testpub6
ERROR: 

DROP PUBLICATION testpub6

Not implemented Error: Cannot drop this type yet

DROP TABLE rf_tbl_abcd_pk

DROP TABLE rf_tbl_abcd_nopk

DROP TABLE rf_tbl_abcd_part_pk
ERROR: 
DROP TABLE rf_tbl_abcd_part_pk

Catalog Error: Table with name rf_tbl_abcd_part_pk does not exist!
Did you mean "rf_tbl_abcd_part_pk_1"?

-- ======================================================

-- fail - duplicate tables are not allowed if that table has any column lists
SET client_min_messages = 'ERROR'
ERROR: 
-- ======================================================

-- fail - duplicate tables are not allowed if that table has any column lists
SET client_min_messages = 'ERROR'

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE PUBLICATION testpub_dups FOR TABLE testpub_tbl1 (a), testpub_tbl1 WITH (publish = 'insert')
ERROR: 
CREATE PUBLICATION testpub_dups FOR TABLE testpub_tbl1 (a), testpub_tbl1 WITH (publish = 'insert')

Parser Error: syntax error at or near "PUBLICATION"

CREATE PUBLICATION testpub_dups FOR TABLE testpub_tbl1, testpub_tbl1 (a) WITH (publish = 'insert')
ERROR: 
CREATE PUBLICATION testpub_dups FOR TABLE testpub_tbl1, testpub_tbl1 (a) WITH (publish = 'insert')

Parser Error: syntax error at or near "PUBLICATION"

RESET client_min_messages
ERROR: 
RESET client_min_messages

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"


-- test for column lists
SET client_min_messages = 'ERROR'
ERROR: 

-- test for column lists
SET client_min_messages = 'ERROR'

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE PUBLICATION testpub_fortable FOR TABLE testpub_tbl1
ERROR: 
CREATE PUBLICATION testpub_fortable FOR TABLE testpub_tbl1

Parser Error: syntax error at or near "PUBLICATION"

CREATE PUBLICATION testpub_fortable_insert WITH (publish = 'insert')
ERROR: 
CREATE PUBLICATION testpub_fortable_insert WITH (publish = 'insert')

Parser Error: syntax error at or near "PUBLICATION"

RESET client_min_messages
ERROR: 
RESET client_min_messages

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE TABLE testpub_tbl5 (a int PRIMARY KEY, b text, c text,
	d int generated always as (a + length(b)) stored)
ERROR: 
CREATE TABLE testpub_tbl5 (a int PRIMARY KEY, b text, c text,
	d int generated always as (a + length(b)) stored)

Invalid Input Error: Can not create a STORED generated column!

-- error: column ''x'' does not exist
ALTER PUBLICATION testpub_fortable ADD TABLE testpub_tbl5 (a, x)
ERROR: 
-- error: column ''x'' does not exist
ALTER PUBLICATION testpub_fortable ADD TABLE testpub_tbl5 (a, x)

Parser Error: syntax error at or near "PUBLICATION"

-- error: replica identity ''a'' not included in the column list
ALTER PUBLICATION testpub_fortable ADD TABLE testpub_tbl5 (b, c)
ERROR: 
-- error: replica identity ''a'' not included in the column list
ALTER PUBLICATION testpub_fortable ADD TABLE testpub_tbl5 (b, c)

Parser Error: syntax error at or near "PUBLICATION"

UPDATE testpub_tbl5 SET a = 1
ERROR: 
UPDATE testpub_tbl5 SET a = 1

Catalog Error: Table with name testpub_tbl5 does not exist!
Did you mean "testpub_tbl3"?
LINE 2: UPDATE testpub_tbl5 SET a = 1
               ^

ALTER PUBLICATION testpub_fortable DROP TABLE testpub_tbl5
ERROR: 
ALTER PUBLICATION testpub_fortable DROP TABLE testpub_tbl5

Parser Error: syntax error at or near "PUBLICATION"

-- error: generated column ''d'' can''t be in list
ALTER PUBLICATION testpub_fortable ADD TABLE testpub_tbl5 (a, d)
ERROR: 
-- error: generated column ''d'' can''t be in list
ALTER PUBLICATION testpub_fortable ADD TABLE testpub_tbl5 (a, d)

Parser Error: syntax error at or near "PUBLICATION"

-- error: system attributes ''ctid'' not allowed in column list
ALTER PUBLICATION testpub_fortable ADD TABLE testpub_tbl5 (a, ctid)
ERROR: 
-- error: system attributes ''ctid'' not allowed in column list
ALTER PUBLICATION testpub_fortable ADD TABLE testpub_tbl5 (a, ctid)

Parser Error: syntax error at or near "PUBLICATION"

-- ok
ALTER PUBLICATION testpub_fortable ADD TABLE testpub_tbl5 (a, c)
ERROR: 
-- ok
ALTER PUBLICATION testpub_fortable ADD TABLE testpub_tbl5 (a, c)

Parser Error: syntax error at or near "PUBLICATION"

ALTER TABLE testpub_tbl5 DROP COLUMN c
ERROR: 
ALTER TABLE testpub_tbl5 DROP COLUMN c

Catalog Error: Table with name testpub_tbl5 does not exist!
Did you mean "testpub_tbl3"?
		-- no dice
-- ok: for insert-only publication, any column list is acceptable
ALTER PUBLICATION testpub_fortable_insert ADD TABLE testpub_tbl5 (b, c)
ERROR: 		-- no dice
-- ok: for insert-only publication, any column list is acceptable
ALTER PUBLICATION testpub_fortable_insert ADD TABLE testpub_tbl5 (b, c)

Parser Error: syntax error at or near "PUBLICATION"


/* not all replica identities are good enough */
CREATE UNIQUE INDEX testpub_tbl5_b_key ON testpub_tbl5 (b, c)
ERROR: 

/* not all replica identities are good enough */
CREATE UNIQUE INDEX testpub_tbl5_b_key ON testpub_tbl5 (b, c)

Catalog Error: Table with name testpub_tbl5 does not exist!
Did you mean "testpub_tbl3"?

ALTER TABLE testpub_tbl5 ALTER b SET NOT NULL, ALTER c SET NOT NULL
ERROR: 
ALTER TABLE testpub_tbl5 ALTER b SET NOT NULL, ALTER c SET NOT NULL

Parser Error: Only one ALTER command per statement is supported

ALTER TABLE testpub_tbl5 REPLICA IDENTITY USING INDEX testpub_tbl5_b_key
ERROR: 
ALTER TABLE testpub_tbl5 REPLICA IDENTITY USING INDEX testpub_tbl5_b_key

Parser Error: syntax error at or near "REPLICA"

-- error: replica identity (b,c) is not covered by column list (a, c)
UPDATE testpub_tbl5 SET a = 1
ERROR: 
-- error: replica identity (b,c) is not covered by column list (a, c)
UPDATE testpub_tbl5 SET a = 1

Catalog Error: Table with name testpub_tbl5 does not exist!
Did you mean "testpub_tbl3"?
LINE 3: UPDATE testpub_tbl5 SET a = 1
               ^

ALTER PUBLICATION testpub_fortable DROP TABLE testpub_tbl5
ERROR: 
ALTER PUBLICATION testpub_fortable DROP TABLE testpub_tbl5

Parser Error: syntax error at or near "PUBLICATION"


-- error: change the replica identity to ''b'', and column list to (a, c)
-- then update fails, because (a, c) does not cover replica identity
ALTER TABLE testpub_tbl5 REPLICA IDENTITY USING INDEX testpub_tbl5_b_key
ERROR: 

-- error: change the replica identity to ''b'', and column list to (a, c)
-- then update fails, because (a, c) does not cover replica identity
ALTER TABLE testpub_tbl5 REPLICA IDENTITY USING INDEX testpub_tbl5_b_key

Parser Error: syntax error at or near "REPLICA"

ALTER PUBLICATION testpub_fortable ADD TABLE testpub_tbl5 (a, c)
ERROR: 
ALTER PUBLICATION testpub_fortable ADD TABLE testpub_tbl5 (a, c)

Parser Error: syntax error at or near "PUBLICATION"

UPDATE testpub_tbl5 SET a = 1
ERROR: 
UPDATE testpub_tbl5 SET a = 1

Catalog Error: Table with name testpub_tbl5 does not exist!
Did you mean "testpub_tbl3"?
LINE 2: UPDATE testpub_tbl5 SET a = 1
               ^


/* But if upd/del are not published, it works OK */
SET client_min_messages = 'ERROR'
ERROR: 

/* But if upd/del are not published, it works OK */
SET client_min_messages = 'ERROR'

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE PUBLICATION testpub_table_ins WITH (publish = 'insert, truncate')
ERROR: 
CREATE PUBLICATION testpub_table_ins WITH (publish = 'insert, truncate')

Parser Error: syntax error at or near "PUBLICATION"

RESET client_min_messages
ERROR: 
RESET client_min_messages

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

ALTER PUBLICATION testpub_table_ins ADD TABLE testpub_tbl5 (a)
ERROR: 
ALTER PUBLICATION testpub_table_ins ADD TABLE testpub_tbl5 (a)

Parser Error: syntax error at or near "PUBLICATION"
		-- ok
-- \dRp+ testpub_table_ins

-- error: cannot work with deferrable primary keys
CREATE TABLE testpub_tbl5d (a int PRIMARY KEY DEFERRABLE)
ERROR: 		-- ok
-- \dRp+ testpub_table_ins

-- error: cannot work with deferrable primary keys
CREATE TABLE testpub_tbl5d (a int PRIMARY KEY DEFERRABLE)

Not implemented Error: Constraint not implemented!

ALTER PUBLICATION testpub_fortable ADD TABLE testpub_tbl5d
ERROR: 
ALTER PUBLICATION testpub_fortable ADD TABLE testpub_tbl5d

Parser Error: syntax error at or near "PUBLICATION"

UPDATE testpub_tbl5d SET a = 1
ERROR: 
UPDATE testpub_tbl5d SET a = 1

Catalog Error: Table with name testpub_tbl5d does not exist!
Did you mean "testpub_tbl3"?
LINE 2: UPDATE testpub_tbl5d SET a = 1
               ^

/* but works fine with FULL replica identity */
ALTER TABLE testpub_tbl5d REPLICA IDENTITY FULL
ERROR: 
/* but works fine with FULL replica identity */
ALTER TABLE testpub_tbl5d REPLICA IDENTITY FULL

Parser Error: syntax error at or near "REPLICA"

UPDATE testpub_tbl5d SET a = 1
ERROR: 
UPDATE testpub_tbl5d SET a = 1

Catalog Error: Table with name testpub_tbl5d does not exist!
Did you mean "testpub_tbl3"?
LINE 2: UPDATE testpub_tbl5d SET a = 1
               ^

DROP TABLE testpub_tbl5d
ERROR: 
DROP TABLE testpub_tbl5d

Catalog Error: Table with name testpub_tbl5d does not exist!
Did you mean "testpub_tbl3"?


-- tests with REPLICA IDENTITY FULL
CREATE TABLE testpub_tbl6 (a int, b text, c text)

ALTER TABLE testpub_tbl6 REPLICA IDENTITY FULL
ERROR: 
ALTER TABLE testpub_tbl6 REPLICA IDENTITY FULL

Parser Error: syntax error at or near "REPLICA"


ALTER PUBLICATION testpub_fortable ADD TABLE testpub_tbl6 (a, b, c)
ERROR: 

ALTER PUBLICATION testpub_fortable ADD TABLE testpub_tbl6 (a, b, c)

Parser Error: syntax error at or near "PUBLICATION"

UPDATE testpub_tbl6 SET a = 1

ALTER PUBLICATION testpub_fortable DROP TABLE testpub_tbl6
ERROR: 
ALTER PUBLICATION testpub_fortable DROP TABLE testpub_tbl6

Parser Error: syntax error at or near "PUBLICATION"


ALTER PUBLICATION testpub_fortable ADD TABLE testpub_tbl6
ERROR: 

ALTER PUBLICATION testpub_fortable ADD TABLE testpub_tbl6

Parser Error: syntax error at or near "PUBLICATION"
 -- ok
UPDATE testpub_tbl6 SET a = 1


-- make sure changing the column list is propagated to the catalog
CREATE TABLE testpub_tbl7 (a int primary key, b text, c text)

ALTER PUBLICATION testpub_fortable ADD TABLE testpub_tbl7 (a, b)
ERROR: 
ALTER PUBLICATION testpub_fortable ADD TABLE testpub_tbl7 (a, b)

Parser Error: syntax error at or near "PUBLICATION"

-- \d+ testpub_tbl7
-- ok: the column list is the same, we should skip this table (or at least not fail)
ALTER PUBLICATION testpub_fortable SET TABLE testpub_tbl7 (a, b)
ERROR: 
-- \d+ testpub_tbl7
-- ok: the column list is the same, we should skip this table (or at least not fail)
ALTER PUBLICATION testpub_fortable SET TABLE testpub_tbl7 (a, b)

Parser Error: syntax error at or near "PUBLICATION"

-- \d+ testpub_tbl7
-- ok: the column list changes, make sure the catalog gets updated
ALTER PUBLICATION testpub_fortable SET TABLE testpub_tbl7 (a, c)
ERROR: 
-- \d+ testpub_tbl7
-- ok: the column list changes, make sure the catalog gets updated
ALTER PUBLICATION testpub_fortable SET TABLE testpub_tbl7 (a, c)

Parser Error: syntax error at or near "PUBLICATION"

-- \d+ testpub_tbl7

-- column list for partitioned tables has to cover replica identities for
-- all child relations
CREATE TABLE testpub_tbl8 (a int, b text, c text) PARTITION BY HASH (a)
ERROR: 
-- \d+ testpub_tbl7

-- column list for partitioned tables has to cover replica identities for
-- all child relations
CREATE TABLE testpub_tbl8 (a int, b text, c text) PARTITION BY HASH (a)

Parser Error: syntax error at or near "PARTITION"

-- first partition has replica identity ''a''
CREATE TABLE testpub_tbl8_0 PARTITION OF testpub_tbl8 FOR VALUES WITH (modulus 2, remainder 0)
ERROR: 
-- first partition has replica identity ''a''
CREATE TABLE testpub_tbl8_0 PARTITION OF testpub_tbl8 FOR VALUES WITH (modulus 2, remainder 0)

Parser Error: syntax error at or near "PARTITION"

ALTER TABLE testpub_tbl8_0 ADD PRIMARY KEY (a)
ERROR: 
ALTER TABLE testpub_tbl8_0 ADD PRIMARY KEY (a)

Not implemented Error: No support for that ALTER TABLE option yet!

ALTER TABLE testpub_tbl8_0 REPLICA IDENTITY USING INDEX testpub_tbl8_0_pkey
ERROR: 
ALTER TABLE testpub_tbl8_0 REPLICA IDENTITY USING INDEX testpub_tbl8_0_pkey

Parser Error: syntax error at or near "REPLICA"

-- second partition has replica identity ''b''
CREATE TABLE testpub_tbl8_1 PARTITION OF testpub_tbl8 FOR VALUES WITH (modulus 2, remainder 1)
ERROR: 
-- second partition has replica identity ''b''
CREATE TABLE testpub_tbl8_1 PARTITION OF testpub_tbl8 FOR VALUES WITH (modulus 2, remainder 1)

Parser Error: syntax error at or near "PARTITION"

ALTER TABLE testpub_tbl8_1 ADD PRIMARY KEY (b)
ERROR: 
ALTER TABLE testpub_tbl8_1 ADD PRIMARY KEY (b)

Not implemented Error: No support for that ALTER TABLE option yet!

ALTER TABLE testpub_tbl8_1 REPLICA IDENTITY USING INDEX testpub_tbl8_1_pkey
ERROR: 
ALTER TABLE testpub_tbl8_1 REPLICA IDENTITY USING INDEX testpub_tbl8_1_pkey

Parser Error: syntax error at or near "REPLICA"


-- ok: column list covers both ''a'' and ''b''
SET client_min_messages = 'ERROR'
ERROR: 

-- ok: column list covers both ''a'' and ''b''
SET client_min_messages = 'ERROR'

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE PUBLICATION testpub_col_list FOR TABLE testpub_tbl8 (a, b) WITH (publish_via_partition_root = 'true')
ERROR: 
CREATE PUBLICATION testpub_col_list FOR TABLE testpub_tbl8 (a, b) WITH (publish_via_partition_root = 'true')

Parser Error: syntax error at or near "PUBLICATION"

RESET client_min_messages
ERROR: 
RESET client_min_messages

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"


-- ok: the same thing, but try plain ADD TABLE
ALTER PUBLICATION testpub_col_list DROP TABLE testpub_tbl8
ERROR: 

-- ok: the same thing, but try plain ADD TABLE
ALTER PUBLICATION testpub_col_list DROP TABLE testpub_tbl8

Parser Error: syntax error at or near "PUBLICATION"

ALTER PUBLICATION testpub_col_list ADD TABLE testpub_tbl8 (a, b)
ERROR: 
ALTER PUBLICATION testpub_col_list ADD TABLE testpub_tbl8 (a, b)

Parser Error: syntax error at or near "PUBLICATION"

UPDATE testpub_tbl8 SET a = 1
ERROR: 
UPDATE testpub_tbl8 SET a = 1

Catalog Error: Table with name testpub_tbl8 does not exist!
Did you mean "testpub_tbl3"?
LINE 2: UPDATE testpub_tbl8 SET a = 1
               ^


-- failure: column list does not cover replica identity for the second partition
ALTER PUBLICATION testpub_col_list DROP TABLE testpub_tbl8
ERROR: 

-- failure: column list does not cover replica identity for the second partition
ALTER PUBLICATION testpub_col_list DROP TABLE testpub_tbl8

Parser Error: syntax error at or near "PUBLICATION"

ALTER PUBLICATION testpub_col_list ADD TABLE testpub_tbl8 (a, c)
ERROR: 
ALTER PUBLICATION testpub_col_list ADD TABLE testpub_tbl8 (a, c)

Parser Error: syntax error at or near "PUBLICATION"

UPDATE testpub_tbl8 SET a = 1
ERROR: 
UPDATE testpub_tbl8 SET a = 1

Catalog Error: Table with name testpub_tbl8 does not exist!
Did you mean "testpub_tbl3"?
LINE 2: UPDATE testpub_tbl8 SET a = 1
               ^

ALTER PUBLICATION testpub_col_list DROP TABLE testpub_tbl8
ERROR: 
ALTER PUBLICATION testpub_col_list DROP TABLE testpub_tbl8

Parser Error: syntax error at or near "PUBLICATION"


-- failure: one of the partitions has REPLICA IDENTITY FULL
ALTER TABLE testpub_tbl8_1 REPLICA IDENTITY FULL
ERROR: 

-- failure: one of the partitions has REPLICA IDENTITY FULL
ALTER TABLE testpub_tbl8_1 REPLICA IDENTITY FULL

Parser Error: syntax error at or near "REPLICA"

ALTER PUBLICATION testpub_col_list ADD TABLE testpub_tbl8 (a, c)
ERROR: 
ALTER PUBLICATION testpub_col_list ADD TABLE testpub_tbl8 (a, c)

Parser Error: syntax error at or near "PUBLICATION"

UPDATE testpub_tbl8 SET a = 1
ERROR: 
UPDATE testpub_tbl8 SET a = 1

Catalog Error: Table with name testpub_tbl8 does not exist!
Did you mean "testpub_tbl3"?
LINE 2: UPDATE testpub_tbl8 SET a = 1
               ^

ALTER PUBLICATION testpub_col_list DROP TABLE testpub_tbl8
ERROR: 
ALTER PUBLICATION testpub_col_list DROP TABLE testpub_tbl8

Parser Error: syntax error at or near "PUBLICATION"


-- add table and then try changing replica identity
ALTER TABLE testpub_tbl8_1 REPLICA IDENTITY USING INDEX testpub_tbl8_1_pkey
ERROR: 

-- add table and then try changing replica identity
ALTER TABLE testpub_tbl8_1 REPLICA IDENTITY USING INDEX testpub_tbl8_1_pkey

Parser Error: syntax error at or near "REPLICA"

ALTER PUBLICATION testpub_col_list ADD TABLE testpub_tbl8 (a, b)
ERROR: 
ALTER PUBLICATION testpub_col_list ADD TABLE testpub_tbl8 (a, b)

Parser Error: syntax error at or near "PUBLICATION"


-- failure: replica identity full can''t be used with a column list
ALTER TABLE testpub_tbl8_1 REPLICA IDENTITY FULL
ERROR: 

-- failure: replica identity full can''t be used with a column list
ALTER TABLE testpub_tbl8_1 REPLICA IDENTITY FULL

Parser Error: syntax error at or near "REPLICA"

UPDATE testpub_tbl8 SET a = 1
ERROR: 
UPDATE testpub_tbl8 SET a = 1

Catalog Error: Table with name testpub_tbl8 does not exist!
Did you mean "testpub_tbl3"?
LINE 2: UPDATE testpub_tbl8 SET a = 1
               ^


-- failure: replica identity has to be covered by the column list
ALTER TABLE testpub_tbl8_1 DROP CONSTRAINT testpub_tbl8_1_pkey
ERROR: 

-- failure: replica identity has to be covered by the column list
ALTER TABLE testpub_tbl8_1 DROP CONSTRAINT testpub_tbl8_1_pkey

Not implemented Error: No support for that ALTER TABLE option yet!

ALTER TABLE testpub_tbl8_1 ADD PRIMARY KEY (c)
ERROR: 
ALTER TABLE testpub_tbl8_1 ADD PRIMARY KEY (c)

Not implemented Error: No support for that ALTER TABLE option yet!

ALTER TABLE testpub_tbl8_1 REPLICA IDENTITY USING INDEX testpub_tbl8_1_pkey
ERROR: 
ALTER TABLE testpub_tbl8_1 REPLICA IDENTITY USING INDEX testpub_tbl8_1_pkey

Parser Error: syntax error at or near "REPLICA"

UPDATE testpub_tbl8 SET a = 1
ERROR: 
UPDATE testpub_tbl8 SET a = 1

Catalog Error: Table with name testpub_tbl8 does not exist!
Did you mean "testpub_tbl3"?
LINE 2: UPDATE testpub_tbl8 SET a = 1
               ^


DROP TABLE testpub_tbl8
ERROR: 

DROP TABLE testpub_tbl8

Catalog Error: Table with name testpub_tbl8 does not exist!
Did you mean "testpub_tbl3"?


-- column list for partitioned tables has to cover replica identities for
-- all child relations
CREATE TABLE testpub_tbl8 (a int, b text, c text) PARTITION BY HASH (a)
ERROR: 

-- column list for partitioned tables has to cover replica identities for
-- all child relations
CREATE TABLE testpub_tbl8 (a int, b text, c text) PARTITION BY HASH (a)

Parser Error: syntax error at or near "PARTITION"

ALTER PUBLICATION testpub_col_list ADD TABLE testpub_tbl8 (a, b)
ERROR: 
ALTER PUBLICATION testpub_col_list ADD TABLE testpub_tbl8 (a, b)

Parser Error: syntax error at or near "PUBLICATION"

-- first partition has replica identity ''a''
CREATE TABLE testpub_tbl8_0 (a int, b text, c text)

ALTER TABLE testpub_tbl8_0 ADD PRIMARY KEY (a)
ERROR: 
ALTER TABLE testpub_tbl8_0 ADD PRIMARY KEY (a)

Not implemented Error: No support for that ALTER TABLE option yet!

ALTER TABLE testpub_tbl8_0 REPLICA IDENTITY USING INDEX testpub_tbl8_0_pkey
ERROR: 
ALTER TABLE testpub_tbl8_0 REPLICA IDENTITY USING INDEX testpub_tbl8_0_pkey

Parser Error: syntax error at or near "REPLICA"

-- second partition has replica identity ''b''
CREATE TABLE testpub_tbl8_1 (a int, b text, c text)

ALTER TABLE testpub_tbl8_1 ADD PRIMARY KEY (c)
ERROR: 
ALTER TABLE testpub_tbl8_1 ADD PRIMARY KEY (c)

Not implemented Error: No support for that ALTER TABLE option yet!

ALTER TABLE testpub_tbl8_1 REPLICA IDENTITY USING INDEX testpub_tbl8_1_pkey
ERROR: 
ALTER TABLE testpub_tbl8_1 REPLICA IDENTITY USING INDEX testpub_tbl8_1_pkey

Parser Error: syntax error at or near "REPLICA"


-- ok: attaching first partition works, because (a) is in column list
ALTER TABLE testpub_tbl8 ATTACH PARTITION testpub_tbl8_0 FOR VALUES WITH (modulus 2, remainder 0)
ERROR: 

-- ok: attaching first partition works, because (a) is in column list
ALTER TABLE testpub_tbl8 ATTACH PARTITION testpub_tbl8_0 FOR VALUES WITH (modulus 2, remainder 0)

Parser Error: syntax error at or near "ATTACH"

-- failure: second partition has replica identity (c), which si not in column list
ALTER TABLE testpub_tbl8 ATTACH PARTITION testpub_tbl8_1 FOR VALUES WITH (modulus 2, remainder 1)
ERROR: 
-- failure: second partition has replica identity (c), which si not in column list
ALTER TABLE testpub_tbl8 ATTACH PARTITION testpub_tbl8_1 FOR VALUES WITH (modulus 2, remainder 1)

Parser Error: syntax error at or near "ATTACH"

UPDATE testpub_tbl8 SET a = 1
ERROR: 
UPDATE testpub_tbl8 SET a = 1

Catalog Error: Table with name testpub_tbl8 does not exist!
Did you mean "testpub_tbl3"?
LINE 2: UPDATE testpub_tbl8 SET a = 1
               ^


-- failure: changing replica identity to FULL for partition fails, because
-- of the column list on the parent
ALTER TABLE testpub_tbl8_0 REPLICA IDENTITY FULL
ERROR: 

-- failure: changing replica identity to FULL for partition fails, because
-- of the column list on the parent
ALTER TABLE testpub_tbl8_0 REPLICA IDENTITY FULL

Parser Error: syntax error at or near "REPLICA"

UPDATE testpub_tbl8 SET a = 1
ERROR: 
UPDATE testpub_tbl8 SET a = 1

Catalog Error: Table with name testpub_tbl8 does not exist!
Did you mean "testpub_tbl3"?
LINE 2: UPDATE testpub_tbl8 SET a = 1
               ^


-- test that using column list for table is disallowed if any schemas are
-- part of the publication
SET client_min_messages = 'ERROR'
ERROR: 

-- test that using column list for table is disallowed if any schemas are
-- part of the publication
SET client_min_messages = 'ERROR'

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

-- failure - cannot use column list and schema together
CREATE PUBLICATION testpub_tbl9 FOR TABLES IN SCHEMA public, TABLE public.testpub_tbl7(a)
ERROR: 
-- failure - cannot use column list and schema together
CREATE PUBLICATION testpub_tbl9 FOR TABLES IN SCHEMA public, TABLE public.testpub_tbl7(a)

Parser Error: syntax error at or near "PUBLICATION"

-- ok - only publish schema
CREATE PUBLICATION testpub_tbl9 FOR TABLES IN SCHEMA public
ERROR: 
-- ok - only publish schema
CREATE PUBLICATION testpub_tbl9 FOR TABLES IN SCHEMA public

Parser Error: syntax error at or near "PUBLICATION"

-- failure - add a table with column list when there is already a schema in the
-- publication
ALTER PUBLICATION testpub_tbl9 ADD TABLE public.testpub_tbl7(a)
ERROR: 
-- failure - add a table with column list when there is already a schema in the
-- publication
ALTER PUBLICATION testpub_tbl9 ADD TABLE public.testpub_tbl7(a)

Parser Error: syntax error at or near "PUBLICATION"

-- ok - only publish table with column list
ALTER PUBLICATION testpub_tbl9 SET TABLE public.testpub_tbl7(a)
ERROR: 
-- ok - only publish table with column list
ALTER PUBLICATION testpub_tbl9 SET TABLE public.testpub_tbl7(a)

Parser Error: syntax error at or near "PUBLICATION"

-- failure - specify a schema when there is already a column list in the
-- publication
ALTER PUBLICATION testpub_tbl9 ADD TABLES IN SCHEMA public
ERROR: 
-- failure - specify a schema when there is already a column list in the
-- publication
ALTER PUBLICATION testpub_tbl9 ADD TABLES IN SCHEMA public

Parser Error: syntax error at or near "PUBLICATION"

-- failure - cannot SET column list and schema together
ALTER PUBLICATION testpub_tbl9 SET TABLES IN SCHEMA public, TABLE public.testpub_tbl7(a)
ERROR: 
-- failure - cannot SET column list and schema together
ALTER PUBLICATION testpub_tbl9 SET TABLES IN SCHEMA public, TABLE public.testpub_tbl7(a)

Parser Error: syntax error at or near "PUBLICATION"

-- ok - drop table
ALTER PUBLICATION testpub_tbl9 DROP TABLE public.testpub_tbl7
ERROR: 
-- ok - drop table
ALTER PUBLICATION testpub_tbl9 DROP TABLE public.testpub_tbl7

Parser Error: syntax error at or near "PUBLICATION"

-- failure - cannot ADD column list and schema together
ALTER PUBLICATION testpub_tbl9 ADD TABLES IN SCHEMA public, TABLE public.testpub_tbl7(a)
ERROR: 
-- failure - cannot ADD column list and schema together
ALTER PUBLICATION testpub_tbl9 ADD TABLES IN SCHEMA public, TABLE public.testpub_tbl7(a)

Parser Error: syntax error at or near "PUBLICATION"

RESET client_min_messages
ERROR: 
RESET client_min_messages

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"


DROP TABLE testpub_tbl5, testpub_tbl6, testpub_tbl7, testpub_tbl8, testpub_tbl8_1
ERROR: 

DROP TABLE testpub_tbl5, testpub_tbl6, testpub_tbl7, testpub_tbl8, testpub_tbl8_1

Not implemented Error: Can only drop one object at a time

DROP PUBLICATION testpub_table_ins, testpub_fortable, testpub_fortable_insert, testpub_col_list, testpub_tbl9
ERROR: 
DROP PUBLICATION testpub_table_ins, testpub_fortable, testpub_fortable_insert, testpub_col_list, testpub_tbl9

Not implemented Error: Can only drop one object at a time

-- ======================================================

-- Test combination of column list and row filter
SET client_min_messages = 'ERROR'
ERROR: 
-- ======================================================

-- Test combination of column list and row filter
SET client_min_messages = 'ERROR'

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE PUBLICATION testpub_both_filters
ERROR: 
CREATE PUBLICATION testpub_both_filters

Parser Error: syntax error at or near "PUBLICATION"

RESET client_min_messages
ERROR: 
RESET client_min_messages

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE TABLE testpub_tbl_both_filters (a int, b int, c int, PRIMARY KEY (a,c))

ALTER TABLE testpub_tbl_both_filters REPLICA IDENTITY USING INDEX testpub_tbl_both_filters_pkey
ERROR: 
ALTER TABLE testpub_tbl_both_filters REPLICA IDENTITY USING INDEX testpub_tbl_both_filters_pkey

Parser Error: syntax error at or near "REPLICA"

ALTER PUBLICATION testpub_both_filters ADD TABLE testpub_tbl_both_filters (a,c) WHERE (c != 1)
ERROR: 
ALTER PUBLICATION testpub_both_filters ADD TABLE testpub_tbl_both_filters (a,c) WHERE (c != 1)

Parser Error: syntax error at or near "PUBLICATION"

-- \dRp+ testpub_both_filters
-- \d+ testpub_tbl_both_filters

DROP TABLE testpub_tbl_both_filters

DROP PUBLICATION testpub_both_filters
ERROR: 
DROP PUBLICATION testpub_both_filters

Not implemented Error: Cannot drop this type yet

-- ======================================================

-- More column list tests for validating column references
CREATE TABLE rf_tbl_abcd_nopk(a int, b int, c int, d int)

CREATE TABLE rf_tbl_abcd_pk(a int, b int, c int, d int, PRIMARY KEY(a,b))

CREATE TABLE rf_tbl_abcd_part_pk (a int PRIMARY KEY, b int) PARTITION by RANGE (a)
ERROR: 
CREATE TABLE rf_tbl_abcd_part_pk (a int PRIMARY KEY, b int) PARTITION by RANGE (a)

Parser Error: syntax error at or near "PARTITION"

CREATE TABLE rf_tbl_abcd_part_pk_1 (b int, a int PRIMARY KEY)
ERROR: 
CREATE TABLE rf_tbl_abcd_part_pk_1 (b int, a int PRIMARY KEY)

Catalog Error: Table with name "rf_tbl_abcd_part_pk_1" already exists!

ALTER TABLE rf_tbl_abcd_part_pk ATTACH PARTITION rf_tbl_abcd_part_pk_1 FOR VALUES FROM (1) TO (10)
ERROR: 
ALTER TABLE rf_tbl_abcd_part_pk ATTACH PARTITION rf_tbl_abcd_part_pk_1 FOR VALUES FROM (1) TO (10)

Parser Error: syntax error at or near "ATTACH"


-- Case 1. REPLICA IDENTITY DEFAULT (means use primary key or nothing)

-- 1a. REPLICA IDENTITY is DEFAULT and table has a PK.
SET client_min_messages = 'ERROR'
ERROR: 

-- Case 1. REPLICA IDENTITY DEFAULT (means use primary key or nothing)

-- 1a. REPLICA IDENTITY is DEFAULT and table has a PK.
SET client_min_messages = 'ERROR'

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE PUBLICATION testpub6 FOR TABLE rf_tbl_abcd_pk (a, b)
ERROR: 
CREATE PUBLICATION testpub6 FOR TABLE rf_tbl_abcd_pk (a, b)

Parser Error: syntax error at or near "PUBLICATION"

RESET client_min_messages
ERROR: 
RESET client_min_messages

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

-- ok - (a,b) coverts all PK cols
UPDATE rf_tbl_abcd_pk SET a = 1

ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_pk (a, b, c)
ERROR: 
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_pk (a, b, c)

Parser Error: syntax error at or near "PUBLICATION"

-- ok - (a,b,c) coverts all PK cols
UPDATE rf_tbl_abcd_pk SET a = 1

ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_pk (a)
ERROR: 
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_pk (a)

Parser Error: syntax error at or near "PUBLICATION"

-- fail - ''b'' is missing from the column list
UPDATE rf_tbl_abcd_pk SET a = 1

ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_pk (b)
ERROR: 
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_pk (b)

Parser Error: syntax error at or near "PUBLICATION"

-- fail - ''a'' is missing from the column list
UPDATE rf_tbl_abcd_pk SET a = 1


-- 1b. REPLICA IDENTITY is DEFAULT and table has no PK
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_nopk (a)
ERROR: 

-- 1b. REPLICA IDENTITY is DEFAULT and table has no PK
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_nopk (a)

Parser Error: syntax error at or near "PUBLICATION"

-- ok - there''s no replica identity, so any column list works
-- note: it fails anyway, just a bit later because UPDATE requires RI
UPDATE rf_tbl_abcd_nopk SET a = 1


-- Case 2. REPLICA IDENTITY FULL
ALTER TABLE rf_tbl_abcd_pk REPLICA IDENTITY FULL
ERROR: 

-- Case 2. REPLICA IDENTITY FULL
ALTER TABLE rf_tbl_abcd_pk REPLICA IDENTITY FULL

Parser Error: syntax error at or near "REPLICA"

ALTER TABLE rf_tbl_abcd_nopk REPLICA IDENTITY FULL
ERROR: 
ALTER TABLE rf_tbl_abcd_nopk REPLICA IDENTITY FULL

Parser Error: syntax error at or near "REPLICA"

ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_pk (c)
ERROR: 
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_pk (c)

Parser Error: syntax error at or near "PUBLICATION"

-- fail - with REPLICA IDENTITY FULL no column list is allowed
UPDATE rf_tbl_abcd_pk SET a = 1

ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_nopk (a, b, c, d)
ERROR: 
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_nopk (a, b, c, d)

Parser Error: syntax error at or near "PUBLICATION"

-- fail - with REPLICA IDENTITY FULL no column list is allowed
UPDATE rf_tbl_abcd_nopk SET a = 1


-- Case 3. REPLICA IDENTITY NOTHING
ALTER TABLE rf_tbl_abcd_pk REPLICA IDENTITY NOTHING
ERROR: 

-- Case 3. REPLICA IDENTITY NOTHING
ALTER TABLE rf_tbl_abcd_pk REPLICA IDENTITY NOTHING

Parser Error: syntax error at or near "REPLICA"

ALTER TABLE rf_tbl_abcd_nopk REPLICA IDENTITY NOTHING
ERROR: 
ALTER TABLE rf_tbl_abcd_nopk REPLICA IDENTITY NOTHING

Parser Error: syntax error at or near "REPLICA"

ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_pk (a)
ERROR: 
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_pk (a)

Parser Error: syntax error at or near "PUBLICATION"

-- ok - REPLICA IDENTITY NOTHING means all column lists are valid
-- it still fails later because without RI we can''t replicate updates
UPDATE rf_tbl_abcd_pk SET a = 1

ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_pk (a, b, c, d)
ERROR: 
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_pk (a, b, c, d)

Parser Error: syntax error at or near "PUBLICATION"

-- ok - REPLICA IDENTITY NOTHING means all column lists are valid
-- it still fails later because without RI we can''t replicate updates
UPDATE rf_tbl_abcd_pk SET a = 1

ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_nopk (d)
ERROR: 
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_nopk (d)

Parser Error: syntax error at or near "PUBLICATION"

-- ok - REPLICA IDENTITY NOTHING means all column lists are valid
-- it still fails later because without RI we can''t replicate updates
UPDATE rf_tbl_abcd_nopk SET a = 1


-- Case 4. REPLICA IDENTITY INDEX
ALTER TABLE rf_tbl_abcd_pk ALTER COLUMN c SET NOT NULL

CREATE UNIQUE INDEX idx_abcd_pk_c ON rf_tbl_abcd_pk(c)

ALTER TABLE rf_tbl_abcd_pk REPLICA IDENTITY USING INDEX idx_abcd_pk_c
ERROR: 
ALTER TABLE rf_tbl_abcd_pk REPLICA IDENTITY USING INDEX idx_abcd_pk_c

Parser Error: syntax error at or near "REPLICA"

ALTER TABLE rf_tbl_abcd_nopk ALTER COLUMN c SET NOT NULL

CREATE UNIQUE INDEX idx_abcd_nopk_c ON rf_tbl_abcd_nopk(c)

ALTER TABLE rf_tbl_abcd_nopk REPLICA IDENTITY USING INDEX idx_abcd_nopk_c
ERROR: 
ALTER TABLE rf_tbl_abcd_nopk REPLICA IDENTITY USING INDEX idx_abcd_nopk_c

Parser Error: syntax error at or near "REPLICA"

ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_pk (a)
ERROR: 
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_pk (a)

Parser Error: syntax error at or near "PUBLICATION"

-- fail - column list ''a'' does not cover the REPLICA IDENTITY INDEX on ''c''
UPDATE rf_tbl_abcd_pk SET a = 1

ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_pk (c)
ERROR: 
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_pk (c)

Parser Error: syntax error at or near "PUBLICATION"

-- ok - column list ''c'' does cover the REPLICA IDENTITY INDEX on ''c''
UPDATE rf_tbl_abcd_pk SET a = 1

ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_nopk (a)
ERROR: 
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_nopk (a)

Parser Error: syntax error at or near "PUBLICATION"

-- fail - column list ''a'' does not cover the REPLICA IDENTITY INDEX on ''c''
UPDATE rf_tbl_abcd_nopk SET a = 1

ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_nopk (c)
ERROR: 
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_nopk (c)

Parser Error: syntax error at or near "PUBLICATION"

-- ok - column list ''c'' does cover the REPLICA IDENTITY INDEX on ''c''
UPDATE rf_tbl_abcd_nopk SET a = 1


-- Tests for partitioned table

-- set PUBLISH_VIA_PARTITION_ROOT to false and test column list for partitioned
-- table
ALTER PUBLICATION testpub6 SET (PUBLISH_VIA_PARTITION_ROOT=0)
ERROR: 

-- Tests for partitioned table

-- set PUBLISH_VIA_PARTITION_ROOT to false and test column list for partitioned
-- table
ALTER PUBLICATION testpub6 SET (PUBLISH_VIA_PARTITION_ROOT=0)

Parser Error: syntax error at or near "PUBLICATION"

-- fail - cannot use column list for partitioned table
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_part_pk (a)
ERROR: 
-- fail - cannot use column list for partitioned table
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_part_pk (a)

Parser Error: syntax error at or near "PUBLICATION"

-- ok - can use column list for partition
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_part_pk_1 (a)
ERROR: 
-- ok - can use column list for partition
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_part_pk_1 (a)

Parser Error: syntax error at or near "PUBLICATION"

-- ok - ''a'' is a PK col
UPDATE rf_tbl_abcd_part_pk SET a = 1
ERROR: 
-- ok - ''a'' is a PK col
UPDATE rf_tbl_abcd_part_pk SET a = 1

Catalog Error: Table with name rf_tbl_abcd_part_pk does not exist!
Did you mean "rf_tbl_abcd_part_pk_1"?
LINE 3: UPDATE rf_tbl_abcd_part_pk SET a = 1
               ^

-- set PUBLISH_VIA_PARTITION_ROOT to true and test column list for partitioned
-- table
ALTER PUBLICATION testpub6 SET (PUBLISH_VIA_PARTITION_ROOT=1)
ERROR: 
-- set PUBLISH_VIA_PARTITION_ROOT to true and test column list for partitioned
-- table
ALTER PUBLICATION testpub6 SET (PUBLISH_VIA_PARTITION_ROOT=1)

Parser Error: syntax error at or near "PUBLICATION"

-- ok - can use column list for partitioned table
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_part_pk (a)
ERROR: 
-- ok - can use column list for partitioned table
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_part_pk (a)

Parser Error: syntax error at or near "PUBLICATION"

-- ok - ''a'' is a PK col
UPDATE rf_tbl_abcd_part_pk SET a = 1
ERROR: 
-- ok - ''a'' is a PK col
UPDATE rf_tbl_abcd_part_pk SET a = 1

Catalog Error: Table with name rf_tbl_abcd_part_pk does not exist!
Did you mean "rf_tbl_abcd_part_pk_1"?
LINE 3: UPDATE rf_tbl_abcd_part_pk SET a = 1
               ^

-- fail - cannot set PUBLISH_VIA_PARTITION_ROOT to false if any column list is
-- used for partitioned table
ALTER PUBLICATION testpub6 SET (PUBLISH_VIA_PARTITION_ROOT=0)
ERROR: 
-- fail - cannot set PUBLISH_VIA_PARTITION_ROOT to false if any column list is
-- used for partitioned table
ALTER PUBLICATION testpub6 SET (PUBLISH_VIA_PARTITION_ROOT=0)

Parser Error: syntax error at or near "PUBLICATION"

-- remove partitioned table''s column list
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_part_pk
ERROR: 
-- remove partitioned table''s column list
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_part_pk

Parser Error: syntax error at or near "PUBLICATION"

-- ok - we don''t have column list for partitioned table.
ALTER PUBLICATION testpub6 SET (PUBLISH_VIA_PARTITION_ROOT=0)
ERROR: 
-- ok - we don''t have column list for partitioned table.
ALTER PUBLICATION testpub6 SET (PUBLISH_VIA_PARTITION_ROOT=0)

Parser Error: syntax error at or near "PUBLICATION"

-- Now change the root column list to use a column ''b''
-- (which is not in the replica identity)
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_part_pk_1 (b)
ERROR: 
-- Now change the root column list to use a column ''b''
-- (which is not in the replica identity)
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_part_pk_1 (b)

Parser Error: syntax error at or near "PUBLICATION"

-- ok - we don''t have column list for partitioned table.
ALTER PUBLICATION testpub6 SET (PUBLISH_VIA_PARTITION_ROOT=0)
ERROR: 
-- ok - we don''t have column list for partitioned table.
ALTER PUBLICATION testpub6 SET (PUBLISH_VIA_PARTITION_ROOT=0)

Parser Error: syntax error at or near "PUBLICATION"

-- fail - ''b'' is not in REPLICA IDENTITY INDEX
UPDATE rf_tbl_abcd_part_pk SET a = 1
ERROR: 
-- fail - ''b'' is not in REPLICA IDENTITY INDEX
UPDATE rf_tbl_abcd_part_pk SET a = 1

Catalog Error: Table with name rf_tbl_abcd_part_pk does not exist!
Did you mean "rf_tbl_abcd_part_pk_1"?
LINE 3: UPDATE rf_tbl_abcd_part_pk SET a = 1
               ^

-- set PUBLISH_VIA_PARTITION_ROOT to true
-- can use column list for partitioned table
ALTER PUBLICATION testpub6 SET (PUBLISH_VIA_PARTITION_ROOT=1)
ERROR: 
-- set PUBLISH_VIA_PARTITION_ROOT to true
-- can use column list for partitioned table
ALTER PUBLICATION testpub6 SET (PUBLISH_VIA_PARTITION_ROOT=1)

Parser Error: syntax error at or near "PUBLICATION"

-- ok - can use column list for partitioned table
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_part_pk (b)
ERROR: 
-- ok - can use column list for partitioned table
ALTER PUBLICATION testpub6 SET TABLE rf_tbl_abcd_part_pk (b)

Parser Error: syntax error at or near "PUBLICATION"

-- fail - ''b'' is not in REPLICA IDENTITY INDEX
UPDATE rf_tbl_abcd_part_pk SET a = 1
ERROR: 
-- fail - ''b'' is not in REPLICA IDENTITY INDEX
UPDATE rf_tbl_abcd_part_pk SET a = 1

Catalog Error: Table with name rf_tbl_abcd_part_pk does not exist!
Did you mean "rf_tbl_abcd_part_pk_1"?
LINE 3: UPDATE rf_tbl_abcd_part_pk SET a = 1
               ^


DROP PUBLICATION testpub6
ERROR: 

DROP PUBLICATION testpub6

Not implemented Error: Cannot drop this type yet

DROP TABLE rf_tbl_abcd_pk

DROP TABLE rf_tbl_abcd_nopk

DROP TABLE rf_tbl_abcd_part_pk
ERROR: 
DROP TABLE rf_tbl_abcd_part_pk

Catalog Error: Table with name rf_tbl_abcd_part_pk does not exist!
Did you mean "rf_tbl_abcd_part_pk_1"?

-- ======================================================

-- Test cache invalidation FOR ALL TABLES publication
SET client_min_messages = 'ERROR'
ERROR: 
-- ======================================================

-- Test cache invalidation FOR ALL TABLES publication
SET client_min_messages = 'ERROR'

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE TABLE testpub_tbl4(a int)

INSERT INTO testpub_tbl4 values(1)

UPDATE testpub_tbl4 set a = 2

CREATE PUBLICATION testpub_foralltables FOR ALL TABLES
ERROR: 
CREATE PUBLICATION testpub_foralltables FOR ALL TABLES

Parser Error: syntax error at or near "PUBLICATION"

RESET client_min_messages
ERROR: 
RESET client_min_messages

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

-- fail missing REPLICA IDENTITY
UPDATE testpub_tbl4 set a = 3

DROP PUBLICATION testpub_foralltables
ERROR: 
DROP PUBLICATION testpub_foralltables

Not implemented Error: Cannot drop this type yet

-- should pass after dropping the publication
UPDATE testpub_tbl4 set a = 3

DROP TABLE testpub_tbl4


-- fail - view
CREATE PUBLICATION testpub_fortbl FOR TABLE testpub_view
ERROR: 

-- fail - view
CREATE PUBLICATION testpub_fortbl FOR TABLE testpub_view

Parser Error: syntax error at or near "PUBLICATION"


CREATE TEMPORARY TABLE testpub_temptbl(a int)

-- fail - temporary table
CREATE PUBLICATION testpub_fortemptbl FOR TABLE testpub_temptbl
ERROR: 
-- fail - temporary table
CREATE PUBLICATION testpub_fortemptbl FOR TABLE testpub_temptbl

Parser Error: syntax error at or near "PUBLICATION"

DROP TABLE testpub_temptbl


CREATE UNLOGGED TABLE testpub_unloggedtbl(a int)

-- fail - unlogged table
CREATE PUBLICATION testpub_forunloggedtbl FOR TABLE testpub_unloggedtbl
ERROR: 
-- fail - unlogged table
CREATE PUBLICATION testpub_forunloggedtbl FOR TABLE testpub_unloggedtbl

Parser Error: syntax error at or near "PUBLICATION"

DROP TABLE testpub_unloggedtbl


-- fail - system table
CREATE PUBLICATION testpub_forsystemtbl FOR TABLE pg_publication
ERROR: 

-- fail - system table
CREATE PUBLICATION testpub_forsystemtbl FOR TABLE pg_publication

Parser Error: syntax error at or near "PUBLICATION"


SET client_min_messages = 'ERROR'
ERROR: 

SET client_min_messages = 'ERROR'

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE PUBLICATION testpub_fortbl FOR TABLE testpub_tbl1, pub_test.testpub_nopk
ERROR: 
CREATE PUBLICATION testpub_fortbl FOR TABLE testpub_tbl1, pub_test.testpub_nopk

Parser Error: syntax error at or near "PUBLICATION"

RESET client_min_messages
ERROR: 
RESET client_min_messages

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

-- fail - already added
ALTER PUBLICATION testpub_fortbl ADD TABLE testpub_tbl1
ERROR: 
-- fail - already added
ALTER PUBLICATION testpub_fortbl ADD TABLE testpub_tbl1

Parser Error: syntax error at or near "PUBLICATION"

-- fail - already added
CREATE PUBLICATION testpub_fortbl FOR TABLE testpub_tbl1
ERROR: 
-- fail - already added
CREATE PUBLICATION testpub_fortbl FOR TABLE testpub_tbl1

Parser Error: syntax error at or near "PUBLICATION"


-- \dRp+ testpub_fortbl

-- fail - view
ALTER PUBLICATION testpub_default ADD TABLE testpub_view
ERROR: 

-- \dRp+ testpub_fortbl

-- fail - view
ALTER PUBLICATION testpub_default ADD TABLE testpub_view

Parser Error: syntax error at or near "PUBLICATION"


ALTER PUBLICATION testpub_default ADD TABLE testpub_tbl1
ERROR: 

ALTER PUBLICATION testpub_default ADD TABLE testpub_tbl1

Parser Error: syntax error at or near "PUBLICATION"

ALTER PUBLICATION testpub_default SET TABLE testpub_tbl1
ERROR: 
ALTER PUBLICATION testpub_default SET TABLE testpub_tbl1

Parser Error: syntax error at or near "PUBLICATION"

ALTER PUBLICATION testpub_default ADD TABLE pub_test.testpub_nopk
ERROR: 
ALTER PUBLICATION testpub_default ADD TABLE pub_test.testpub_nopk

Parser Error: syntax error at or near "PUBLICATION"


ALTER PUBLICATION testpib_ins_trunct ADD TABLE pub_test.testpub_nopk, testpub_tbl1
ERROR: 

ALTER PUBLICATION testpib_ins_trunct ADD TABLE pub_test.testpub_nopk, testpub_tbl1

Parser Error: syntax error at or near "PUBLICATION"


-- \d+ pub_test.testpub_nopk
-- \d+ testpub_tbl1
-- \dRp+ testpub_default

ALTER PUBLICATION testpub_default DROP TABLE testpub_tbl1, pub_test.testpub_nopk
ERROR: 

-- \d+ pub_test.testpub_nopk
-- \d+ testpub_tbl1
-- \dRp+ testpub_default

ALTER PUBLICATION testpub_default DROP TABLE testpub_tbl1, pub_test.testpub_nopk

Parser Error: syntax error at or near "PUBLICATION"

-- fail - nonexistent
ALTER PUBLICATION testpub_default DROP TABLE pub_test.testpub_nopk
ERROR: 
-- fail - nonexistent
ALTER PUBLICATION testpub_default DROP TABLE pub_test.testpub_nopk

Parser Error: syntax error at or near "PUBLICATION"


-- \d+ testpub_tbl1

-- verify relation cache invalidation when a primary key is added using
-- an existing index
CREATE TABLE pub_test.testpub_addpk (id int not null, data int)

ALTER PUBLICATION testpub_default ADD TABLE pub_test.testpub_addpk
ERROR: 
ALTER PUBLICATION testpub_default ADD TABLE pub_test.testpub_addpk

Parser Error: syntax error at or near "PUBLICATION"

INSERT INTO pub_test.testpub_addpk VALUES(1, 11)

CREATE UNIQUE INDEX testpub_addpk_id_idx ON pub_test.testpub_addpk(id)

-- fail:
UPDATE pub_test.testpub_addpk SET id = 2

ALTER TABLE pub_test.testpub_addpk ADD PRIMARY KEY USING INDEX testpub_addpk_id_idx
ERROR: 
ALTER TABLE pub_test.testpub_addpk ADD PRIMARY KEY USING INDEX testpub_addpk_id_idx

Not implemented Error: No support for that ALTER TABLE option yet!

-- now it should work:
UPDATE pub_test.testpub_addpk SET id = 2
ERROR: 
-- now it should work:
UPDATE pub_test.testpub_addpk SET id = 2

Constraint Error: Duplicate key "id: 2" violates unique constraint. If this is an unexpected constraint violation please double check with the known index limitations section in our documentation (https://duckdb.org/docs/sql/indexes).

DROP TABLE pub_test.testpub_addpk


-- permissions
SET ROLE regress_publication_user2
ERROR: 

-- permissions
SET ROLE regress_publication_user2

Parser Error: syntax error at or near "regress_publication_user2"

CREATE PUBLICATION testpub2
ERROR: 
CREATE PUBLICATION testpub2

Parser Error: syntax error at or near "PUBLICATION"
  -- fail

SET ROLE regress_publication_user
ERROR:   -- fail

SET ROLE regress_publication_user

Parser Error: syntax error at or near "regress_publication_user"

GRANT CREATE ON DATABASE regression TO regress_publication_user2
ERROR: 
GRANT CREATE ON DATABASE regression TO regress_publication_user2

Parser Error: syntax error at or near "GRANT"

SET ROLE regress_publication_user2
ERROR: 
SET ROLE regress_publication_user2

Parser Error: syntax error at or near "regress_publication_user2"

SET client_min_messages = 'ERROR'
ERROR: 
SET client_min_messages = 'ERROR'

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE PUBLICATION testpub2
ERROR: 
CREATE PUBLICATION testpub2

Parser Error: syntax error at or near "PUBLICATION"
  -- ok
CREATE PUBLICATION testpub3 FOR TABLES IN SCHEMA pub_test
ERROR:   -- ok
CREATE PUBLICATION testpub3 FOR TABLES IN SCHEMA pub_test

Parser Error: syntax error at or near "PUBLICATION"
  -- fail
CREATE PUBLICATION testpub3
ERROR:   -- fail
CREATE PUBLICATION testpub3

Parser Error: syntax error at or near "PUBLICATION"
  -- ok
RESET client_min_messages
ERROR:   -- ok
RESET client_min_messages

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"


ALTER PUBLICATION testpub2 ADD TABLE testpub_tbl1
ERROR: 

ALTER PUBLICATION testpub2 ADD TABLE testpub_tbl1

Parser Error: syntax error at or near "PUBLICATION"
  -- fail
ALTER PUBLICATION testpub3 ADD TABLES IN SCHEMA pub_test
ERROR:   -- fail
ALTER PUBLICATION testpub3 ADD TABLES IN SCHEMA pub_test

Parser Error: syntax error at or near "PUBLICATION"
  -- fail

SET ROLE regress_publication_user
ERROR:   -- fail

SET ROLE regress_publication_user

Parser Error: syntax error at or near "regress_publication_user"

GRANT regress_publication_user TO regress_publication_user2
ERROR: 
GRANT regress_publication_user TO regress_publication_user2

Parser Error: syntax error at or near "GRANT"

SET ROLE regress_publication_user2
ERROR: 
SET ROLE regress_publication_user2

Parser Error: syntax error at or near "regress_publication_user2"

ALTER PUBLICATION testpub2 ADD TABLE testpub_tbl1
ERROR: 
ALTER PUBLICATION testpub2 ADD TABLE testpub_tbl1

Parser Error: syntax error at or near "PUBLICATION"
  -- ok

DROP PUBLICATION testpub2
ERROR:   -- ok

DROP PUBLICATION testpub2

Not implemented Error: Cannot drop this type yet

DROP PUBLICATION testpub3
ERROR: 
DROP PUBLICATION testpub3

Not implemented Error: Cannot drop this type yet


SET ROLE regress_publication_user
ERROR: 

SET ROLE regress_publication_user

Parser Error: syntax error at or near "regress_publication_user"

CREATE ROLE regress_publication_user3
ERROR: 
CREATE ROLE regress_publication_user3

Parser Error: syntax error at or near "ROLE"

GRANT regress_publication_user2 TO regress_publication_user3
ERROR: 
GRANT regress_publication_user2 TO regress_publication_user3

Parser Error: syntax error at or near "GRANT"

SET client_min_messages = 'ERROR'
ERROR: 
SET client_min_messages = 'ERROR'

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE PUBLICATION testpub4 FOR TABLES IN SCHEMA pub_test
ERROR: 
CREATE PUBLICATION testpub4 FOR TABLES IN SCHEMA pub_test

Parser Error: syntax error at or near "PUBLICATION"

RESET client_min_messages
ERROR: 
RESET client_min_messages

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

ALTER PUBLICATION testpub4 OWNER TO regress_publication_user3
ERROR: 
ALTER PUBLICATION testpub4 OWNER TO regress_publication_user3

Parser Error: syntax error at or near "PUBLICATION"

SET ROLE regress_publication_user3
ERROR: 
SET ROLE regress_publication_user3

Parser Error: syntax error at or near "regress_publication_user3"

-- fail - new owner must be superuser
ALTER PUBLICATION testpub4 owner to regress_publication_user2
ERROR: 
-- fail - new owner must be superuser
ALTER PUBLICATION testpub4 owner to regress_publication_user2

Parser Error: syntax error at or near "PUBLICATION"
 -- fail
ALTER PUBLICATION testpub4 owner to regress_publication_user
ERROR:  -- fail
ALTER PUBLICATION testpub4 owner to regress_publication_user

Parser Error: syntax error at or near "PUBLICATION"
 -- ok

SET ROLE regress_publication_user
ERROR:  -- ok

SET ROLE regress_publication_user

Parser Error: syntax error at or near "regress_publication_user"

DROP PUBLICATION testpub4
ERROR: 
DROP PUBLICATION testpub4

Not implemented Error: Cannot drop this type yet

DROP ROLE regress_publication_user3
ERROR: 
DROP ROLE regress_publication_user3

Parser Error: syntax error at or near "ROLE"


REVOKE CREATE ON DATABASE regression FROM regress_publication_user2
ERROR: 

REVOKE CREATE ON DATABASE regression FROM regress_publication_user2

Parser Error: syntax error at or near "REVOKE"


DROP TABLE testpub_parted
ERROR: 

DROP TABLE testpub_parted

Catalog Error: Table with name testpub_parted does not exist!
Did you mean "testpub_tbl3"?

DROP TABLE testpub_tbl1
ERROR: 
DROP TABLE testpub_tbl1

Catalog Error: Table with name testpub_tbl1 does not exist!
Did you mean "testpub_tbl3"?


-- \dRp+ testpub_default

-- fail - must be owner of publication
SET ROLE regress_publication_user_dummy
ERROR: 

-- \dRp+ testpub_default

-- fail - must be owner of publication
SET ROLE regress_publication_user_dummy

Parser Error: syntax error at or near "regress_publication_user_dummy"

ALTER PUBLICATION testpub_default RENAME TO testpub_dummy
ERROR: 
ALTER PUBLICATION testpub_default RENAME TO testpub_dummy

Parser Error: syntax error at or near "PUBLICATION"

RESET ROLE
ERROR: 
RESET ROLE

Catalog Error: unrecognized configuration parameter "ROLE"

Did you mean: "threads", "Calendar", "profile_output", "errors_as_json", "home_directory"


ALTER PUBLICATION testpub_default RENAME TO testpub_foo
ERROR: 

ALTER PUBLICATION testpub_default RENAME TO testpub_foo

Parser Error: syntax error at or near "PUBLICATION"


-- \dRp testpub_foo

-- rename back to keep the rest simple
ALTER PUBLICATION testpub_foo RENAME TO testpub_default
ERROR: 

-- \dRp testpub_foo

-- rename back to keep the rest simple
ALTER PUBLICATION testpub_foo RENAME TO testpub_default

Parser Error: syntax error at or near "PUBLICATION"


ALTER PUBLICATION testpub_default OWNER TO regress_publication_user2
ERROR: 

ALTER PUBLICATION testpub_default OWNER TO regress_publication_user2

Parser Error: syntax error at or near "PUBLICATION"


-- \dRp testpub_default

-- adding schemas and tables
CREATE SCHEMA pub_test1

CREATE SCHEMA pub_test2

CREATE SCHEMA pub_test3

CREATE SCHEMA "CURRENT_SCHEMA"

CREATE TABLE pub_test1.tbl (id int, data text)

CREATE TABLE pub_test1.tbl1 (id serial primary key, data text)
ERROR: 
CREATE TABLE pub_test1.tbl1 (id serial primary key, data text)

Catalog Error: Type with name serial does not exist!
Did you mean "real"?

CREATE TABLE pub_test2.tbl1 (id serial primary key, data text)
ERROR: 
CREATE TABLE pub_test2.tbl1 (id serial primary key, data text)

Catalog Error: Type with name serial does not exist!
Did you mean "real"?

CREATE TABLE "CURRENT_SCHEMA"."CURRENT_SCHEMA"(id int)


-- suppress warning that depends on wal_level
SET client_min_messages = 'ERROR'
ERROR: 

-- suppress warning that depends on wal_level
SET client_min_messages = 'ERROR'

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE PUBLICATION testpub1_forschema FOR TABLES IN SCHEMA pub_test1
ERROR: 
CREATE PUBLICATION testpub1_forschema FOR TABLES IN SCHEMA pub_test1

Parser Error: syntax error at or near "PUBLICATION"

-- \dRp+ testpub1_forschema

CREATE PUBLICATION testpub2_forschema FOR TABLES IN SCHEMA pub_test1, pub_test2, pub_test3
ERROR: 
-- \dRp+ testpub1_forschema

CREATE PUBLICATION testpub2_forschema FOR TABLES IN SCHEMA pub_test1, pub_test2, pub_test3

Parser Error: syntax error at or near "PUBLICATION"

-- \dRp+ testpub2_forschema

-- check create publication on CURRENT_SCHEMA
CREATE PUBLICATION testpub3_forschema FOR TABLES IN SCHEMA CURRENT_SCHEMA
ERROR: 
-- \dRp+ testpub2_forschema

-- check create publication on CURRENT_SCHEMA
CREATE PUBLICATION testpub3_forschema FOR TABLES IN SCHEMA CURRENT_SCHEMA

Parser Error: syntax error at or near "PUBLICATION"

CREATE PUBLICATION testpub4_forschema FOR TABLES IN SCHEMA "CURRENT_SCHEMA"
ERROR: 
CREATE PUBLICATION testpub4_forschema FOR TABLES IN SCHEMA "CURRENT_SCHEMA"

Parser Error: syntax error at or near "PUBLICATION"

CREATE PUBLICATION testpub5_forschema FOR TABLES IN SCHEMA CURRENT_SCHEMA, "CURRENT_SCHEMA"
ERROR: 
CREATE PUBLICATION testpub5_forschema FOR TABLES IN SCHEMA CURRENT_SCHEMA, "CURRENT_SCHEMA"

Parser Error: syntax error at or near "PUBLICATION"

CREATE PUBLICATION testpub6_forschema FOR TABLES IN SCHEMA "CURRENT_SCHEMA", CURRENT_SCHEMA
ERROR: 
CREATE PUBLICATION testpub6_forschema FOR TABLES IN SCHEMA "CURRENT_SCHEMA", CURRENT_SCHEMA

Parser Error: syntax error at or near "PUBLICATION"

CREATE PUBLICATION testpub_fortable FOR TABLE "CURRENT_SCHEMA"."CURRENT_SCHEMA"
ERROR: 
CREATE PUBLICATION testpub_fortable FOR TABLE "CURRENT_SCHEMA"."CURRENT_SCHEMA"

Parser Error: syntax error at or near "PUBLICATION"


RESET client_min_messages
ERROR: 

RESET client_min_messages

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"


-- \dRp+ testpub3_forschema
-- \dRp+ testpub4_forschema
-- \dRp+ testpub5_forschema
-- \dRp+ testpub6_forschema
-- \dRp+ testpub_fortable

-- check create publication on CURRENT_SCHEMA where search_path is not set
SET SEARCH_PATH=''

CREATE PUBLICATION testpub_forschema FOR TABLES IN SCHEMA CURRENT_SCHEMA
ERROR: 
CREATE PUBLICATION testpub_forschema FOR TABLES IN SCHEMA CURRENT_SCHEMA

Parser Error: syntax error at or near "PUBLICATION"

RESET SEARCH_PATH


-- check create publication on CURRENT_SCHEMA where TABLE/TABLES in SCHEMA
-- is not specified
CREATE PUBLICATION testpub_forschema1 FOR CURRENT_SCHEMA
ERROR: 

-- check create publication on CURRENT_SCHEMA where TABLE/TABLES in SCHEMA
-- is not specified
CREATE PUBLICATION testpub_forschema1 FOR CURRENT_SCHEMA

Parser Error: syntax error at or near "PUBLICATION"


-- check create publication on CURRENT_SCHEMA along with FOR TABLE
CREATE PUBLICATION testpub_forschema1 FOR TABLE CURRENT_SCHEMA
ERROR: 

-- check create publication on CURRENT_SCHEMA along with FOR TABLE
CREATE PUBLICATION testpub_forschema1 FOR TABLE CURRENT_SCHEMA

Parser Error: syntax error at or near "PUBLICATION"


-- check create publication on a schema that does not exist
CREATE PUBLICATION testpub_forschema FOR TABLES IN SCHEMA non_existent_schema
ERROR: 

-- check create publication on a schema that does not exist
CREATE PUBLICATION testpub_forschema FOR TABLES IN SCHEMA non_existent_schema

Parser Error: syntax error at or near "PUBLICATION"


-- check create publication on a system schema
CREATE PUBLICATION testpub_forschema FOR TABLES IN SCHEMA pg_catalog
ERROR: 

-- check create publication on a system schema
CREATE PUBLICATION testpub_forschema FOR TABLES IN SCHEMA pg_catalog

Parser Error: syntax error at or near "PUBLICATION"


-- check create publication on an object which is not schema
CREATE PUBLICATION testpub1_forschema1 FOR TABLES IN SCHEMA testpub_view
ERROR: 

-- check create publication on an object which is not schema
CREATE PUBLICATION testpub1_forschema1 FOR TABLES IN SCHEMA testpub_view

Parser Error: syntax error at or near "PUBLICATION"


-- dropping the schema should reflect the change in publication
DROP SCHEMA pub_test3

-- \dRp+ testpub2_forschema

-- renaming the schema should reflect the change in publication
ALTER SCHEMA pub_test1 RENAME to pub_test1_renamed
ERROR: 
-- \dRp+ testpub2_forschema

-- renaming the schema should reflect the change in publication
ALTER SCHEMA pub_test1 RENAME to pub_test1_renamed

Not implemented Error: Altering schemas is not yet supported

-- \dRp+ testpub2_forschema

ALTER SCHEMA pub_test1_renamed RENAME to pub_test1
ERROR: 
-- \dRp+ testpub2_forschema

ALTER SCHEMA pub_test1_renamed RENAME to pub_test1

Not implemented Error: Altering schemas is not yet supported

-- \dRp+ testpub2_forschema

-- alter publication add schema
ALTER PUBLICATION testpub1_forschema ADD TABLES IN SCHEMA pub_test2
ERROR: 
-- \dRp+ testpub2_forschema

-- alter publication add schema
ALTER PUBLICATION testpub1_forschema ADD TABLES IN SCHEMA pub_test2

Parser Error: syntax error at or near "PUBLICATION"

-- \dRp+ testpub1_forschema

-- add non existent schema
ALTER PUBLICATION testpub1_forschema ADD TABLES IN SCHEMA non_existent_schema
ERROR: 
-- \dRp+ testpub1_forschema

-- add non existent schema
ALTER PUBLICATION testpub1_forschema ADD TABLES IN SCHEMA non_existent_schema

Parser Error: syntax error at or near "PUBLICATION"

-- \dRp+ testpub1_forschema

-- add a schema which is already added to the publication
ALTER PUBLICATION testpub1_forschema ADD TABLES IN SCHEMA pub_test1
ERROR: 
-- \dRp+ testpub1_forschema

-- add a schema which is already added to the publication
ALTER PUBLICATION testpub1_forschema ADD TABLES IN SCHEMA pub_test1

Parser Error: syntax error at or near "PUBLICATION"

-- \dRp+ testpub1_forschema

-- alter publication drop schema
ALTER PUBLICATION testpub1_forschema DROP TABLES IN SCHEMA pub_test2
ERROR: 
-- \dRp+ testpub1_forschema

-- alter publication drop schema
ALTER PUBLICATION testpub1_forschema DROP TABLES IN SCHEMA pub_test2

Parser Error: syntax error at or near "PUBLICATION"

-- \dRp+ testpub1_forschema

-- drop schema that is not present in the publication
ALTER PUBLICATION testpub1_forschema DROP TABLES IN SCHEMA pub_test2
ERROR: 
-- \dRp+ testpub1_forschema

-- drop schema that is not present in the publication
ALTER PUBLICATION testpub1_forschema DROP TABLES IN SCHEMA pub_test2

Parser Error: syntax error at or near "PUBLICATION"

-- \dRp+ testpub1_forschema

-- drop a schema that does not exist in the system
ALTER PUBLICATION testpub1_forschema DROP TABLES IN SCHEMA non_existent_schema
ERROR: 
-- \dRp+ testpub1_forschema

-- drop a schema that does not exist in the system
ALTER PUBLICATION testpub1_forschema DROP TABLES IN SCHEMA non_existent_schema

Parser Error: syntax error at or near "PUBLICATION"

-- \dRp+ testpub1_forschema

-- drop all schemas
ALTER PUBLICATION testpub1_forschema DROP TABLES IN SCHEMA pub_test1
ERROR: 
-- \dRp+ testpub1_forschema

-- drop all schemas
ALTER PUBLICATION testpub1_forschema DROP TABLES IN SCHEMA pub_test1

Parser Error: syntax error at or near "PUBLICATION"

-- \dRp+ testpub1_forschema

-- alter publication set multiple schema
ALTER PUBLICATION testpub1_forschema SET TABLES IN SCHEMA pub_test1, pub_test2
ERROR: 
-- \dRp+ testpub1_forschema

-- alter publication set multiple schema
ALTER PUBLICATION testpub1_forschema SET TABLES IN SCHEMA pub_test1, pub_test2

Parser Error: syntax error at or near "PUBLICATION"

-- \dRp+ testpub1_forschema

-- alter publication set non-existent schema
ALTER PUBLICATION testpub1_forschema SET TABLES IN SCHEMA non_existent_schema
ERROR: 
-- \dRp+ testpub1_forschema

-- alter publication set non-existent schema
ALTER PUBLICATION testpub1_forschema SET TABLES IN SCHEMA non_existent_schema

Parser Error: syntax error at or near "PUBLICATION"

-- \dRp+ testpub1_forschema

-- alter publication set it duplicate schemas should set the schemas after
-- removing the duplicate schemas
ALTER PUBLICATION testpub1_forschema SET TABLES IN SCHEMA pub_test1, pub_test1
ERROR: 
-- \dRp+ testpub1_forschema

-- alter publication set it duplicate schemas should set the schemas after
-- removing the duplicate schemas
ALTER PUBLICATION testpub1_forschema SET TABLES IN SCHEMA pub_test1, pub_test1

Parser Error: syntax error at or near "PUBLICATION"

-- \dRp+ testpub1_forschema

-- Verify that it fails to add a schema with a column specification
ALTER PUBLICATION testpub1_forschema ADD TABLES IN SCHEMA foo (a, b)
ERROR: 
-- \dRp+ testpub1_forschema

-- Verify that it fails to add a schema with a column specification
ALTER PUBLICATION testpub1_forschema ADD TABLES IN SCHEMA foo (a, b)

Parser Error: syntax error at or near "PUBLICATION"

ALTER PUBLICATION testpub1_forschema ADD TABLES IN SCHEMA foo, bar (a, b)
ERROR: 
ALTER PUBLICATION testpub1_forschema ADD TABLES IN SCHEMA foo, bar (a, b)

Parser Error: syntax error at or near "PUBLICATION"


-- cleanup pub_test1 schema for invalidation tests
ALTER PUBLICATION testpub2_forschema DROP TABLES IN SCHEMA pub_test1
ERROR: 

-- cleanup pub_test1 schema for invalidation tests
ALTER PUBLICATION testpub2_forschema DROP TABLES IN SCHEMA pub_test1

Parser Error: syntax error at or near "PUBLICATION"

DROP PUBLICATION testpub3_forschema, testpub4_forschema, testpub5_forschema, testpub6_forschema, testpub_fortable
ERROR: 
DROP PUBLICATION testpub3_forschema, testpub4_forschema, testpub5_forschema, testpub6_forschema, testpub_fortable

Not implemented Error: Can only drop one object at a time

DROP SCHEMA "CURRENT_SCHEMA" CASCADE


-- verify relation cache invalidations through update statement for the
-- default REPLICA IDENTITY on the relation, if schema is part of the
-- publication then update will fail because relation''s relreplident
-- option will be set, if schema is not part of the publication then update
-- will be successful.
INSERT INTO pub_test1.tbl VALUES(1, 'test')


-- fail
UPDATE pub_test1.tbl SET id = 2

ALTER PUBLICATION testpub1_forschema DROP TABLES IN SCHEMA pub_test1
ERROR: 
ALTER PUBLICATION testpub1_forschema DROP TABLES IN SCHEMA pub_test1

Parser Error: syntax error at or near "PUBLICATION"


-- success
UPDATE pub_test1.tbl SET id = 2

ALTER PUBLICATION testpub1_forschema SET TABLES IN SCHEMA pub_test1
ERROR: 
ALTER PUBLICATION testpub1_forschema SET TABLES IN SCHEMA pub_test1

Parser Error: syntax error at or near "PUBLICATION"


-- fail
UPDATE pub_test1.tbl SET id = 2


-- verify invalidation of partition table having parent and child tables in
-- different schema
CREATE SCHEMA pub_testpart1

CREATE SCHEMA pub_testpart2


CREATE TABLE pub_testpart1.parent1 (a int) partition by list (a)
ERROR: 

CREATE TABLE pub_testpart1.parent1 (a int) partition by list (a)

Parser Error: syntax error at or near "partition"

CREATE TABLE pub_testpart2.child_parent1 partition of pub_testpart1.parent1 for values in (1)
ERROR: 
CREATE TABLE pub_testpart2.child_parent1 partition of pub_testpart1.parent1 for values in (1)

Parser Error: syntax error at or near "partition"

INSERT INTO pub_testpart2.child_parent1 values(1)
ERROR: 
INSERT INTO pub_testpart2.child_parent1 values(1)

Catalog Error: Table with name child_parent1 does not exist!
Did you mean "memory.CHAR_TBL"?

UPDATE pub_testpart2.child_parent1 set a = 1
ERROR: 
UPDATE pub_testpart2.child_parent1 set a = 1

Catalog Error: Table with name child_parent1 does not exist!
Did you mean "memory.CHAR_TBL"?
LINE 2: UPDATE pub_testpart2.child_parent1 set a = 1
               ^

SET client_min_messages = 'ERROR'
ERROR: 
SET client_min_messages = 'ERROR'

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE PUBLICATION testpubpart_forschema FOR TABLES IN SCHEMA pub_testpart1
ERROR: 
CREATE PUBLICATION testpubpart_forschema FOR TABLES IN SCHEMA pub_testpart1

Parser Error: syntax error at or near "PUBLICATION"

RESET client_min_messages
ERROR: 
RESET client_min_messages

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"


-- fail
UPDATE pub_testpart1.parent1 set a = 1
ERROR: 

-- fail
UPDATE pub_testpart1.parent1 set a = 1

Catalog Error: Table with name parent1 does not exist!
Did you mean "temp.pg_catalog.pg_am"?
LINE 4: UPDATE pub_testpart1.parent1 set a = 1
               ^

UPDATE pub_testpart2.child_parent1 set a = 1
ERROR: 
UPDATE pub_testpart2.child_parent1 set a = 1

Catalog Error: Table with name child_parent1 does not exist!
Did you mean "memory.CHAR_TBL"?
LINE 2: UPDATE pub_testpart2.child_parent1 set a = 1
               ^


DROP PUBLICATION testpubpart_forschema
ERROR: 

DROP PUBLICATION testpubpart_forschema

Not implemented Error: Cannot drop this type yet


-- verify invalidation of partition tables for schema publication that has
-- parent and child tables of different partition hierarchies
CREATE TABLE pub_testpart2.parent2 (a int) partition by list (a)
ERROR: 

-- verify invalidation of partition tables for schema publication that has
-- parent and child tables of different partition hierarchies
CREATE TABLE pub_testpart2.parent2 (a int) partition by list (a)

Parser Error: syntax error at or near "partition"

CREATE TABLE pub_testpart1.child_parent2 partition of pub_testpart2.parent2 for values in (1)
ERROR: 
CREATE TABLE pub_testpart1.child_parent2 partition of pub_testpart2.parent2 for values in (1)

Parser Error: syntax error at or near "partition"

INSERT INTO pub_testpart1.child_parent2 values(1)
ERROR: 
INSERT INTO pub_testpart1.child_parent2 values(1)

Catalog Error: Table with name child_parent2 does not exist!
Did you mean "memory.CHAR_TBL"?

UPDATE pub_testpart1.child_parent2 set a = 1
ERROR: 
UPDATE pub_testpart1.child_parent2 set a = 1

Catalog Error: Table with name child_parent2 does not exist!
Did you mean "memory.CHAR_TBL"?
LINE 2: UPDATE pub_testpart1.child_parent2 set a = 1
               ^

SET client_min_messages = 'ERROR'
ERROR: 
SET client_min_messages = 'ERROR'

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE PUBLICATION testpubpart_forschema FOR TABLES IN SCHEMA pub_testpart2
ERROR: 
CREATE PUBLICATION testpubpart_forschema FOR TABLES IN SCHEMA pub_testpart2

Parser Error: syntax error at or near "PUBLICATION"

RESET client_min_messages
ERROR: 
RESET client_min_messages

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"


-- fail
UPDATE pub_testpart2.child_parent1 set a = 1
ERROR: 

-- fail
UPDATE pub_testpart2.child_parent1 set a = 1

Catalog Error: Table with name child_parent1 does not exist!
Did you mean "memory.CHAR_TBL"?
LINE 4: UPDATE pub_testpart2.child_parent1 set a = 1
               ^

UPDATE pub_testpart2.parent2 set a = 1
ERROR: 
UPDATE pub_testpart2.parent2 set a = 1

Catalog Error: Table with name parent2 does not exist!
Did you mean "temp.pg_catalog.pg_am"?
LINE 2: UPDATE pub_testpart2.parent2 set a = 1
               ^

UPDATE pub_testpart1.child_parent2 set a = 1
ERROR: 
UPDATE pub_testpart1.child_parent2 set a = 1

Catalog Error: Table with name child_parent2 does not exist!
Did you mean "memory.CHAR_TBL"?
LINE 2: UPDATE pub_testpart1.child_parent2 set a = 1
               ^


-- alter publication set ''TABLES IN SCHEMA'' on an empty publication.
SET client_min_messages = 'ERROR'
ERROR: 

-- alter publication set ''TABLES IN SCHEMA'' on an empty publication.
SET client_min_messages = 'ERROR'

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE PUBLICATION testpub3_forschema
ERROR: 
CREATE PUBLICATION testpub3_forschema

Parser Error: syntax error at or near "PUBLICATION"

RESET client_min_messages
ERROR: 
RESET client_min_messages

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

-- \dRp+ testpub3_forschema
ALTER PUBLICATION testpub3_forschema SET TABLES IN SCHEMA pub_test1
ERROR: 
-- \dRp+ testpub3_forschema
ALTER PUBLICATION testpub3_forschema SET TABLES IN SCHEMA pub_test1

Parser Error: syntax error at or near "PUBLICATION"

-- \dRp+ testpub3_forschema

-- create publication including both ''FOR TABLE'' and ''FOR TABLES IN SCHEMA''
SET client_min_messages = 'ERROR'
ERROR: 
-- \dRp+ testpub3_forschema

-- create publication including both ''FOR TABLE'' and ''FOR TABLES IN SCHEMA''
SET client_min_messages = 'ERROR'

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE PUBLICATION testpub_forschema_fortable FOR TABLES IN SCHEMA pub_test1, TABLE pub_test2.tbl1
ERROR: 
CREATE PUBLICATION testpub_forschema_fortable FOR TABLES IN SCHEMA pub_test1, TABLE pub_test2.tbl1

Parser Error: syntax error at or near "PUBLICATION"

CREATE PUBLICATION testpub_fortable_forschema FOR TABLE pub_test2.tbl1, TABLES IN SCHEMA pub_test1
ERROR: 
CREATE PUBLICATION testpub_fortable_forschema FOR TABLE pub_test2.tbl1, TABLES IN SCHEMA pub_test1

Parser Error: syntax error at or near "PUBLICATION"

RESET client_min_messages
ERROR: 
RESET client_min_messages

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"


-- \dRp+ testpub_forschema_fortable
-- \dRp+ testpub_fortable_forschema

-- fail specifying table without any of ''FOR TABLES IN SCHEMA'' or
--''FOR TABLE'' or ''FOR ALL TABLES''
CREATE PUBLICATION testpub_error FOR pub_test2.tbl1
ERROR: 

-- \dRp+ testpub_forschema_fortable
-- \dRp+ testpub_fortable_forschema

-- fail specifying table without any of ''FOR TABLES IN SCHEMA'' or
--''FOR TABLE'' or ''FOR ALL TABLES''
CREATE PUBLICATION testpub_error FOR pub_test2.tbl1

Parser Error: syntax error at or near "PUBLICATION"


DROP VIEW testpub_view


DROP PUBLICATION testpub_default
ERROR: 

DROP PUBLICATION testpub_default

Not implemented Error: Cannot drop this type yet

DROP PUBLICATION testpib_ins_trunct
ERROR: 
DROP PUBLICATION testpib_ins_trunct

Not implemented Error: Cannot drop this type yet

DROP PUBLICATION testpub_fortbl
ERROR: 
DROP PUBLICATION testpub_fortbl

Not implemented Error: Cannot drop this type yet

DROP PUBLICATION testpub1_forschema
ERROR: 
DROP PUBLICATION testpub1_forschema

Not implemented Error: Cannot drop this type yet

DROP PUBLICATION testpub2_forschema
ERROR: 
DROP PUBLICATION testpub2_forschema

Not implemented Error: Cannot drop this type yet

DROP PUBLICATION testpub3_forschema
ERROR: 
DROP PUBLICATION testpub3_forschema

Not implemented Error: Cannot drop this type yet

DROP PUBLICATION testpub_forschema_fortable
ERROR: 
DROP PUBLICATION testpub_forschema_fortable

Not implemented Error: Cannot drop this type yet

DROP PUBLICATION testpub_fortable_forschema
ERROR: 
DROP PUBLICATION testpub_fortable_forschema

Not implemented Error: Cannot drop this type yet

DROP PUBLICATION testpubpart_forschema
ERROR: 
DROP PUBLICATION testpubpart_forschema

Not implemented Error: Cannot drop this type yet


DROP SCHEMA pub_test CASCADE

DROP SCHEMA pub_test1 CASCADE

DROP SCHEMA pub_test2 CASCADE

DROP SCHEMA pub_testpart1 CASCADE

DROP SCHEMA pub_testpart2 CASCADE


-- Test the list of partitions published with or without
-- ''PUBLISH_VIA_PARTITION_ROOT'' parameter
SET client_min_messages = 'ERROR'
ERROR: 

-- Test the list of partitions published with or without
-- ''PUBLISH_VIA_PARTITION_ROOT'' parameter
SET client_min_messages = 'ERROR'

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

CREATE SCHEMA sch1

CREATE SCHEMA sch2

CREATE TABLE sch1.tbl1 (a int) PARTITION BY RANGE(a)
ERROR: 
CREATE TABLE sch1.tbl1 (a int) PARTITION BY RANGE(a)

Parser Error: syntax error at or near "PARTITION"

CREATE TABLE sch2.tbl1_part1 PARTITION OF sch1.tbl1 FOR VALUES FROM (1) to (10)
ERROR: 
CREATE TABLE sch2.tbl1_part1 PARTITION OF sch1.tbl1 FOR VALUES FROM (1) to (10)

Parser Error: syntax error at or near "PARTITION"

-- Schema publication that does not include the schema that has the parent table
CREATE PUBLICATION pub FOR TABLES IN SCHEMA sch2 WITH (PUBLISH_VIA_PARTITION_ROOT=1)
ERROR: 
-- Schema publication that does not include the schema that has the parent table
CREATE PUBLICATION pub FOR TABLES IN SCHEMA sch2 WITH (PUBLISH_VIA_PARTITION_ROOT=1)

Parser Error: syntax error at or near "PUBLICATION"

SELECT * FROM pg_publication_tables
ERROR: 
SELECT * FROM pg_publication_tables

Catalog Error: Table with name pg_publication_tables does not exist!
Did you mean "pg_tables"?


DROP PUBLICATION pub
ERROR: 

DROP PUBLICATION pub

Not implemented Error: Cannot drop this type yet

-- Table publication that does not include the parent table
CREATE PUBLICATION pub FOR TABLE sch2.tbl1_part1 WITH (PUBLISH_VIA_PARTITION_ROOT=1)
ERROR: 
-- Table publication that does not include the parent table
CREATE PUBLICATION pub FOR TABLE sch2.tbl1_part1 WITH (PUBLISH_VIA_PARTITION_ROOT=1)

Parser Error: syntax error at or near "PUBLICATION"

SELECT * FROM pg_publication_tables
ERROR: 
SELECT * FROM pg_publication_tables

Catalog Error: Table with name pg_publication_tables does not exist!
Did you mean "pg_tables"?


-- Table publication that includes both the parent table and the child table
ALTER PUBLICATION pub ADD TABLE sch1.tbl1
ERROR: 

-- Table publication that includes both the parent table and the child table
ALTER PUBLICATION pub ADD TABLE sch1.tbl1

Parser Error: syntax error at or near "PUBLICATION"

SELECT * FROM pg_publication_tables
ERROR: 
SELECT * FROM pg_publication_tables

Catalog Error: Table with name pg_publication_tables does not exist!
Did you mean "pg_tables"?


DROP PUBLICATION pub
ERROR: 

DROP PUBLICATION pub

Not implemented Error: Cannot drop this type yet

-- Schema publication that does not include the schema that has the parent table
CREATE PUBLICATION pub FOR TABLES IN SCHEMA sch2 WITH (PUBLISH_VIA_PARTITION_ROOT=0)
ERROR: 
-- Schema publication that does not include the schema that has the parent table
CREATE PUBLICATION pub FOR TABLES IN SCHEMA sch2 WITH (PUBLISH_VIA_PARTITION_ROOT=0)

Parser Error: syntax error at or near "PUBLICATION"

SELECT * FROM pg_publication_tables
ERROR: 
SELECT * FROM pg_publication_tables

Catalog Error: Table with name pg_publication_tables does not exist!
Did you mean "pg_tables"?


DROP PUBLICATION pub
ERROR: 

DROP PUBLICATION pub

Not implemented Error: Cannot drop this type yet

-- Table publication that does not include the parent table
CREATE PUBLICATION pub FOR TABLE sch2.tbl1_part1 WITH (PUBLISH_VIA_PARTITION_ROOT=0)
ERROR: 
-- Table publication that does not include the parent table
CREATE PUBLICATION pub FOR TABLE sch2.tbl1_part1 WITH (PUBLISH_VIA_PARTITION_ROOT=0)

Parser Error: syntax error at or near "PUBLICATION"

SELECT * FROM pg_publication_tables
ERROR: 
SELECT * FROM pg_publication_tables

Catalog Error: Table with name pg_publication_tables does not exist!
Did you mean "pg_tables"?


-- Table publication that includes both the parent table and the child table
ALTER PUBLICATION pub ADD TABLE sch1.tbl1
ERROR: 

-- Table publication that includes both the parent table and the child table
ALTER PUBLICATION pub ADD TABLE sch1.tbl1

Parser Error: syntax error at or near "PUBLICATION"

SELECT * FROM pg_publication_tables
ERROR: 
SELECT * FROM pg_publication_tables

Catalog Error: Table with name pg_publication_tables does not exist!
Did you mean "pg_tables"?


DROP PUBLICATION pub
ERROR: 

DROP PUBLICATION pub

Not implemented Error: Cannot drop this type yet

DROP TABLE sch2.tbl1_part1
ERROR: 
DROP TABLE sch2.tbl1_part1

Catalog Error: Table with name tbl1_part1 does not exist!
Did you mean "system.information_schema.tables"?

DROP TABLE sch1.tbl1
ERROR: 
DROP TABLE sch1.tbl1

Catalog Error: Table with name tbl1 does not exist!
Did you mean "system.information_schema.tables"?


CREATE TABLE sch1.tbl1 (a int) PARTITION BY RANGE(a)
ERROR: 

CREATE TABLE sch1.tbl1 (a int) PARTITION BY RANGE(a)

Parser Error: syntax error at or near "PARTITION"

CREATE TABLE sch1.tbl1_part1 PARTITION OF sch1.tbl1 FOR VALUES FROM (1) to (10)
ERROR: 
CREATE TABLE sch1.tbl1_part1 PARTITION OF sch1.tbl1 FOR VALUES FROM (1) to (10)

Parser Error: syntax error at or near "PARTITION"

CREATE TABLE sch1.tbl1_part2 PARTITION OF sch1.tbl1 FOR VALUES FROM (10) to (20)
ERROR: 
CREATE TABLE sch1.tbl1_part2 PARTITION OF sch1.tbl1 FOR VALUES FROM (10) to (20)

Parser Error: syntax error at or near "PARTITION"

CREATE TABLE sch1.tbl1_part3 (a int) PARTITION BY RANGE(a)
ERROR: 
CREATE TABLE sch1.tbl1_part3 (a int) PARTITION BY RANGE(a)

Parser Error: syntax error at or near "PARTITION"

ALTER TABLE sch1.tbl1 ATTACH PARTITION sch1.tbl1_part3 FOR VALUES FROM (20) to (30)
ERROR: 
ALTER TABLE sch1.tbl1 ATTACH PARTITION sch1.tbl1_part3 FOR VALUES FROM (20) to (30)

Parser Error: syntax error at or near "ATTACH"

CREATE PUBLICATION pub FOR TABLES IN SCHEMA sch1 WITH (PUBLISH_VIA_PARTITION_ROOT=1)
ERROR: 
CREATE PUBLICATION pub FOR TABLES IN SCHEMA sch1 WITH (PUBLISH_VIA_PARTITION_ROOT=1)

Parser Error: syntax error at or near "PUBLICATION"

SELECT * FROM pg_publication_tables
ERROR: 
SELECT * FROM pg_publication_tables

Catalog Error: Table with name pg_publication_tables does not exist!
Did you mean "pg_tables"?


RESET client_min_messages
ERROR: 

RESET client_min_messages

Catalog Error: unrecognized configuration parameter "client_min_messages"

Did you mean: "schema"

DROP PUBLICATION pub
ERROR: 
DROP PUBLICATION pub

Not implemented Error: Cannot drop this type yet

DROP TABLE sch1.tbl1
ERROR: 
DROP TABLE sch1.tbl1

Catalog Error: Table with name tbl1 does not exist!
Did you mean "system.information_schema.tables"?

DROP SCHEMA sch1 cascade

DROP SCHEMA sch2 cascade


RESET SESSION AUTHORIZATION
ERROR: 

RESET SESSION AUTHORIZATION

Parser Error: syntax error at or near "AUTHORIZATION"

DROP ROLE regress_publication_user, regress_publication_user2
ERROR: 
DROP ROLE regress_publication_user, regress_publication_user2

Parser Error: syntax error at or near "ROLE"

DROP ROLE regress_publication_user_dummy
ERROR: 
DROP ROLE regress_publication_user_dummy

Parser Error: syntax error at or near "ROLE"


