
-----------
QUERY:
-- Tests for range data types.

--
-- test input parser
-- (type textrange was already made in test_setup.sql)
--

-- negative tests /* REPLACED */, should fail
select ''::textrange;
RESULT:
	postgres: malformed range literal: ""
LINE 9: select ''::textrange;
               ^
DETAIL:  Missing left parenthesis or bracket.


-----------
QUERY:

select '-[a,z)'::textrange;
RESULT:
	postgres: malformed range literal: "-[a,z)"
LINE 2: select '-[a,z)'::textrange;
               ^
DETAIL:  Missing left parenthesis or bracket.


-----------
QUERY:

select '[a,z) - '::textrange;
RESULT:
	postgres: malformed range literal: "[a,z) - "
LINE 2: select '[a,z) - '::textrange;
               ^
DETAIL:  Junk after right parenthesis or bracket.


-----------
QUERY:

select '(",a)'::textrange;
RESULT:
	postgres: malformed range literal: "(",a)"
LINE 2: select '(",a)'::textrange;
               ^
DETAIL:  Unexpected end of input.


-----------
QUERY:

select '(,,a)'::textrange;
RESULT:
	postgres: malformed range literal: "(,,a)"
LINE 2: select '(,,a)'::textrange;
               ^
DETAIL:  Too many commas.


-----------
QUERY:

select '(),a)'::textrange;
RESULT:
	postgres: malformed range literal: "(),a)"
LINE 2: select '(),a)'::textrange;
               ^
DETAIL:  Missing comma after lower bound.


-----------
QUERY:

select '(a,))'::textrange;
RESULT:
	postgres: malformed range literal: "(a,))"
LINE 2: select '(a,))'::textrange;
               ^
DETAIL:  Junk after right parenthesis or bracket.


-----------
QUERY:

select '(],a)'::textrange;
RESULT:
	postgres: malformed range literal: "(],a)"
LINE 2: select '(],a)'::textrange;
               ^
DETAIL:  Missing comma after lower bound.


-----------
QUERY:

select '(a,])'::textrange;
RESULT:
	postgres: malformed range literal: "(a,])"
LINE 2: select '(a,])'::textrange;
               ^
DETAIL:  Junk after right parenthesis or bracket.


-----------
QUERY:

select '[z,a]'::textrange;
RESULT:
	postgres: range lower bound must be less than or equal to range upper bound
LINE 2: select '[z,a]'::textrange;
               ^


-----------
QUERY:


-- should succeed
select '  empty  '::textrange;
RESULT:
	postgres: [('empty',)]

-----------
QUERY:

select ' ( empty, empty )  '::textrange;
RESULT:
	postgres: [('(" empty"," empty ")',)]

-----------
QUERY:

select ' ( " a " " a ", " z " " z " )  '::textrange;
RESULT:
	postgres: [('("  a   a ","  z   z  ")',)]

-----------
QUERY:

select '(a,)'::textrange;
RESULT:
	postgres: [('(a,)',)]

-----------
QUERY:

select '[,z]'::textrange;
RESULT:
	postgres: [('(,z]',)]

-----------
QUERY:

select '[a,]'::textrange;
RESULT:
	postgres: [('[a,)',)]

-----------
QUERY:

select '(,)'::textrange;
RESULT:
	postgres: [('(,)',)]

-----------
QUERY:

select '[ , ]'::textrange;
RESULT:
	postgres: [('[" "," "]',)]

-----------
QUERY:

select '["",""]'::textrange;
RESULT:
	postgres: [('["",""]',)]

-----------
QUERY:

select '[",",","]'::textrange;
RESULT:
	postgres: [('[",",","]',)]

-----------
QUERY:

select '["\\","\\"]'::textrange;
RESULT:
	postgres: [('["\\\\","\\\\"]',)]

-----------
QUERY:

select '(\\,a)'::textrange;
RESULT:
	postgres: [('("\\\\",a)',)]

-----------
QUERY:

select '((,z)'::textrange;
RESULT:
	postgres: [('("(",z)',)]

-----------
QUERY:

select '([,z)'::textrange;
RESULT:
	postgres: [('("[",z)',)]

-----------
QUERY:

select '(!,()'::textrange;
RESULT:
	postgres: [('(!,"(")',)]

-----------
QUERY:

select '(!,[)'::textrange;
RESULT:
	postgres: [('(!,"[")',)]

-----------
QUERY:

select '[a,a]'::textrange;
RESULT:
	postgres: [('[a,a]',)]

-----------
QUERY:

-- these are allowed but normalize to empty:
select '[a,a)'::textrange;
RESULT:
	postgres: [('empty',)]

-----------
QUERY:

select '(a,a]'::textrange;
RESULT:
	postgres: [('empty',)]

-----------
QUERY:

select '(a,a)'::textrange;
RESULT:
	postgres: [('empty',)]

-----------
QUERY:


-- Also try it with non-error-throwing API
select pg_input_is_valid('(1,4)', 'int4range');
RESULT:
	postgres: [(True,)]

-----------
QUERY:

select pg_input_is_valid('(1,4', 'int4range');
RESULT:
	postgres: [(False,)]

-----------
QUERY:

select * from pg_input_error_info('(1,4', 'int4range');
RESULT:
	postgres: [('malformed range literal: "(1,4"', 'Unexpected end of input.', None, '22P02')]

-----------
QUERY:

select pg_input_is_valid('(4,1)', 'int4range');
RESULT:
	postgres: [(False,)]

-----------
QUERY:

select * from pg_input_error_info('(4,1)', 'int4range');
RESULT:
	postgres: [('range lower bound must be less than or equal to range upper bound', None, None, '22000')]

-----------
QUERY:

select pg_input_is_valid('(4,zed)', 'int4range');
RESULT:
	postgres: [(False,)]

-----------
QUERY:

select * from pg_input_error_info('(4,zed)', 'int4range');
RESULT:
	postgres: [('invalid input syntax for type integer: "zed"', None, None, '22P02')]

-----------
QUERY:

select pg_input_is_valid('[1,2147483647]', 'int4range');
RESULT:
	postgres: [(False,)]

-----------
QUERY:

select * from pg_input_error_info('[1,2147483647]', 'int4range');
RESULT:
	postgres: [('integer out of range', None, None, '22003')]

-----------
QUERY:

select pg_input_is_valid('[2000-01-01,5874897-12-31]', 'daterange');
RESULT:
	postgres: [(False,)]

-----------
QUERY:

select * from pg_input_error_info('[2000-01-01,5874897-12-31]', 'daterange');
RESULT:
	postgres: [('date out of range', None, None, '22008')]

-----------
QUERY:


--
-- create some test data and test the operators
--

CREATE TABLE numrange_test (nr NUMRANGE);
RESULT:
	postgres: None

-----------
QUERY:

create index numrange_test_btree on numrange_test(nr);
RESULT:
	postgres: None

-----------
QUERY:


INSERT INTO numrange_test VALUES('[,)');
RESULT:
	postgres: None

-----------
QUERY:

INSERT INTO numrange_test VALUES('[3,]');
RESULT:
	postgres: None

-----------
QUERY:

INSERT INTO numrange_test VALUES('[, 5)');
RESULT:
	postgres: None

-----------
QUERY:

INSERT INTO numrange_test VALUES(numrange(1.1, 2.2));
RESULT:
	postgres: None

-----------
QUERY:

INSERT INTO numrange_test VALUES('empty');
RESULT:
	postgres: None

-----------
QUERY:

INSERT INTO numrange_test VALUES(numrange(1.7, 1.7, '[]'));
RESULT:
	postgres: None

-----------
QUERY:


SELECT nr, isempty(nr), lower(nr), upper(nr) FROM numrange_test;
RESULT:
	postgres: [(NumericRange(None, None, '()'), False, None, None), (NumericRange(Decimal('3'), None, '[)'), False, Decimal('3'), None), (NumericRange(None, Decimal('5'), '()'), False, None, Decimal('5')), (NumericRange(Decimal('1.1'), Decimal('2.2'), '[)'), False, Decimal('1.1'), Decimal('2.2')), (NumericRange(empty=True), True, None, None), (NumericRange(Decimal('1.7'), Decimal('1.7'), '[]'), False, Decimal('1.7'), Decimal('1.7'))]

-----------
QUERY:

SELECT nr, lower_inc(nr), lower_inf(nr), upper_inc(nr), upper_inf(nr) FROM numrange_test;
RESULT:
	postgres: [(NumericRange(None, None, '()'), False, True, False, True), (NumericRange(Decimal('3'), None, '[)'), True, False, False, True), (NumericRange(None, Decimal('5'), '()'), False, True, False, False), (NumericRange(Decimal('1.1'), Decimal('2.2'), '[)'), True, False, False, False), (NumericRange(empty=True), False, False, False, False), (NumericRange(Decimal('1.7'), Decimal('1.7'), '[]'), True, False, True, False)]

-----------
QUERY:


SELECT * FROM numrange_test WHERE range_contains(nr, numrange(1.9,1.91));
RESULT:
	postgres: [(NumericRange(None, None, '()'),), (NumericRange(None, Decimal('5'), '()'),), (NumericRange(Decimal('1.1'), Decimal('2.2'), '[)'),)]

-----------
QUERY:

SELECT * FROM numrange_test WHERE nr @> numrange(1.0,10000.1);
RESULT:
	postgres: [(NumericRange(None, None, '()'),)]

-----------
QUERY:

SELECT * FROM numrange_test WHERE range_contained_by(numrange(-1e7,-10000.1), nr);
RESULT:
	postgres: [(NumericRange(None, None, '()'),), (NumericRange(None, Decimal('5'), '()'),)]

-----------
QUERY:

SELECT * FROM numrange_test WHERE 1.9 <@ nr;
RESULT:
	postgres: [(NumericRange(None, None, '()'),), (NumericRange(None, Decimal('5'), '()'),), (NumericRange(Decimal('1.1'), Decimal('2.2'), '[)'),)]

-----------
QUERY:


select * from numrange_test where nr = 'empty';
RESULT:
	postgres: [(NumericRange(empty=True),)]

-----------
QUERY:

select * from numrange_test where nr = '(1.1, 2.2)';
RESULT:
	postgres: []

-----------
QUERY:

select * from numrange_test where nr = '[1.1, 2.2)';
RESULT:
	postgres: [(NumericRange(Decimal('1.1'), Decimal('2.2'), '[)'),)]

-----------
QUERY:

select * from numrange_test where nr < 'empty';
RESULT:
	postgres: []

-----------
QUERY:

select * from numrange_test where nr < numrange(-1000.0, -1000.0,'[]');
RESULT:
	postgres: [(NumericRange(None, None, '()'),), (NumericRange(None, Decimal('5'), '()'),), (NumericRange(empty=True),)]

-----------
QUERY:

select * from numrange_test where nr < numrange(0.0, 1.0,'[]');
RESULT:
	postgres: [(NumericRange(None, None, '()'),), (NumericRange(None, Decimal('5'), '()'),), (NumericRange(empty=True),)]

-----------
QUERY:

select * from numrange_test where nr < numrange(1000.0, 1001.0,'[]');
RESULT:
	postgres: [(NumericRange(None, None, '()'),), (NumericRange(Decimal('3'), None, '[)'),), (NumericRange(None, Decimal('5'), '()'),), (NumericRange(Decimal('1.1'), Decimal('2.2'), '[)'),), (NumericRange(empty=True),), (NumericRange(Decimal('1.7'), Decimal('1.7'), '[]'),)]

-----------
QUERY:

select * from numrange_test where nr <= 'empty';
RESULT:
	postgres: [(NumericRange(empty=True),)]

-----------
QUERY:

select * from numrange_test where nr >= 'empty';
RESULT:
	postgres: [(NumericRange(None, None, '()'),), (NumericRange(Decimal('3'), None, '[)'),), (NumericRange(None, Decimal('5'), '()'),), (NumericRange(Decimal('1.1'), Decimal('2.2'), '[)'),), (NumericRange(empty=True),), (NumericRange(Decimal('1.7'), Decimal('1.7'), '[]'),)]

-----------
QUERY:

select * from numrange_test where nr > 'empty';
RESULT:
	postgres: [(NumericRange(None, None, '()'),), (NumericRange(Decimal('3'), None, '[)'),), (NumericRange(None, Decimal('5'), '()'),), (NumericRange(Decimal('1.1'), Decimal('2.2'), '[)'),), (NumericRange(Decimal('1.7'), Decimal('1.7'), '[]'),)]

-----------
QUERY:

select * from numrange_test where nr > numrange(-1001.0, -1000.0,'[]');
RESULT:
	postgres: [(NumericRange(Decimal('3'), None, '[)'),), (NumericRange(Decimal('1.1'), Decimal('2.2'), '[)'),), (NumericRange(Decimal('1.7'), Decimal('1.7'), '[]'),)]

-----------
QUERY:

select * from numrange_test where nr > numrange(0.0, 1.0,'[]');
RESULT:
	postgres: [(NumericRange(Decimal('3'), None, '[)'),), (NumericRange(Decimal('1.1'), Decimal('2.2'), '[)'),), (NumericRange(Decimal('1.7'), Decimal('1.7'), '[]'),)]

-----------
QUERY:

select * from numrange_test where nr > numrange(1000.0, 1000.0,'[]');
RESULT:
	postgres: []

-----------
QUERY:


select numrange(2.0, 1.0);
RESULT:
	postgres: range lower bound must be less than or equal to range upper bound


-----------
QUERY:


select numrange(2.0, 3.0) -|- numrange(3.0, 4.0);
RESULT:
	postgres: [(True,)]

-----------
QUERY:

select range_adjacent(numrange(2.0, 3.0), numrange(3.1, 4.0));
RESULT:
	postgres: [(False,)]

-----------
QUERY:

select range_adjacent(numrange(2.0, 3.0), numrange(3.1, null));
RESULT:
	postgres: [(False,)]

-----------
QUERY:

select numrange(2.0, 3.0, '[]') -|- numrange(3.0, 4.0, '()');
RESULT:
	postgres: [(True,)]

-----------
QUERY:

select numrange(1.0, 2.0) -|- numrange(2.0, 3.0,'[]');
RESULT:
	postgres: [(True,)]

-----------
QUERY:

select range_adjacent(numrange(2.0, 3.0, '(]'), numrange(1.0, 2.0, '(]'));
RESULT:
	postgres: [(True,)]

-----------
QUERY:


select numrange(1.1, 3.3) <@ numrange(0.1,10.1);
RESULT:
	postgres: [(True,)]

-----------
QUERY:

select numrange(0.1, 10.1) <@ numrange(1.1,3.3);
RESULT:
	postgres: [(False,)]

-----------
QUERY:


select numrange(1.1, 2.2) - numrange(2.0, 3.0);
RESULT:
	postgres: [(NumericRange(Decimal('1.1'), Decimal('2.0'), '[)'),)]

-----------
QUERY:

select numrange(1.1, 2.2) - numrange(2.2, 3.0);
RESULT:
	postgres: [(NumericRange(Decimal('1.1'), Decimal('2.2'), '[)'),)]

-----------
QUERY:

select numrange(1.1, 2.2,'[]') - numrange(2.0, 3.0);
RESULT:
	postgres: [(NumericRange(Decimal('1.1'), Decimal('2.0'), '[)'),)]

-----------
QUERY:

select range_minus(numrange(10.1,12.2,'[]'), numrange(110.0,120.2,'(]'));
RESULT:
	postgres: [(NumericRange(Decimal('10.1'), Decimal('12.2'), '[]'),)]

-----------
QUERY:

select range_minus(numrange(10.1,12.2,'[]'), numrange(0.0,120.2,'(]'));
RESULT:
	postgres: [(NumericRange(empty=True),)]

-----------
QUERY:


select numrange(4.5, 5.5, '[]') && numrange(5.5, 6.5);
RESULT:
	postgres: [(True,)]

-----------
QUERY:

select numrange(1.0, 2.0) << numrange(3.0, 4.0);
RESULT:
	postgres: [(True,)]

-----------
QUERY:

select numrange(1.0, 3.0,'[]') << numrange(3.0, 4.0,'[]');
RESULT:
	postgres: [(False,)]

-----------
QUERY:

select numrange(1.0, 3.0,'()') << numrange(3.0, 4.0,'()');
RESULT:
	postgres: [(True,)]

-----------
QUERY:

select numrange(1.0, 2.0) >> numrange(3.0, 4.0);
RESULT:
	postgres: [(False,)]

-----------
QUERY:

select numrange(3.0, 70.0) &< numrange(6.6, 100.0);
RESULT:
	postgres: [(True,)]

-----------
QUERY:


select numrange(1.1, 2.2) < numrange(1.0, 200.2);
RESULT:
	postgres: [(False,)]

-----------
QUERY:

select numrange(1.1, 2.2) < numrange(1.1, 1.2);
RESULT:
	postgres: [(False,)]

-----------
QUERY:


select numrange(1.0, 2.0) + numrange(2.0, 3.0);
RESULT:
	postgres: [(NumericRange(Decimal('1.0'), Decimal('3.0'), '[)'),)]

-----------
QUERY:

select numrange(1.0, 2.0) + numrange(1.5, 3.0);
RESULT:
	postgres: [(NumericRange(Decimal('1.0'), Decimal('3.0'), '[)'),)]

-----------
QUERY:

select numrange(1.0, 2.0) + numrange(2.5, 3.0);
RESULT:
	postgres: result of range union would not be contiguous


-----------
QUERY:
 -- should fail

select range_merge(numrange(1.0, 2.0), numrange(2.0, 3.0));
RESULT:
	postgres: [(NumericRange(Decimal('1.0'), Decimal('3.0'), '[)'),)]

-----------
QUERY:

select range_merge(numrange(1.0, 2.0), numrange(1.5, 3.0));
RESULT:
	postgres: [(NumericRange(Decimal('1.0'), Decimal('3.0'), '[)'),)]

-----------
QUERY:

select range_merge(numrange(1.0, 2.0), numrange(2.5, 3.0));
RESULT:
	postgres: [(NumericRange(Decimal('1.0'), Decimal('3.0'), '[)'),)]

-----------
QUERY:
 -- shouldn/* REPLACED */''t fail

select numrange(1.0, 2.0) * numrange(2.0, 3.0);
RESULT:
	postgres: [(NumericRange(empty=True),)]

-----------
QUERY:

select numrange(1.0, 2.0) * numrange(1.5, 3.0);
RESULT:
	postgres: [(NumericRange(Decimal('1.5'), Decimal('2.0'), '[)'),)]

-----------
QUERY:

select numrange(1.0, 2.0) * numrange(2.5, 3.0);
RESULT:
	postgres: [(NumericRange(empty=True),)]

-----------
QUERY:


select range_intersect_agg(nr) from numrange_test;
RESULT:
	postgres: [(NumericRange(empty=True),)]

-----------
QUERY:

select range_intersect_agg(nr) from numrange_test where false;
RESULT:
	postgres: [(None,)]

-----------
QUERY:

select range_intersect_agg(nr) from numrange_test where nr @> 4.0;
RESULT:
	postgres: [(NumericRange(Decimal('3'), Decimal('5'), '[)'),)]

-----------
QUERY:


analyze numrange_test;
RESULT:
	postgres: None

-----------
QUERY:


create table numrange_test2(nr numrange);
RESULT:
	postgres: None

-----------
QUERY:

create index numrange_test2_hash_idx on numrange_test2 using hash (nr);
RESULT:
	postgres: None

-----------
QUERY:


INSERT INTO numrange_test2 VALUES('[, 5)');
RESULT:
	postgres: None

-----------
QUERY:

INSERT INTO numrange_test2 VALUES(numrange(1.1, 2.2));
RESULT:
	postgres: None

-----------
QUERY:

INSERT INTO numrange_test2 VALUES(numrange(1.1, 2.2));
RESULT:
	postgres: None

-----------
QUERY:

INSERT INTO numrange_test2 VALUES(numrange(1.1, 2.2,'()'));
RESULT:
	postgres: None

-----------
QUERY:

INSERT INTO numrange_test2 VALUES('empty');
RESULT:
	postgres: None

-----------
QUERY:


select * from numrange_test2 where nr = 'empty'::numrange;
RESULT:
	postgres: [(NumericRange(empty=True),)]

-----------
QUERY:

select * from numrange_test2 where nr = numrange(1.1, 2.2);
RESULT:
	postgres: [(NumericRange(Decimal('1.1'), Decimal('2.2'), '[)'),), (NumericRange(Decimal('1.1'), Decimal('2.2'), '[)'),)]

-----------
QUERY:

select * from numrange_test2 where nr = numrange(1.1, 2.3);
RESULT:
	postgres: []

-----------
QUERY:


set enable_nestloop=t;
RESULT:
	postgres: None

-----------
QUERY:

set enable_hashjoin=f;
RESULT:
	postgres: None

-----------
QUERY:

set enable_mergejoin=f;
RESULT:
	postgres: None

-----------
QUERY:

select * from numrange_test natural join numrange_test2 order by nr;
RESULT:
	postgres: [(NumericRange(empty=True),), (NumericRange(None, Decimal('5'), '()'),), (NumericRange(Decimal('1.1'), Decimal('2.2'), '[)'),), (NumericRange(Decimal('1.1'), Decimal('2.2'), '[)'),)]

-----------
QUERY:

set enable_nestloop=f;
RESULT:
	postgres: None

-----------
QUERY:

set enable_hashjoin=t;
RESULT:
	postgres: None

-----------
QUERY:

set enable_mergejoin=f;
RESULT:
	postgres: None

-----------
QUERY:

select * from numrange_test natural join numrange_test2 order by nr;
RESULT:
	postgres: [(NumericRange(empty=True),), (NumericRange(None, Decimal('5'), '()'),), (NumericRange(Decimal('1.1'), Decimal('2.2'), '[)'),), (NumericRange(Decimal('1.1'), Decimal('2.2'), '[)'),)]

-----------
QUERY:

set enable_nestloop=f;
RESULT:
	postgres: None

-----------
QUERY:

set enable_hashjoin=f;
RESULT:
	postgres: None

-----------
QUERY:

set enable_mergejoin=t;
RESULT:
	postgres: None

-----------
QUERY:

select * from numrange_test natural join numrange_test2 order by nr;
RESULT:
	postgres: [(NumericRange(empty=True),), (NumericRange(None, Decimal('5'), '()'),), (NumericRange(Decimal('1.1'), Decimal('2.2'), '[)'),), (NumericRange(Decimal('1.1'), Decimal('2.2'), '[)'),)]

-----------
QUERY:


set enable_nestloop to default;
RESULT:
	postgres: None

-----------
QUERY:

set enable_hashjoin to default;
RESULT:
	postgres: None

-----------
QUERY:

set enable_mergejoin to default;
RESULT:
	postgres: None

-----------
QUERY:


-- keep numrange_test around to help exercise dump/reload
DROP TABLE numrange_test2;
RESULT:
	postgres: None

-----------
QUERY:


--
-- Apply a subset of the above tests on a collatable type, too
--

CREATE TABLE textrange_test (tr textrange);
RESULT:
	postgres: None

-----------
QUERY:

create index textrange_test_btree on textrange_test(tr);
RESULT:
	postgres: None

-----------
QUERY:


INSERT INTO textrange_test VALUES('[,)');
RESULT:
	postgres: None

-----------
QUERY:

INSERT INTO textrange_test VALUES('["a",]');
RESULT:
	postgres: None

-----------
QUERY:

INSERT INTO textrange_test VALUES('[,"q")');
RESULT:
	postgres: None

-----------
QUERY:

INSERT INTO textrange_test VALUES(textrange('b', 'g'));
RESULT:
	postgres: None

-----------
QUERY:

INSERT INTO textrange_test VALUES('empty');
RESULT:
	postgres: None

-----------
QUERY:

INSERT INTO textrange_test VALUES(textrange('d', 'd', '[]'));
RESULT:
	postgres: None

-----------
QUERY:


SELECT tr, isempty(tr), lower(tr), upper(tr) FROM textrange_test;
RESULT:
	postgres: [('(,)', False, None, None), ('[a,)', False, 'a', None), ('(,q)', False, None, 'q'), ('[b,g)', False, 'b', 'g'), ('empty', True, None, None), ('[d,d]', False, 'd', 'd')]

-----------
QUERY:

SELECT tr, lower_inc(tr), lower_inf(tr), upper_inc(tr), upper_inf(tr) FROM textrange_test;
RESULT:
	postgres: [('(,)', False, True, False, True), ('[a,)', True, False, False, True), ('(,q)', False, True, False, False), ('[b,g)', True, False, False, False), ('empty', False, False, False, False), ('[d,d]', True, False, True, False)]

-----------
QUERY:


SELECT * FROM textrange_test WHERE range_contains(tr, textrange('f', 'fx'));
RESULT:
	postgres: [('(,)',), ('[a,)',), ('(,q)',), ('[b,g)',)]

-----------
QUERY:

SELECT * FROM textrange_test WHERE tr @> textrange('a', 'z');
RESULT:
	postgres: [('(,)',), ('[a,)',)]

-----------
QUERY:

SELECT * FROM textrange_test WHERE range_contained_by(textrange('0','9'), tr);
RESULT:
	postgres: [('(,)',), ('(,q)',)]

-----------
QUERY:

SELECT * FROM textrange_test WHERE 'e'::text <@ tr;
RESULT:
	postgres: [('(,)',), ('[a,)',), ('(,q)',), ('[b,g)',)]

-----------
QUERY:


select * from textrange_test where tr = 'empty';
RESULT:
	postgres: [('empty',)]

-----------
QUERY:

select * from textrange_test where tr = '("b","g")';
RESULT:
	postgres: []

-----------
QUERY:

select * from textrange_test where tr = '["b","g")';
RESULT:
	postgres: [('[b,g)',)]

-----------
QUERY:

select * from textrange_test where tr < 'empty';
RESULT:
	postgres: []

-----------
QUERY:



-- test canonical form for int4range
select int4range(1, 10, '[]');
RESULT:
	postgres: [(NumericRange(1, 11, '[)'),)]

-----------
QUERY:

select int4range(1, 10, '[)');
RESULT:
	postgres: [(NumericRange(1, 10, '[)'),)]

-----------
QUERY:

select int4range(1, 10, '(]');
RESULT:
	postgres: [(NumericRange(2, 11, '[)'),)]

-----------
QUERY:

select int4range(1, 10, '()');
RESULT:
	postgres: [(NumericRange(2, 10, '[)'),)]

-----------
QUERY:

select int4range(1, 2, '()');
RESULT:
	postgres: [(NumericRange(empty=True),)]

-----------
QUERY:


-- test canonical form for daterange
select daterange('2000-01-10'::date, '2000-01-20'::date, '[]');
RESULT:
	postgres: [(DateRange(datetime.date(2000, 1, 10), datetime.date(2000, 1, 21), '[)'),)]

-----------
QUERY:

select daterange('2000-01-10'::date, '2000-01-20'::date, '[)');
RESULT:
	postgres: [(DateRange(datetime.date(2000, 1, 10), datetime.date(2000, 1, 20), '[)'),)]

-----------
QUERY:

select daterange('2000-01-10'::date, '2000-01-20'::date, '(]');
RESULT:
	postgres: [(DateRange(datetime.date(2000, 1, 11), datetime.date(2000, 1, 21), '[)'),)]

-----------
QUERY:

select daterange('2000-01-10'::date, '2000-01-20'::date, '()');
RESULT:
	postgres: [(DateRange(datetime.date(2000, 1, 11), datetime.date(2000, 1, 20), '[)'),)]

-----------
QUERY:

select daterange('2000-01-10'::date, '2000-01-11'::date, '()');
RESULT:
	postgres: [(DateRange(empty=True),)]

-----------
QUERY:

select daterange('2000-01-10'::date, '2000-01-11'::date, '(]');
RESULT:
	postgres: [(DateRange(datetime.date(2000, 1, 11), datetime.date(2000, 1, 12), '[)'),)]

-----------
QUERY:

select daterange('-infinity'::date, '2000-01-01'::date, '()');
RESULT:
	postgres: [(DateRange(datetime.date(1, 1, 1), datetime.date(2000, 1, 1), '()'),)]

-----------
QUERY:

select daterange('-infinity'::date, '2000-01-01'::date, '[)');
RESULT:
	postgres: [(DateRange(datetime.date(1, 1, 1), datetime.date(2000, 1, 1), '[)'),)]

-----------
QUERY:

select daterange('2000-01-01'::date, 'infinity'::date, '[)');
RESULT:
	postgres: [(DateRange(datetime.date(2000, 1, 1), datetime.date(9999, 12, 31), '[)'),)]

-----------
QUERY:

select daterange('2000-01-01'::date, 'infinity'::date, '[]');
RESULT:
	postgres: [(DateRange(datetime.date(2000, 1, 1), datetime.date(9999, 12, 31), '[]'),)]

-----------
QUERY:


-- test GiST index that/* REPLACED */''s been built incrementally
create table test_range_gist(ir int4range);
RESULT:
	postgres: None

-----------
QUERY:

create index test_range_gist_idx on test_range_gist using gist (ir);
RESULT:
	postgres: None

-----------
QUERY:


insert into test_range_gist select int4range(g, g+10) from generate_series(1,2000) g;
RESULT:
	postgres: None

-----------
QUERY:

insert into test_range_gist select 'empty'::int4range from generate_series(1,500) g;
RESULT:
	postgres: None

-----------
QUERY:

insert into test_range_gist select int4range(g, g+10000) from generate_series(1,1000) g;
RESULT:
	postgres: None

-----------
QUERY:

insert into test_range_gist select 'empty'::int4range from generate_series(1,500) g;
RESULT:
	postgres: None

-----------
QUERY:

insert into test_range_gist select int4range(NULL,g*10,'(]') from generate_series(1,100) g;
RESULT:
	postgres: None

-----------
QUERY:

insert into test_range_gist select int4range(g*10,NULL,'(]') from generate_series(1,100) g;
RESULT:
	postgres: None

-----------
QUERY:

insert into test_range_gist select int4range(g, g+10) from generate_series(1,2000) g;
RESULT:
	postgres: None

-----------
QUERY:


-- test statistics and selectivity estimation as well
--
-- We don/* REPLACED */''t check the accuracy of selectivity estimation, but at least check
-- it doesn/* REPLACED */''t fall.
analyze test_range_gist;
RESULT:
	postgres: None

-----------
QUERY:


-- first, verify non-indexed results
SET enable_seqscan    = t;
RESULT:
	postgres: None

-----------
QUERY:

SET enable_indexscan  = f;
RESULT:
	postgres: None

-----------
QUERY:

SET enable_bitmapscan = f;
RESULT:
	postgres: None

-----------
QUERY:


select count(*) from test_range_gist where ir @> 'empty'::int4range;
RESULT:
	postgres: [(6200,)]

-----------
QUERY:

select count(*) from test_range_gist where ir = int4range(10,20);
RESULT:
	postgres: [(2,)]

-----------
QUERY:

select count(*) from test_range_gist where ir @> 10;
RESULT:
	postgres: [(130,)]

-----------
QUERY:

select count(*) from test_range_gist where ir @> int4range(10,20);
RESULT:
	postgres: [(111,)]

-----------
QUERY:

select count(*) from test_range_gist where ir && int4range(10,20);
RESULT:
	postgres: [(158,)]

-----------
QUERY:

select count(*) from test_range_gist where ir <@ int4range(10,50);
RESULT:
	postgres: [(1062,)]

-----------
QUERY:

select count(*) from test_range_gist where ir << int4range(100,500);
RESULT:
	postgres: [(189,)]

-----------
QUERY:

select count(*) from test_range_gist where ir >> int4range(100,500);
RESULT:
	postgres: [(3554,)]

-----------
QUERY:

select count(*) from test_range_gist where ir &< int4range(100,500);
RESULT:
	postgres: [(1029,)]

-----------
QUERY:

select count(*) from test_range_gist where ir &> int4range(100,500);
RESULT:
	postgres: [(4794,)]

-----------
QUERY:

select count(*) from test_range_gist where ir -|- int4range(100,500);
RESULT:
	postgres: [(5,)]

-----------
QUERY:

select count(*) from test_range_gist where ir @> '{}'::int4multirange;
RESULT:
	postgres: [(6200,)]

-----------
QUERY:

select count(*) from test_range_gist where ir @> int4multirange(int4range(10,20), int4range(30,40));
RESULT:
	postgres: [(107,)]

-----------
QUERY:

select count(*) from test_range_gist where ir && '{(10,20),(30,40),(50,60)}'::int4multirange;
RESULT:
	postgres: [(271,)]

-----------
QUERY:

select count(*) from test_range_gist where ir <@ '{(10,30),(40,60),(70,90)}'::int4multirange;
RESULT:
	postgres: [(1060,)]

-----------
QUERY:

select count(*) from test_range_gist where ir << int4multirange(int4range(100,200), int4range(400,500));
RESULT:
	postgres: [(189,)]

-----------
QUERY:

select count(*) from test_range_gist where ir >> int4multirange(int4range(100,200), int4range(400,500));
RESULT:
	postgres: [(3554,)]

-----------
QUERY:

select count(*) from test_range_gist where ir &< int4multirange(int4range(100,200), int4range(400,500));
RESULT:
	postgres: [(1029,)]

-----------
QUERY:

select count(*) from test_range_gist where ir &> int4multirange(int4range(100,200), int4range(400,500));
RESULT:
	postgres: [(4794,)]

-----------
QUERY:

select count(*) from test_range_gist where ir -|- int4multirange(int4range(100,200), int4range(400,500));
RESULT:
	postgres: [(5,)]

-----------
QUERY:


-- now check same queries using index
SET enable_seqscan    = f;
RESULT:
	postgres: None

-----------
QUERY:

SET enable_indexscan  = t;
RESULT:
	postgres: None

-----------
QUERY:

SET enable_bitmapscan = f;
RESULT:
	postgres: None

-----------
QUERY:


select count(*) from test_range_gist where ir @> 'empty'::int4range;
RESULT:
	postgres: [(6200,)]

-----------
QUERY:

select count(*) from test_range_gist where ir = int4range(10,20);
RESULT:
	postgres: [(2,)]

-----------
QUERY:

select count(*) from test_range_gist where ir @> 10;
RESULT:
	postgres: [(130,)]

-----------
QUERY:

select count(*) from test_range_gist where ir @> int4range(10,20);
RESULT:
	postgres: [(111,)]

-----------
QUERY:

select count(*) from test_range_gist where ir && int4range(10,20);
RESULT:
	postgres: [(158,)]

-----------
QUERY:

select count(*) from test_range_gist where ir <@ int4range(10,50);
RESULT:
	postgres: [(1062,)]

-----------
QUERY:

select count(*) from test_range_gist where ir << int4range(100,500);
RESULT:
	postgres: [(189,)]

-----------
QUERY:

select count(*) from test_range_gist where ir >> int4range(100,500);
RESULT:
	postgres: [(3554,)]

-----------
QUERY:

select count(*) from test_range_gist where ir &< int4range(100,500);
RESULT:
	postgres: [(1029,)]

-----------
QUERY:

select count(*) from test_range_gist where ir &> int4range(100,500);
RESULT:
	postgres: [(4794,)]

-----------
QUERY:

select count(*) from test_range_gist where ir -|- int4range(100,500);
RESULT:
	postgres: [(5,)]

-----------
QUERY:

select count(*) from test_range_gist where ir @> '{}'::int4multirange;
RESULT:
	postgres: [(6200,)]

-----------
QUERY:

select count(*) from test_range_gist where ir @> int4multirange(int4range(10,20), int4range(30,40));
RESULT:
	postgres: [(107,)]

-----------
QUERY:

select count(*) from test_range_gist where ir && '{(10,20),(30,40),(50,60)}'::int4multirange;
RESULT:
	postgres: [(271,)]

-----------
QUERY:

select count(*) from test_range_gist where ir <@ '{(10,30),(40,60),(70,90)}'::int4multirange;
RESULT:
	postgres: [(1060,)]

-----------
QUERY:

select count(*) from test_range_gist where ir << int4multirange(int4range(100,200), int4range(400,500));
RESULT:
	postgres: [(189,)]

-----------
QUERY:

select count(*) from test_range_gist where ir >> int4multirange(int4range(100,200), int4range(400,500));
RESULT:
	postgres: [(3554,)]

-----------
QUERY:

select count(*) from test_range_gist where ir &< int4multirange(int4range(100,200), int4range(400,500));
RESULT:
	postgres: [(1029,)]

-----------
QUERY:

select count(*) from test_range_gist where ir &> int4multirange(int4range(100,200), int4range(400,500));
RESULT:
	postgres: [(4794,)]

-----------
QUERY:

select count(*) from test_range_gist where ir -|- int4multirange(int4range(100,200), int4range(400,500));
RESULT:
	postgres: [(5,)]

-----------
QUERY:


-- now check same queries using a bulk-loaded index
drop index test_range_gist_idx;
RESULT:
	postgres: None

-----------
QUERY:

create index test_range_gist_idx on test_range_gist using gist (ir);
RESULT:
	postgres: None

-----------
QUERY:


select count(*) from test_range_gist where ir @> 'empty'::int4range;
RESULT:
	postgres: [(6200,)]

-----------
QUERY:

select count(*) from test_range_gist where ir = int4range(10,20);
RESULT:
	postgres: [(2,)]

-----------
QUERY:

select count(*) from test_range_gist where ir @> 10;
RESULT:
	postgres: [(130,)]

-----------
QUERY:

select count(*) from test_range_gist where ir @> int4range(10,20);
RESULT:
	postgres: [(111,)]

-----------
QUERY:

select count(*) from test_range_gist where ir && int4range(10,20);
RESULT:
	postgres: [(158,)]

-----------
QUERY:

select count(*) from test_range_gist where ir <@ int4range(10,50);
RESULT:
	postgres: [(1062,)]

-----------
QUERY:

select count(*) from test_range_gist where ir << int4range(100,500);
RESULT:
	postgres: [(189,)]

-----------
QUERY:

select count(*) from test_range_gist where ir >> int4range(100,500);
RESULT:
	postgres: [(3554,)]

-----------
QUERY:

select count(*) from test_range_gist where ir &< int4range(100,500);
RESULT:
	postgres: [(1029,)]

-----------
QUERY:

select count(*) from test_range_gist where ir &> int4range(100,500);
RESULT:
	postgres: [(4794,)]

-----------
QUERY:

select count(*) from test_range_gist where ir -|- int4range(100,500);
RESULT:
	postgres: [(5,)]

-----------
QUERY:

select count(*) from test_range_gist where ir @> '{}'::int4multirange;
RESULT:
	postgres: [(6200,)]

-----------
QUERY:

select count(*) from test_range_gist where ir @> int4multirange(int4range(10,20), int4range(30,40));
RESULT:
	postgres: [(107,)]

-----------
QUERY:

select count(*) from test_range_gist where ir && '{(10,20),(30,40),(50,60)}'::int4multirange;
RESULT:
	postgres: [(271,)]

-----------
QUERY:

select count(*) from test_range_gist where ir <@ '{(10,30),(40,60),(70,90)}'::int4multirange;
RESULT:
	postgres: [(1060,)]

-----------
QUERY:

select count(*) from test_range_gist where ir << int4multirange(int4range(100,200), int4range(400,500));
RESULT:
	postgres: [(189,)]

-----------
QUERY:

select count(*) from test_range_gist where ir >> int4multirange(int4range(100,200), int4range(400,500));
RESULT:
	postgres: [(3554,)]

-----------
QUERY:

select count(*) from test_range_gist where ir &< int4multirange(int4range(100,200), int4range(400,500));
RESULT:
	postgres: [(1029,)]

-----------
QUERY:

select count(*) from test_range_gist where ir &> int4multirange(int4range(100,200), int4range(400,500));
RESULT:
	postgres: [(4794,)]

-----------
QUERY:

select count(*) from test_range_gist where ir -|- int4multirange(int4range(100,200), int4range(400,500));
RESULT:
	postgres: [(5,)]

-----------
QUERY:


-- test SP-GiST index that/* REPLACED */''s been built incrementally
create table test_range_spgist(ir int4range);
RESULT:
	postgres: None

-----------
QUERY:

create index test_range_spgist_idx on test_range_spgist using spgist (ir);
RESULT:
	postgres: None

-----------
QUERY:


insert into test_range_spgist select int4range(g, g+10) from generate_series(1,2000) g;
RESULT:
	postgres: None

-----------
QUERY:

insert into test_range_spgist select 'empty'::int4range from generate_series(1,500) g;
RESULT:
	postgres: None

-----------
QUERY:

insert into test_range_spgist select int4range(g, g+10000) from generate_series(1,1000) g;
RESULT:
	postgres: None

-----------
QUERY:

insert into test_range_spgist select 'empty'::int4range from generate_series(1,500) g;
RESULT:
	postgres: None

-----------
QUERY:

insert into test_range_spgist select int4range(NULL,g*10,'(]') from generate_series(1,100) g;
RESULT:
	postgres: None

-----------
QUERY:

insert into test_range_spgist select int4range(g*10,NULL,'(]') from generate_series(1,100) g;
RESULT:
	postgres: None

-----------
QUERY:

insert into test_range_spgist select int4range(g, g+10) from generate_series(1,2000) g;
RESULT:
	postgres: None

-----------
QUERY:


-- first, verify non-indexed results
SET enable_seqscan    = t;
RESULT:
	postgres: None

-----------
QUERY:

SET enable_indexscan  = f;
RESULT:
	postgres: None

-----------
QUERY:

SET enable_bitmapscan = f;
RESULT:
	postgres: None

-----------
QUERY:


select count(*) from test_range_spgist where ir @> 'empty'::int4range;
RESULT:
	postgres: [(6200,)]

-----------
QUERY:

select count(*) from test_range_spgist where ir = int4range(10,20);
RESULT:
	postgres: [(2,)]

-----------
QUERY:

select count(*) from test_range_spgist where ir @> 10;
RESULT:
	postgres: [(130,)]

-----------
QUERY:

select count(*) from test_range_spgist where ir @> int4range(10,20);
RESULT:
	postgres: [(111,)]

-----------
QUERY:

select count(*) from test_range_spgist where ir && int4range(10,20);
RESULT:
	postgres: [(158,)]

-----------
QUERY:

select count(*) from test_range_spgist where ir <@ int4range(10,50);
RESULT:
	postgres: [(1062,)]

-----------
QUERY:

select count(*) from test_range_spgist where ir << int4range(100,500);
RESULT:
	postgres: [(189,)]

-----------
QUERY:

select count(*) from test_range_spgist where ir >> int4range(100,500);
RESULT:
	postgres: [(3554,)]

-----------
QUERY:

select count(*) from test_range_spgist where ir &< int4range(100,500);
RESULT:
	postgres: [(1029,)]

-----------
QUERY:

select count(*) from test_range_spgist where ir &> int4range(100,500);
RESULT:
	postgres: [(4794,)]

-----------
QUERY:

select count(*) from test_range_spgist where ir -|- int4range(100,500);
RESULT:
	postgres: [(5,)]

-----------
QUERY:


-- now check same queries using index
SET enable_seqscan    = f;
RESULT:
	postgres: None

-----------
QUERY:

SET enable_indexscan  = t;
RESULT:
	postgres: None

-----------
QUERY:

SET enable_bitmapscan = f;
RESULT:
	postgres: None

-----------
QUERY:


select count(*) from test_range_spgist where ir @> 'empty'::int4range;
RESULT:
	postgres: [(6200,)]

-----------
QUERY:

select count(*) from test_range_spgist where ir = int4range(10,20);
RESULT:
	postgres: [(2,)]

-----------
QUERY:

select count(*) from test_range_spgist where ir @> 10;
RESULT:
	postgres: [(130,)]

-----------
QUERY:

select count(*) from test_range_spgist where ir @> int4range(10,20);
RESULT:
	postgres: [(111,)]

-----------
QUERY:

select count(*) from test_range_spgist where ir && int4range(10,20);
RESULT:
	postgres: [(158,)]

-----------
QUERY:

select count(*) from test_range_spgist where ir <@ int4range(10,50);
RESULT:
	postgres: [(1062,)]

-----------
QUERY:

select count(*) from test_range_spgist where ir << int4range(100,500);
RESULT:
	postgres: [(189,)]

-----------
QUERY:

select count(*) from test_range_spgist where ir >> int4range(100,500);
RESULT:
	postgres: [(3554,)]

-----------
QUERY:

select count(*) from test_range_spgist where ir &< int4range(100,500);
RESULT:
	postgres: [(1029,)]

-----------
QUERY:

select count(*) from test_range_spgist where ir &> int4range(100,500);
RESULT:
	postgres: [(4794,)]

-----------
QUERY:

select count(*) from test_range_spgist where ir -|- int4range(100,500);
RESULT:
	postgres: [(5,)]

-----------
QUERY:


-- now check same queries using a bulk-loaded index
drop index test_range_spgist_idx;
RESULT:
	postgres: None

-----------
QUERY:

create index test_range_spgist_idx on test_range_spgist using spgist (ir);
RESULT:
	postgres: None

-----------
QUERY:


select count(*) from test_range_spgist where ir @> 'empty'::int4range;
RESULT:
	postgres: [(6200,)]

-----------
QUERY:

select count(*) from test_range_spgist where ir = int4range(10,20);
RESULT:
	postgres: [(2,)]

-----------
QUERY:

select count(*) from test_range_spgist where ir @> 10;
RESULT:
	postgres: [(130,)]

-----------
QUERY:

select count(*) from test_range_spgist where ir @> int4range(10,20);
RESULT:
	postgres: [(111,)]

-----------
QUERY:

select count(*) from test_range_spgist where ir && int4range(10,20);
RESULT:
	postgres: [(158,)]

-----------
QUERY:

select count(*) from test_range_spgist where ir <@ int4range(10,50);
RESULT:
	postgres: [(1062,)]

-----------
QUERY:

select count(*) from test_range_spgist where ir << int4range(100,500);
RESULT:
	postgres: [(189,)]

-----------
QUERY:

select count(*) from test_range_spgist where ir >> int4range(100,500);
RESULT:
	postgres: [(3554,)]

-----------
QUERY:

select count(*) from test_range_spgist where ir &< int4range(100,500);
RESULT:
	postgres: [(1029,)]

-----------
QUERY:

select count(*) from test_range_spgist where ir &> int4range(100,500);
RESULT:
	postgres: [(4794,)]

-----------
QUERY:

select count(*) from test_range_spgist where ir -|- int4range(100,500);
RESULT:
	postgres: [(5,)]

-----------
QUERY:


-- test index-only scans
explain (costs off)
select ir from test_range_spgist where ir -|- int4range(10,20) order by ir;
RESULT:
	postgres: [('Sort',), ('  Sort Key: ir',), ('  ->  Index Only Scan using test_range_spgist_idx on test_range_spgist',), ("        Index Cond: (ir -|- '[10,20)'::int4range)",)]

-----------
QUERY:

select ir from test_range_spgist where ir -|- int4range(10,20) order by ir;
RESULT:
	postgres: [(NumericRange(20, 30, '[)'),), (NumericRange(20, 30, '[)'),), (NumericRange(20, 10020, '[)'),)]

-----------
QUERY:


RESET enable_seqscan;
RESULT:
	postgres: None

-----------
QUERY:

RESET enable_indexscan;
RESULT:
	postgres: None

-----------
QUERY:

RESET enable_bitmapscan;
RESULT:
	postgres: None

-----------
QUERY:


-- test elem <@ range operator
create table test_range_elem(i int4);
RESULT:
	postgres: None

-----------
QUERY:

create index test_range_elem_idx on test_range_elem (i);
RESULT:
	postgres: None

-----------
QUERY:

insert into test_range_elem select i from generate_series(1,100) i;
RESULT:
	postgres: None

-----------
QUERY:


SET enable_seqscan    = f;
RESULT:
	postgres: None

-----------
QUERY:


select count(*) from test_range_elem where i <@ int4range(10,50);
RESULT:
	postgres: [(40,)]

-----------
QUERY:


-- also test spgist index on anyrange expression
create index on test_range_elem using spgist(int4range(i,i+10));
RESULT:
	postgres: None

-----------
QUERY:

explain (costs off)
select count(*) from test_range_elem where int4range(i,i+10) <@ int4range(10,30);
RESULT:
	postgres: [('Aggregate',), ('  ->  Index Scan using test_range_elem_int4range_idx on test_range_elem',), ("        Index Cond: (int4range(i, (i + 10)) <@ '[10,30)'::int4range)",)]

-----------
QUERY:

select count(*) from test_range_elem where int4range(i,i+10) <@ int4range(10,30);
RESULT:
	postgres: [(11,)]

-----------
QUERY:


RESET enable_seqscan;
RESULT:
	postgres: None

-----------
QUERY:


drop table test_range_elem;
RESULT:
	postgres: None

-----------
QUERY:


--
-- Btree_gist is not included by default, so to test exclusion
-- constraints with range types, use singleton int ranges for the /* REPLACED */''=/* REPLACED */''
-- portion of the constraint.
--

create table test_range_excl(
  room int4range,
  speaker int4range,
  during tsrange,
  exclude using gist (room with =, during with &&),
  exclude using gist (speaker with =, during with &&)
);
RESULT:
	postgres: None

-----------
QUERY:


insert into test_range_excl
  values(int4range(123, 123, '[]'), int4range(1, 1, '[]'), '[2010-01-02 10:00, 2010-01-02 11:00)');
RESULT:
	postgres: None

-----------
QUERY:

insert into test_range_excl
  values(int4range(123, 123, '[]'), int4range(2, 2, '[]'), '[2010-01-02 11:00, 2010-01-02 12:00)');
RESULT:
	postgres: None

-----------
QUERY:

insert into test_range_excl
  values(int4range(123, 123, '[]'), int4range(3, 3, '[]'), '[2010-01-02 10:10, 2010-01-02 11:00)');
RESULT:
	postgres: conflicting key value violates exclusion constraint "test_range_excl_room_during_excl"
DETAIL:  Key (room, during)=([123,124), ["2010-01-02 10:10:00","2010-01-02 11:00:00")) conflicts with existing key (room, during)=([123,124), ["2010-01-02 10:00:00","2010-01-02 11:00:00")).


-----------
QUERY:

insert into test_range_excl
  values(int4range(124, 124, '[]'), int4range(3, 3, '[]'), '[2010-01-02 10:10, 2010-01-02 11:10)');
RESULT:
	postgres: None

-----------
QUERY:

insert into test_range_excl
  values(int4range(125, 125, '[]'), int4range(1, 1, '[]'), '[2010-01-02 10:10, 2010-01-02 11:00)');
RESULT:
	postgres: conflicting key value violates exclusion constraint "test_range_excl_speaker_during_excl"
DETAIL:  Key (speaker, during)=([1,2), ["2010-01-02 10:10:00","2010-01-02 11:00:00")) conflicts with existing key (speaker, during)=([1,2), ["2010-01-02 10:00:00","2010-01-02 11:00:00")).


-----------
QUERY:


-- test bigint ranges
select int8range(10000000000::int8, 20000000000::int8,'(]');
RESULT:
	postgres: [(NumericRange(10000000001, 20000000001, '[)'),)]

-----------
QUERY:

-- test tstz ranges
set timezone to '-08';
RESULT:
	postgres: None

-----------
QUERY:

select '[2010-01-01 01:00:00 -05, 2010-01-01 02:00:00 -08)'::tstzrange;
RESULT:
	postgres: [(DateTimeTZRange(datetime.datetime(2009, 12, 31, 22, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=57600))), datetime.datetime(2010, 1, 1, 2, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=57600))), '[)'),)]

-----------
QUERY:

-- should fail
select '[2010-01-01 01:00:00 -08, 2010-01-01 02:00:00 -05)'::tstzrange;
RESULT:
	postgres: range lower bound must be less than or equal to range upper bound
LINE 3: select '[2010-01-01 01:00:00 -08, 2010-01-01 02:00:00 -05)':...
               ^


-----------
QUERY:

set timezone to default;
RESULT:
	postgres: None

-----------
QUERY:


--
-- Test user-defined range of floats
-- (type float8range was already made in test_setup.sql)
--

--should fail
create type bogus_float8range as range (subtype=float8, subtype_diff=float4mi);
RESULT:
	postgres: function float4mi(double precision, double precision) does not exist


-----------
QUERY:


select '[123.001, 5.e9)'::float8range @> 888.882::float8;
RESULT:
	postgres: [(True,)]

-----------
QUERY:

create table float8range_test(f8r float8range, i int);
RESULT:
	postgres: None

-----------
QUERY:

insert into float8range_test values(float8range(-100.00007, '1.111113e9'), 42);
RESULT:
	postgres: None

-----------
QUERY:

select * from float8range_test;
RESULT:
	postgres: [('[-100.00007,1111113000)', 42)]

-----------
QUERY:

drop table float8range_test;
RESULT:
	postgres: None

-----------
QUERY:


--
-- Test range types over domains
--

create domain mydomain as int4;
RESULT:
	postgres: None

-----------
QUERY:

create type mydomainrange as range(subtype=mydomain);
RESULT:
	postgres: None

-----------
QUERY:

select '[4,50)'::mydomainrange @> 7::mydomain;
RESULT:
	postgres: [(True,)]

-----------
QUERY:

drop domain mydomain;
RESULT:
	postgres: cannot drop type mydomain because other objects depend on it
DETAIL:  type mydomainrange depends on type mydomain
HINT:  Use DROP ... CASCADE to drop the dependent objects too.


-----------
QUERY:
  -- fail
drop domain mydomain cascade;
RESULT:
	postgres: None

-----------
QUERY:


--
-- Test domains over range types
--

create domain restrictedrange as int4range check (upper(value) < 10);
RESULT:
	postgres: None

-----------
QUERY:

select '[4,5)'::restrictedrange @> 7;
RESULT:
	postgres: [(False,)]

-----------
QUERY:

select '[4,50)'::restrictedrange @> 7;
RESULT:
	postgres: value for domain restrictedrange violates check constraint "restrictedrange_check"


-----------
QUERY:
 -- should fail
drop domain restrictedrange;
RESULT:
	postgres: None

-----------
QUERY:


--
-- Test multiple range types over the same subtype
--

create type textrange1 as range(subtype=text, collation="C");
RESULT:
	postgres: None

-----------
QUERY:

create type textrange2 as range(subtype=text, collation="C");
RESULT:
	postgres: None

-----------
QUERY:


select textrange1('a','Z') @> 'b'::text;
RESULT:
	postgres: range lower bound must be less than or equal to range upper bound


-----------
QUERY:

select textrange2('a','z') @> 'b'::text;
RESULT:
	postgres: [(True,)]

-----------
QUERY:


drop type textrange1;
RESULT:
	postgres: None

-----------
QUERY:

drop type textrange2;
RESULT:
	postgres: None

-----------
QUERY:


--
-- Test polymorphic type system
--

create function anyarray_anyrange_func(a anyarray, r anyrange)
  returns anyelement as 'select $1[1] + lower($2);
RESULT:
	postgres: unterminated quoted string at or near "'select $1[1] + lower($2);"
LINE 8:   returns anyelement as 'select $1[1] + lower($2);
                                ^


-----------
QUERY:
' language sql;
RESULT:
	postgres: unterminated quoted string at or near "' language sql;"
LINE 1: ' language sql;
        ^


-----------
QUERY:


select anyarray_anyrange_func(ARRAY[1,2], int4range(10,20));
RESULT:
	postgres: function anyarray_anyrange_func(integer[], int4range) does not exist
LINE 3: select anyarray_anyrange_func(ARRAY[1,2], int4range(10,20));
               ^
HINT:  No function matches the given name and argument types. You might need to add explicit type casts.


-----------
QUERY:


-- should fail
select anyarray_anyrange_func(ARRAY[1,2], numrange(10,20));
RESULT:
	postgres: function anyarray_anyrange_func(integer[], numrange) does not exist
LINE 4: select anyarray_anyrange_func(ARRAY[1,2], numrange(10,20));
               ^
HINT:  No function matches the given name and argument types. You might need to add explicit type casts.


-----------
QUERY:


drop function anyarray_anyrange_func(anyarray, anyrange);
RESULT:
	postgres: function anyarray_anyrange_func(anyarray, anyrange) does not exist


-----------
QUERY:


-- should fail
create function bogus_func(anyelement)
  returns anyrange as 'select int4range(1,10)' language sql;
RESULT:
	postgres: cannot determine result data type
DETAIL:  A result of type anyrange requires at least one input of type anyrange or anymultirange.


-----------
QUERY:


-- should fail
create function bogus_func(int)
  returns anyrange as 'select int4range(1,10)' language sql;
RESULT:
	postgres: cannot determine result data type
DETAIL:  A result of type anyrange requires at least one input of type anyrange or anymultirange.


-----------
QUERY:


create function range_add_bounds(anyrange)
  returns anyelement as 'select lower($1) + upper($1)' language sql;
RESULT:
	postgres: None

-----------
QUERY:


select range_add_bounds(int4range(1, 17));
RESULT:
	postgres: [(18,)]

-----------
QUERY:

select range_add_bounds(numrange(1.0001, 123.123));
RESULT:
	postgres: [(Decimal('124.1231'),)]

-----------
QUERY:


create function rangetypes_sql(q anyrange, b anyarray, out c anyelement)
  as $$ select upper($1) + $2[1] $$
  language sql;
RESULT:
	postgres: None

-----------
QUERY:


select rangetypes_sql(int4range(1,10), ARRAY[2,20]);
RESULT:
	postgres: [(12,)]

-----------
QUERY:

select rangetypes_sql(numrange(1,10), ARRAY[2,20]);
RESULT:
	postgres: function rangetypes_sql(numrange, integer[]) does not exist
LINE 2: select rangetypes_sql(numrange(1,10), ARRAY[2,20]);
               ^
HINT:  No function matches the given name and argument types. You might need to add explicit type casts.


-----------
QUERY:
  -- match failure

create function anycompatiblearray_anycompatiblerange_func(a anycompatiblearray, r anycompatiblerange)
  returns anycompatible as 'select $1[1] + lower($2);
RESULT:
	postgres: unterminated quoted string at or near "'select $1[1] + lower($2);"
LINE 4:   returns anycompatible as 'select $1[1] + lower($2);
                                   ^


-----------
QUERY:
' language sql;
RESULT:
	postgres: unterminated quoted string at or near "' language sql;"
LINE 1: ' language sql;
        ^


-----------
QUERY:


select anycompatiblearray_anycompatiblerange_func(ARRAY[1,2], int4range(10,20));
RESULT:
	postgres: function anycompatiblearray_anycompatiblerange_func(integer[], int4range) does not exist
LINE 3: select anycompatiblearray_anycompatiblerange_func(ARRAY[1,2]...
               ^
HINT:  No function matches the given name and argument types. You might need to add explicit type casts.


-----------
QUERY:


select anycompatiblearray_anycompatiblerange_func(ARRAY[1,2], numrange(10,20));
RESULT:
	postgres: function anycompatiblearray_anycompatiblerange_func(integer[], numrange) does not exist
LINE 3: select anycompatiblearray_anycompatiblerange_func(ARRAY[1,2]...
               ^
HINT:  No function matches the given name and argument types. You might need to add explicit type casts.


-----------
QUERY:


-- should fail
select anycompatiblearray_anycompatiblerange_func(ARRAY[1.1,2], int4range(10,20));
RESULT:
	postgres: function anycompatiblearray_anycompatiblerange_func(numeric[], int4range) does not exist
LINE 4: select anycompatiblearray_anycompatiblerange_func(ARRAY[1.1,...
               ^
HINT:  No function matches the given name and argument types. You might need to add explicit type casts.


-----------
QUERY:


drop function anycompatiblearray_anycompatiblerange_func(anycompatiblearray, anycompatiblerange);
RESULT:
	postgres: function anycompatiblearray_anycompatiblerange_func(anycompatiblearray, anycompatiblerange) does not exist


-----------
QUERY:


-- should fail
create function bogus_func(anycompatible)
  returns anycompatiblerange as 'select int4range(1,10)' language sql;
RESULT:
	postgres: cannot determine result data type
DETAIL:  A result of type anycompatiblerange requires at least one input of type anycompatiblerange or anycompatiblemultirange.


-----------
QUERY:


--
-- Arrays of ranges
--

select ARRAY[numrange(1.1, 1.2), numrange(12.3, 155.5)];
RESULT:
	postgres: [([NumericRange(Decimal('1.1'), Decimal('1.2'), '[)'), NumericRange(Decimal('12.3'), Decimal('155.5'), '[)')],)]

-----------
QUERY:


create table i8r_array (f1 int, f2 int8range[]);
RESULT:
	postgres: None

-----------
QUERY:

insert into i8r_array values (42, array[int8range(1,10), int8range(2,20)]);
RESULT:
	postgres: None

-----------
QUERY:

select * from i8r_array;
RESULT:
	postgres: [(42, [NumericRange(1, 10, '[)'), NumericRange(2, 20, '[)')])]

-----------
QUERY:

drop table i8r_array;
RESULT:
	postgres: None

-----------
QUERY:


--
-- Ranges of arrays
--

create type arrayrange as range (subtype=int4[]);
RESULT:
	postgres: None

-----------
QUERY:


select arrayrange(ARRAY[1,2], ARRAY[2,1]);
RESULT:
	postgres: [('["{1,2}","{2,1}")',)]

-----------
QUERY:

select arrayrange(ARRAY[2,1], ARRAY[1,2]);
RESULT:
	postgres: range lower bound must be less than or equal to range upper bound


-----------
QUERY:
  -- fail

select array[1,1] <@ arrayrange(array[1,2], array[2,1]);
RESULT:
	postgres: [(False,)]

-----------
QUERY:

select array[1,3] <@ arrayrange(array[1,2], array[2,1]);
RESULT:
	postgres: [(True,)]

-----------
QUERY:


--
-- Ranges of composites
--

create type two_ints as (a int, b int);
RESULT:
	postgres: None

-----------
QUERY:

create type two_ints_range as range (subtype = two_ints);
RESULT:
	postgres: None

-----------
QUERY:


-- with debug_parallel_query on, this exercises tqueue.c/* REPLACED */''s range remapping
select *, row_to_json(upper(t)) as u from
  (values (two_ints_range(row(1,2), row(3,4))),
          (two_ints_range(row(5,6), row(7,8)))) v(t);
RESULT:
	postgres: [('["(1,2)","(3,4)")', {'a': 3, 'b': 4}), ('["(5,6)","(7,8)")', {'a': 7, 'b': 8})]

-----------
QUERY:


-- this must be rejected to avoid self-inclusion issues:
alter type two_ints add attribute c two_ints_range;
RESULT:
	postgres: composite type two_ints cannot be made a member of itself


-----------
QUERY:


drop type two_ints cascade;
RESULT:
	postgres: None

-----------
QUERY:


--
-- Check behavior when subtype lacks a hash function
--

create type varbitrange as range (subtype = varbit);
RESULT:
	postgres: None

-----------
QUERY:


set enable_sort = off;
RESULT:
	postgres: None

-----------
QUERY:
  -- try to make it pick a hash setop implementation

select '(01,10)'::varbitrange except select '(10,11)'::varbitrange;
RESULT:
	postgres: [('(01,10)',)]

-----------
QUERY:


reset enable_sort;
RESULT:
	postgres: None

-----------
QUERY:


--
-- OUT/INOUT/TABLE functions
--

-- infer anyrange from anyrange
create function outparam_succeed(i anyrange, out r anyrange, out t text)
  as $$ select $1, 'foo'::text $$ language sql;
RESULT:
	postgres: None

-----------
QUERY:


select * from outparam_succeed(int4range(1,2));
RESULT:
	postgres: [(NumericRange(1, 2, '[)'), 'foo')]

-----------
QUERY:


create function outparam2_succeed(r anyrange, out lu anyarray, out ul anyarray)
  as $$ select array[lower($1), upper($1)], array[upper($1), lower($1)] $$
  language sql;
RESULT:
	postgres: None

-----------
QUERY:


select * from outparam2_succeed(int4range(1,11));
RESULT:
	postgres: [([1, 11], [11, 1])]

-----------
QUERY:


-- infer anyarray from anyrange
create function outparam_succeed2(i anyrange, out r anyarray, out t text)
  as $$ select ARRAY[upper($1)], 'foo'::text $$ language sql;
RESULT:
	postgres: None

-----------
QUERY:


select * from outparam_succeed2(int4range(int4range(1,2)));
RESULT:
	postgres: [([2], 'foo')]

-----------
QUERY:


-- infer anyelement from anyrange
create function inoutparam_succeed(out i anyelement, inout r anyrange)
  as $$ select upper($1), $1 $$ language sql;
RESULT:
	postgres: None

-----------
QUERY:


select * from inoutparam_succeed(int4range(1,2));
RESULT:
	postgres: [(2, NumericRange(1, 2, '[)'))]

-----------
QUERY:


create function table_succeed(r anyrange)
  returns table(l anyelement, u anyelement)
  as $$ select lower($1), upper($1) $$
  language sql;
RESULT:
	postgres: None

-----------
QUERY:


select * from table_succeed(int4range(1,11));
RESULT:
	postgres: [(1, 11)]

-----------
QUERY:


-- should fail
create function outparam_fail(i anyelement, out r anyrange, out t text)
  as $$ select '[1,10]', 'foo' $$ language sql;
RESULT:
	postgres: cannot determine result data type
DETAIL:  A result of type anyrange requires at least one input of type anyrange or anymultirange.


-----------
QUERY:


--should fail
create function inoutparam_fail(inout i anyelement, out r anyrange)
  as $$ select $1, '[1,10]' $$ language sql;
RESULT:
	postgres: cannot determine result data type
DETAIL:  A result of type anyrange requires at least one input of type anyrange or anymultirange.


-----------
QUERY:


--should fail
create function table_fail(i anyelement) returns table(i anyelement, r anyrange)
  as $$ select $1, '[1,10]' $$ language sql;
RESULT:
	postgres: cannot determine result data type
DETAIL:  A result of type anyrange requires at least one input of type anyrange or anymultirange.


-----------
QUERY:


--
-- Test support functions
--

-- empty range
explain (verbose, costs off)
select current_date <@ daterange 'empty';
RESULT:
	postgres: [('Result',), ('  Output: false',)]

-----------
QUERY:


-- unbounded range
explain (verbose, costs off)
select current_date <@ daterange(NULL, NULL);
RESULT:
	postgres: [('Result',), ('  Output: true',)]

-----------
QUERY:


-- only lower bound present
explain (verbose, costs off)
select current_date <@ daterange('2000-01-01', NULL, '[)');
RESULT:
	postgres: [('Result',), ("  Output: (CURRENT_DATE >= '2000-01-01'::date)",)]

-----------
QUERY:


-- only upper bound present
explain (verbose, costs off)
select current_date <@ daterange(NULL, '2000-01-01', '(]');
RESULT:
	postgres: [('Result',), ("  Output: (CURRENT_DATE < '2000-01-02'::date)",)]

-----------
QUERY:


-- lower range /* REPLACED */''-Infinity/* REPLACED */'' excluded
explain (verbose, costs off)
select current_date <@ daterange('-Infinity', '1997-04-10'::date, '()');
RESULT:
	postgres: [('Result',), ("  Output: ((CURRENT_DATE > '-infinity'::date) AND (CURRENT_DATE < '1997-04-10'::date))",)]

-----------
QUERY:


-- lower range /* REPLACED */''-Infinity/* REPLACED */'' included
explain (verbose, costs off)
select current_date <@ daterange('-Infinity', '1997-04-10'::date, '[)');
RESULT:
	postgres: [('Result',), ("  Output: ((CURRENT_DATE >= '-infinity'::date) AND (CURRENT_DATE < '1997-04-10'::date))",)]

-----------
QUERY:


-- upper range /* REPLACED */''Infinity/* REPLACED */'' excluded
explain (verbose, costs off)
select current_date <@ daterange('2002-09-25'::date, 'Infinity', '[)');
RESULT:
	postgres: [('Result',), ("  Output: ((CURRENT_DATE >= '2002-09-25'::date) AND (CURRENT_DATE < 'infinity'::date))",)]

-----------
QUERY:


-- upper range /* REPLACED */''Infinity/* REPLACED */'' included
explain (verbose, costs off)
select current_date <@ daterange('2002-09-25'::date, 'Infinity', '[]');
RESULT:
	postgres: [('Result',), ("  Output: ((CURRENT_DATE >= '2002-09-25'::date) AND (CURRENT_DATE <= 'infinity'::date))",)]

-----------
QUERY:


-- should also work if we use /* REPLACED */''@>/* REPLACED */''
explain (verbose, costs off)
select daterange('-Infinity', '1997-04-10'::date, '()') @> current_date;
RESULT:
	postgres: [('Result',), ("  Output: ((CURRENT_DATE > '-infinity'::date) AND (CURRENT_DATE < '1997-04-10'::date))",)]

-----------
QUERY:


explain (verbose, costs off)
select daterange('2002-09-25'::date, 'Infinity', '[]') @> current_date;
RESULT:
	postgres: [('Result',), ("  Output: ((CURRENT_DATE >= '2002-09-25'::date) AND (CURRENT_DATE <= 'infinity'::date))",)]

-----------
QUERY:


-- Check that volatile cases are not optimized
explain (verbose, costs off)
select now() <@ tstzrange('2024-01-20 00:00', '2024-01-21 00:00');
RESULT:
	postgres: [('Result',), ("  Output: ((now() >= '2024-01-20 00:00:00+01'::timestamp with time zone) AND (now() < '2024-01-21 00:00:00+01'::timestamp with time zone))",)]

-----------
QUERY:

explain (verbose, costs off)  -- unsafe!
select clock_timestamp() <@ tstzrange('2024-01-20 00:00', '2024-01-21 00:00');
RESULT:
	postgres: [('Result',), ('  Output: (clock_timestamp() <@ \'["2024-01-20 00:00:00+01","2024-01-21 00:00:00+01")\'::tstzrange)',)]

-----------
QUERY:

explain (verbose, costs off)
select clock_timestamp() <@ tstzrange('2024-01-20 00:00', NULL);
RESULT:
	postgres: [('Result',), ("  Output: (clock_timestamp() >= '2024-01-20 00:00:00+01'::timestamp with time zone)",)]

-----------
QUERY:


-- test a custom range type with a non-default operator class
create type textrange_supp as range (
   subtype = text,
   subtype_opclass = text_pattern_ops
);
RESULT:
	postgres: None

-----------
QUERY:


create temp table text_support_test (t text collate "C");
RESULT:
	postgres: None

-----------
QUERY:


insert into text_support_test values ('a'), ('c'), ('d'), ('ch');
RESULT:
	postgres: None

-----------
QUERY:


explain (costs off)
select * from text_support_test where t <@ textrange_supp('a', 'd');
RESULT:
	postgres: [('Seq Scan on text_support_test',), ("  Filter: ((t ~>=~ 'a'::text) AND (t ~<~ 'd'::text))",)]

-----------
QUERY:

select * from text_support_test where t <@ textrange_supp('a', 'd');
RESULT:
	postgres: [('a',), ('c',), ('ch',)]

-----------
QUERY:


drop table text_support_test;
RESULT:
	postgres: None

-----------
QUERY:


drop type textrange_supp;
RESULT:
	postgres: None
