
-----------
QUERY:
--
-- INTERVAL
--

SET DATESTYLE = 'ISO';
RESULT:
	[]

-----------
QUERY:

SET IntervalStyle to postgres;
RESULT:
	[]

-----------
QUERY:


-- check acceptance of /* REPLACED */ ''time zone style/* REPLACED */ ''
SELECT INTERVAL '01:00' AS "One hour";
RESULT:
	[(datetime.timedelta(seconds=3600),)]

-----------
QUERY:

SELECT INTERVAL '+02:00' AS "Two hours";
RESULT:
	[(datetime.timedelta(seconds=7200),)]

-----------
QUERY:

SELECT INTERVAL '-08:00' AS "Eight hours";
RESULT:
	[(datetime.timedelta(days=-1, seconds=57600),)]

-----------
QUERY:

SELECT INTERVAL '-1 +02:03' AS "22 hours ago...";
RESULT:
	[(datetime.timedelta(days=-1, seconds=7380),)]

-----------
QUERY:

SELECT INTERVAL '-1 days +02:03' AS "22 hours ago...";
RESULT:
	[(datetime.timedelta(days=-1, seconds=7380),)]

-----------
QUERY:

SELECT INTERVAL '1.5 weeks' AS "Ten days twelve hours";
RESULT:
	[(datetime.timedelta(days=10, seconds=43200),)]

-----------
QUERY:

SELECT INTERVAL '1.5 months' AS "One month 15 days";
RESULT:
	[(datetime.timedelta(days=45),)]

-----------
QUERY:

SELECT INTERVAL '10 years -11 month -12 days +13:14' AS "9 years...";
RESULT:
	[(datetime.timedelta(days=3303, seconds=47640),)]

-----------
QUERY:

SELECT INTERVAL 'infinity' AS "eternity";
RESULT:
	[(datetime.timedelta(0),)]

-----------
QUERY:

SELECT INTERVAL '-infinity' AS "beginning of time";
RESULT:
	[(datetime.timedelta(0),)]

-----------
QUERY:


CREATE TABLE INTERVAL_TBL (f1 interval);
RESULT:
	[]

-----------
QUERY:


INSERT INTO INTERVAL_TBL (f1) VALUES ('@ 1 minute');
RESULT:
	[]

-----------
QUERY:

INSERT INTO INTERVAL_TBL (f1) VALUES ('@ 5 hour');
RESULT:
	[]

-----------
QUERY:

INSERT INTO INTERVAL_TBL (f1) VALUES ('@ 10 day');
RESULT:
	[]

-----------
QUERY:

INSERT INTO INTERVAL_TBL (f1) VALUES ('@ 34 year');
RESULT:
	[]

-----------
QUERY:

INSERT INTO INTERVAL_TBL (f1) VALUES ('@ 3 months');
RESULT:
	[]

-----------
QUERY:

INSERT INTO INTERVAL_TBL (f1) VALUES ('@ 14 seconds ago');
RESULT:
	[]

-----------
QUERY:

INSERT INTO INTERVAL_TBL (f1) VALUES ('1 day 2 hours 3 minutes 4 seconds');
RESULT:
	[]

-----------
QUERY:

INSERT INTO INTERVAL_TBL (f1) VALUES ('6 years');
RESULT:
	[]

-----------
QUERY:

INSERT INTO INTERVAL_TBL (f1) VALUES ('5 months');
RESULT:
	[]

-----------
QUERY:

INSERT INTO INTERVAL_TBL (f1) VALUES ('5 months 12 hours');
RESULT:
	[]

-----------
QUERY:

INSERT INTO INTERVAL_TBL (f1) VALUES ('infinity');
RESULT:
	[]

-----------
QUERY:

INSERT INTO INTERVAL_TBL (f1) VALUES ('-infinity');
RESULT:
	[]

-----------
QUERY:


-- badly formatted interval
INSERT INTO INTERVAL_TBL (f1) VALUES ('badly formatted interval');
RESULT:
	ERROR - invalid input syntax for type interval: "badly formatted interval"
LINE 4: INSERT INTO INTERVAL_TBL (f1) VALUES ('badly formatted inter...
                                              ^


-----------
QUERY:

INSERT INTO INTERVAL_TBL (f1) VALUES ('@ 30 eons ago');
RESULT:
	ERROR - invalid input syntax for type interval: "@ 30 eons ago"
LINE 2: INSERT INTO INTERVAL_TBL (f1) VALUES ('@ 30 eons ago');
                                              ^


-----------
QUERY:


-- Test non-error-throwing API
SELECT pg_input_is_valid('1.5 weeks', 'interval');
RESULT:
	[(True,)]

-----------
QUERY:

SELECT pg_input_is_valid('garbage', 'interval');
RESULT:
	[(False,)]

-----------
QUERY:

SELECT pg_input_is_valid('@ 30 eons ago', 'interval');
RESULT:
	[(False,)]

-----------
QUERY:

SELECT * FROM pg_input_error_info('garbage', 'interval');
RESULT:
	[('invalid input syntax for type interval: "garbage"', None, None, '22007')]

-----------
QUERY:

SELECT * FROM pg_input_error_info('@ 30 eons ago', 'interval');
RESULT:
	[('invalid input syntax for type interval: "@ 30 eons ago"', None, None, '22007')]

-----------
QUERY:


-- test interval operators

SELECT * FROM INTERVAL_TBL;
RESULT:
	[(datetime.timedelta(seconds=60),), (datetime.timedelta(seconds=18000),), (datetime.timedelta(days=10),), (datetime.timedelta(days=12410),), (datetime.timedelta(days=90),), (datetime.timedelta(days=-1, seconds=86386),), (datetime.timedelta(days=1, seconds=7384),), (datetime.timedelta(days=2190),), (datetime.timedelta(days=150),), (datetime.timedelta(days=150, seconds=43200),), (datetime.timedelta(0),), (datetime.timedelta(0),)]

-----------
QUERY:


SELECT * FROM INTERVAL_TBL
   WHERE INTERVAL_TBL.f1 <> interval '@ 10 days';
RESULT:
	[(datetime.timedelta(seconds=60),), (datetime.timedelta(seconds=18000),), (datetime.timedelta(days=12410),), (datetime.timedelta(days=90),), (datetime.timedelta(days=-1, seconds=86386),), (datetime.timedelta(days=1, seconds=7384),), (datetime.timedelta(days=2190),), (datetime.timedelta(days=150),), (datetime.timedelta(days=150, seconds=43200),), (datetime.timedelta(0),), (datetime.timedelta(0),)]

-----------
QUERY:


SELECT * FROM INTERVAL_TBL
   WHERE INTERVAL_TBL.f1 <= interval '@ 5 hours';
RESULT:
	[(datetime.timedelta(seconds=60),), (datetime.timedelta(seconds=18000),), (datetime.timedelta(days=-1, seconds=86386),), (datetime.timedelta(0),)]

-----------
QUERY:


SELECT * FROM INTERVAL_TBL
   WHERE INTERVAL_TBL.f1 < interval '@ 1 day';
RESULT:
	[(datetime.timedelta(seconds=60),), (datetime.timedelta(seconds=18000),), (datetime.timedelta(days=-1, seconds=86386),), (datetime.timedelta(0),)]

-----------
QUERY:


SELECT * FROM INTERVAL_TBL
   WHERE INTERVAL_TBL.f1 = interval '@ 34 years';
RESULT:
	[(datetime.timedelta(days=12410),)]

-----------
QUERY:


SELECT * FROM INTERVAL_TBL
   WHERE INTERVAL_TBL.f1 >= interval '@ 1 month';
RESULT:
	[(datetime.timedelta(days=12410),), (datetime.timedelta(days=90),), (datetime.timedelta(days=2190),), (datetime.timedelta(days=150),), (datetime.timedelta(days=150, seconds=43200),), (datetime.timedelta(0),)]

-----------
QUERY:


SELECT * FROM INTERVAL_TBL
   WHERE INTERVAL_TBL.f1 > interval '@ 3 seconds ago';
RESULT:
	[(datetime.timedelta(seconds=60),), (datetime.timedelta(seconds=18000),), (datetime.timedelta(days=10),), (datetime.timedelta(days=12410),), (datetime.timedelta(days=90),), (datetime.timedelta(days=1, seconds=7384),), (datetime.timedelta(days=2190),), (datetime.timedelta(days=150),), (datetime.timedelta(days=150, seconds=43200),), (datetime.timedelta(0),)]

-----------
QUERY:


SELECT r1.*, r2.*
   FROM INTERVAL_TBL r1, INTERVAL_TBL r2
   WHERE r1.f1 > r2.f1
   ORDER BY r1.f1, r2.f1;
RESULT:
	[(datetime.timedelta(days=-1, seconds=86386), datetime.timedelta(0)), (datetime.timedelta(seconds=60), datetime.timedelta(0)), (datetime.timedelta(seconds=60), datetime.timedelta(days=-1, seconds=86386)), (datetime.timedelta(seconds=18000), datetime.timedelta(0)), (datetime.timedelta(seconds=18000), datetime.timedelta(days=-1, seconds=86386)), (datetime.timedelta(seconds=18000), datetime.timedelta(seconds=60)), (datetime.timedelta(days=1, seconds=7384), datetime.timedelta(0)), (datetime.timedelta(days=1, seconds=7384), datetime.timedelta(days=-1, seconds=86386)), (datetime.timedelta(days=1, seconds=7384), datetime.timedelta(seconds=60)), (datetime.timedelta(days=1, seconds=7384), datetime.timedelta(seconds=18000)), (datetime.timedelta(days=10), datetime.timedelta(0)), (datetime.timedelta(days=10), datetime.timedelta(days=-1, seconds=86386)), (datetime.timedelta(days=10), datetime.timedelta(seconds=60)), (datetime.timedelta(days=10), datetime.timedelta(seconds=18000)), (datetime.timedelta(days=10), datetime.timedelta(days=1, seconds=7384)), (datetime.timedelta(days=90), datetime.timedelta(0)), (datetime.timedelta(days=90), datetime.timedelta(days=-1, seconds=86386)), (datetime.timedelta(days=90), datetime.timedelta(seconds=60)), (datetime.timedelta(days=90), datetime.timedelta(seconds=18000)), (datetime.timedelta(days=90), datetime.timedelta(days=1, seconds=7384)), (datetime.timedelta(days=90), datetime.timedelta(days=10)), (datetime.timedelta(days=150), datetime.timedelta(0)), (datetime.timedelta(days=150), datetime.timedelta(days=-1, seconds=86386)), (datetime.timedelta(days=150), datetime.timedelta(seconds=60)), (datetime.timedelta(days=150), datetime.timedelta(seconds=18000)), (datetime.timedelta(days=150), datetime.timedelta(days=1, seconds=7384)), (datetime.timedelta(days=150), datetime.timedelta(days=10)), (datetime.timedelta(days=150), datetime.timedelta(days=90)), (datetime.timedelta(days=150, seconds=43200), datetime.timedelta(0)), (datetime.timedelta(days=150, seconds=43200), datetime.timedelta(days=-1, seconds=86386)), (datetime.timedelta(days=150, seconds=43200), datetime.timedelta(seconds=60)), (datetime.timedelta(days=150, seconds=43200), datetime.timedelta(seconds=18000)), (datetime.timedelta(days=150, seconds=43200), datetime.timedelta(days=1, seconds=7384)), (datetime.timedelta(days=150, seconds=43200), datetime.timedelta(days=10)), (datetime.timedelta(days=150, seconds=43200), datetime.timedelta(days=90)), (datetime.timedelta(days=150, seconds=43200), datetime.timedelta(days=150)), (datetime.timedelta(days=2190), datetime.timedelta(0)), (datetime.timedelta(days=2190), datetime.timedelta(days=-1, seconds=86386)), (datetime.timedelta(days=2190), datetime.timedelta(seconds=60)), (datetime.timedelta(days=2190), datetime.timedelta(seconds=18000)), (datetime.timedelta(days=2190), datetime.timedelta(days=1, seconds=7384)), (datetime.timedelta(days=2190), datetime.timedelta(days=10)), (datetime.timedelta(days=2190), datetime.timedelta(days=90)), (datetime.timedelta(days=2190), datetime.timedelta(days=150)), (datetime.timedelta(days=2190), datetime.timedelta(days=150, seconds=43200)), (datetime.timedelta(days=12410), datetime.timedelta(0)), (datetime.timedelta(days=12410), datetime.timedelta(days=-1, seconds=86386)), (datetime.timedelta(days=12410), datetime.timedelta(seconds=60)), (datetime.timedelta(days=12410), datetime.timedelta(seconds=18000)), (datetime.timedelta(days=12410), datetime.timedelta(days=1, seconds=7384)), (datetime.timedelta(days=12410), datetime.timedelta(days=10)), (datetime.timedelta(days=12410), datetime.timedelta(days=90)), (datetime.timedelta(days=12410), datetime.timedelta(days=150)), (datetime.timedelta(days=12410), datetime.timedelta(days=150, seconds=43200)), (datetime.timedelta(days=12410), datetime.timedelta(days=2190)), (datetime.timedelta(0), datetime.timedelta(0)), (datetime.timedelta(0), datetime.timedelta(days=-1, seconds=86386)), (datetime.timedelta(0), datetime.timedelta(seconds=60)), (datetime.timedelta(0), datetime.timedelta(seconds=18000)), (datetime.timedelta(0), datetime.timedelta(days=1, seconds=7384)), (datetime.timedelta(0), datetime.timedelta(days=10)), (datetime.timedelta(0), datetime.timedelta(days=90)), (datetime.timedelta(0), datetime.timedelta(days=150)), (datetime.timedelta(0), datetime.timedelta(days=150, seconds=43200)), (datetime.timedelta(0), datetime.timedelta(days=2190)), (datetime.timedelta(0), datetime.timedelta(days=12410))]

-----------
QUERY:


-- test unary minus

SELECT f1, -f1 FROM INTERVAL_TBL;
RESULT:
	[(datetime.timedelta(seconds=60), datetime.timedelta(days=-1, seconds=86340)), (datetime.timedelta(seconds=18000), datetime.timedelta(days=-1, seconds=68400)), (datetime.timedelta(days=10), datetime.timedelta(days=-10)), (datetime.timedelta(days=12410), datetime.timedelta(days=-12410)), (datetime.timedelta(days=90), datetime.timedelta(days=-90)), (datetime.timedelta(days=-1, seconds=86386), datetime.timedelta(seconds=14)), (datetime.timedelta(days=1, seconds=7384), datetime.timedelta(days=-2, seconds=79016)), (datetime.timedelta(days=2190), datetime.timedelta(days=-2190)), (datetime.timedelta(days=150), datetime.timedelta(days=-150)), (datetime.timedelta(days=150, seconds=43200), datetime.timedelta(days=-151, seconds=43200)), (datetime.timedelta(0), datetime.timedelta(0)), (datetime.timedelta(0), datetime.timedelta(0))]

-----------
QUERY:

SELECT -('-2147483648 months'::interval);
RESULT:
	ERROR - interval out of range


-----------
QUERY:
 -- should fail
SELECT -('-2147483647 months'::interval);
RESULT:
	ERROR - Python int too large to convert to C int

-----------
QUERY:
 -- ok
SELECT -('-2147483648 days'::interval);
RESULT:
	ERROR - interval out of range


-----------
QUERY:
 -- should fail
SELECT -('-2147483647 days'::interval);
RESULT:
	ERROR - days=2147483647; must have magnitude <= 999999999

-----------
QUERY:
 -- ok
SELECT -('-9223372036854775808 us'::interval);
RESULT:
	ERROR - interval out of range


-----------
QUERY:
 -- should fail
SELECT -('-9223372036854775807 us'::interval);
RESULT:
	ERROR - interval component too big

-----------
QUERY:
 -- ok
SELECT -('-2147483647 months -2147483647 days -9223372036854775807 us'::interval);
RESULT:
	ERROR - interval out of range


-----------
QUERY:
 -- should fail

-- Test intervals that are large enough to overflow 64 bits in comparisons
CREATE TEMP TABLE INTERVAL_TBL_OF (f1 interval);
RESULT:
	[]

-----------
QUERY:

INSERT INTO INTERVAL_TBL_OF (f1) VALUES
  ('2147483647 days 2147483647 months'),
  ('2147483647 days -2147483648 months'),
  ('1 year'),
  ('-2147483648 days 2147483647 months'),
  ('-2147483648 days -2147483648 months');
RESULT:
	[]

-----------
QUERY:

-- these should fail as out-of-range
INSERT INTO INTERVAL_TBL_OF (f1) VALUES ('2147483648 days');
RESULT:
	ERROR - interval field value out of range: "2147483648 days"
LINE 3: INSERT INTO INTERVAL_TBL_OF (f1) VALUES ('2147483648 days');
                                                 ^


-----------
QUERY:

INSERT INTO INTERVAL_TBL_OF (f1) VALUES ('-2147483649 days');
RESULT:
	ERROR - interval field value out of range: "-2147483649 days"
LINE 2: INSERT INTO INTERVAL_TBL_OF (f1) VALUES ('-2147483649 days')...
                                                 ^


-----------
QUERY:

INSERT INTO INTERVAL_TBL_OF (f1) VALUES ('2147483647 years');
RESULT:
	ERROR - interval out of range
LINE 2: INSERT INTO INTERVAL_TBL_OF (f1) VALUES ('2147483647 years')...
                                                 ^


-----------
QUERY:

INSERT INTO INTERVAL_TBL_OF (f1) VALUES ('-2147483648 years');
RESULT:
	ERROR - interval out of range
LINE 2: INSERT INTO INTERVAL_TBL_OF (f1) VALUES ('-2147483648 years'...
                                                 ^


-----------
QUERY:


-- Test edge-case overflow detection in interval multiplication
select extract(epoch from '256 microseconds'::interval * (2^55)::float8);
RESULT:
	ERROR - interval out of range


-----------
QUERY:


SELECT r1.*, r2.*
   FROM INTERVAL_TBL_OF r1, INTERVAL_TBL_OF r2
   WHERE r1.f1 > r2.f1
   ORDER BY r1.f1, r2.f1;
RESULT:
	ERROR - Python int too large to convert to C int

-----------
QUERY:


CREATE INDEX ON INTERVAL_TBL_OF USING btree (f1);
RESULT:
	[]

-----------
QUERY:

SET enable_seqscan TO false;
RESULT:
	[]

-----------
QUERY:

EXPLAIN (COSTS OFF)
SELECT f1 FROM INTERVAL_TBL_OF r1 ORDER BY f1;
RESULT:
	[('Index Only Scan using interval_tbl_of_f1_idx on interval_tbl_of r1',)]

-----------
QUERY:

SELECT f1 FROM INTERVAL_TBL_OF r1 ORDER BY f1;
RESULT:
	ERROR - interval component too big

-----------
QUERY:

RESET enable_seqscan;
RESULT:
	[]

-----------
QUERY:


-- subtracting about-to-overflow values should result in 0
SELECT f1 - f1 FROM INTERVAL_TBL_OF;
RESULT:
	[(datetime.timedelta(0),), (datetime.timedelta(0),), (datetime.timedelta(0),), (datetime.timedelta(0),), (datetime.timedelta(0),)]

-----------
QUERY:


DROP TABLE INTERVAL_TBL_OF;
RESULT:
	[]

-----------
QUERY:


-- Test multiplication and division with intervals.
-- Floating point arithmetic rounding errors can lead to unexpected results,
-- though the code attempts to do the right thing and round up to days and
-- minutes to avoid results such as /* REPLACED */ ''3 days 24:00 hours/* REPLACED */ '' or /* REPLACED */ ''14:20:60/* REPLACED */ ''.
-- Note that it is expected for some day components to be greater than 29 and
-- some time components be greater than 23:59:59 due to how intervals are
-- stored internally.

CREATE TABLE INTERVAL_MULDIV_TBL (span interval);
RESULT:
	[]

-----------
QUERY:

COPY INTERVAL_MULDIV_TBL FROM STDIN;
RESULT:
	ERROR - can't execute COPY FROM: use the copy_from() method instead

-----------
QUERY:

41 mon 12 days 360:00
-41 mon -12 days +360:00
-12 days
9 mon -27 days 12:34:56
-3 years 482 days 76:54:32.189
4 mon
14 mon
999 mon 999 days
-- \.

SELECT span * 0.3 AS product
FROM INTERVAL_MULDIV_TBL;
RESULT:
	ERROR - syntax error at or near "41"
LINE 2: 41 mon 12 days 360:00
        ^


-----------
QUERY:


SELECT span * 8.2 AS product
FROM INTERVAL_MULDIV_TBL;
RESULT:
	[]

-----------
QUERY:


SELECT span / 10 AS quotient
FROM INTERVAL_MULDIV_TBL;
RESULT:
	[]

-----------
QUERY:


SELECT span / 100 AS quotient
FROM INTERVAL_MULDIV_TBL;
RESULT:
	[]

-----------
QUERY:


DROP TABLE INTERVAL_MULDIV_TBL;
RESULT:
	[]

-----------
QUERY:


SET DATESTYLE = 'postgres';
RESULT:
	[]

-----------
QUERY:

SET IntervalStyle to postgres_verbose;
RESULT:
	[]

-----------
QUERY:


SELECT * FROM INTERVAL_TBL;
RESULT:
	ERROR - invalid literal for int() with base 10: '@ 5 hours'

-----------
QUERY:


-- multiplication and division overflow test cases
SELECT '3000000 months'::interval * 1000;
RESULT:
	ERROR - interval out of range


-----------
QUERY:

SELECT '3000000 months'::interval / 0.001;
RESULT:
	ERROR - interval out of range


-----------
QUERY:

SELECT '3000000 days'::interval * 1000;
RESULT:
	ERROR - interval out of range


-----------
QUERY:

SELECT '3000000 days'::interval / 0.001;
RESULT:
	ERROR - interval out of range


-----------
QUERY:

SELECT '1 month 2146410 days'::interval * 1000.5002;
RESULT:
	ERROR - interval out of range


-----------
QUERY:

SELECT '4611686018427387904 usec'::interval / 0.1;
RESULT:
	ERROR - interval out of range


-----------
QUERY:


-- test avg(interval), which is somewhat fragile since people have been
-- known to change the allowed input syntax for type interval without
-- updating pg_aggregate.agginitval

select avg(f1) from interval_tbl where isfinite(f1);
RESULT:
	[(datetime.timedelta(days=1500),)]

-----------
QUERY:


-- test long interval input
select '4 millenniums 5 centuries 4 decades 1 year 4 months 4 days 17 minutes 31 seconds'::interval;
RESULT:
	[(datetime.timedelta(days=1657589),)]

-----------
QUERY:


-- test long interval output
-- Note: the actual maximum length of the interval output is longer,
-- but we need the test to work for both integer and floating-point
-- timestamps.
select '100000000y 10mon -1000000000d -100000h -10min -10.000001s ago'::interval;
RESULT:
	ERROR - interval component too big

-----------
QUERY:


-- test justify_hours() and justify_days()

SELECT justify_hours(interval '6 months 3 days 52 hours 3 minutes 2 seconds') as "6 mons 5 days 4 hours 3 mins 2 seconds";
RESULT:
	[(datetime.timedelta(days=185),)]

-----------
QUERY:

SELECT justify_days(interval '6 months 36 days 5 hours 4 minutes 3 seconds') as "7 mons 6 days 5 hours 4 mins 3 seconds";
RESULT:
	[(datetime.timedelta(days=216),)]

-----------
QUERY:


SELECT justify_hours(interval '2147483647 days 24 hrs');
RESULT:
	ERROR - interval out of range


-----------
QUERY:

SELECT justify_days(interval '2147483647 months 30 days');
RESULT:
	ERROR - interval out of range


-----------
QUERY:


-- test justify_interval()

SELECT justify_interval(interval '1 month -1 hour') as "1 month -1 hour";
RESULT:
	[(datetime.timedelta(days=29),)]

-----------
QUERY:


SELECT justify_interval(interval '2147483647 days 24 hrs');
RESULT:
	ERROR - Python int too large to convert to C int

-----------
QUERY:

SELECT justify_interval(interval '-2147483648 days -24 hrs');
RESULT:
	ERROR - Python int too large to convert to C int

-----------
QUERY:

SELECT justify_interval(interval '2147483647 months 30 days');
RESULT:
	ERROR - interval out of range


-----------
QUERY:

SELECT justify_interval(interval '-2147483648 months -30 days');
RESULT:
	ERROR - interval out of range


-----------
QUERY:

SELECT justify_interval(interval '2147483647 months 30 days -24 hrs');
RESULT:
	ERROR - Python int too large to convert to C int

-----------
QUERY:

SELECT justify_interval(interval '-2147483648 months -30 days 24 hrs');
RESULT:
	ERROR - Python int too large to convert to C int

-----------
QUERY:

SELECT justify_interval(interval '2147483647 months -30 days 1440 hrs');
RESULT:
	ERROR - interval out of range


-----------
QUERY:

SELECT justify_interval(interval '-2147483648 months 30 days -1440 hrs');
RESULT:
	ERROR - interval out of range


-----------
QUERY:


-- test fractional second input, and detection of duplicate units
SET DATESTYLE = 'ISO';
RESULT:
	[]

-----------
QUERY:

SET IntervalStyle TO postgres;
RESULT:
	[]

-----------
QUERY:


SELECT '1 millisecond'::interval, '1 microsecond'::interval,
       '500 seconds 99 milliseconds 51 microseconds'::interval;
RESULT:
	[(datetime.timedelta(microseconds=1000), datetime.timedelta(microseconds=1), datetime.timedelta(seconds=500, microseconds=99051))]

-----------
QUERY:

SELECT '3 days 5 milliseconds'::interval;
RESULT:
	[(datetime.timedelta(days=3, microseconds=5000),)]

-----------
QUERY:


SELECT '1 second 2 seconds'::interval;
RESULT:
	ERROR - invalid input syntax for type interval: "1 second 2 seconds"
LINE 3: SELECT '1 second 2 seconds'::interval;
               ^


-----------
QUERY:
              -- error
SELECT '10 milliseconds 20 milliseconds'::interval;
RESULT:
	ERROR - invalid input syntax for type interval: "10 milliseconds 20 milliseconds"
LINE 2: SELECT '10 milliseconds 20 milliseconds'::interval;
               ^


-----------
QUERY:
 -- error
SELECT '5.5 seconds 3 milliseconds'::interval;
RESULT:
	ERROR - invalid input syntax for type interval: "5.5 seconds 3 milliseconds"
LINE 2: SELECT '5.5 seconds 3 milliseconds'::interval;
               ^


-----------
QUERY:
      -- error
SELECT '1:20:05 5 microseconds'::interval;
RESULT:
	ERROR - invalid input syntax for type interval: "1:20:05 5 microseconds"
LINE 2: SELECT '1:20:05 5 microseconds'::interval;
               ^


-----------
QUERY:
          -- error
SELECT '1 day 1 day'::interval;
RESULT:
	ERROR - invalid input syntax for type interval: "1 day 1 day"
LINE 2: SELECT '1 day 1 day'::interval;
               ^


-----------
QUERY:
                     -- error
SELECT interval '1-2';
RESULT:
	[(datetime.timedelta(days=425),)]

-----------
QUERY:
  -- SQL year-month literal
SELECT interval '999' second;
RESULT:
	[(datetime.timedelta(seconds=999),)]

-----------
QUERY:
  -- oversize leading field is ok
SELECT interval '999' minute;
RESULT:
	[(datetime.timedelta(seconds=59940),)]

-----------
QUERY:

SELECT interval '999' hour;
RESULT:
	[(datetime.timedelta(days=41, seconds=54000),)]

-----------
QUERY:

SELECT interval '999' day;
RESULT:
	[(datetime.timedelta(days=999),)]

-----------
QUERY:

SELECT interval '999' month;
RESULT:
	[(datetime.timedelta(days=30385),)]

-----------
QUERY:


-- test SQL-spec syntaxes for restricted field sets
SELECT interval '1' year;
RESULT:
	[(datetime.timedelta(days=365),)]

-----------
QUERY:

SELECT interval '2' month;
RESULT:
	[(datetime.timedelta(days=60),)]

-----------
QUERY:

SELECT interval '3' day;
RESULT:
	[(datetime.timedelta(days=3),)]

-----------
QUERY:

SELECT interval '4' hour;
RESULT:
	[(datetime.timedelta(seconds=14400),)]

-----------
QUERY:

SELECT interval '5' minute;
RESULT:
	[(datetime.timedelta(seconds=300),)]

-----------
QUERY:

SELECT interval '6' second;
RESULT:
	[(datetime.timedelta(seconds=6),)]

-----------
QUERY:

SELECT interval '1' year to month;
RESULT:
	[(datetime.timedelta(days=30),)]

-----------
QUERY:

SELECT interval '1-2' year to month;
RESULT:
	[(datetime.timedelta(days=425),)]

-----------
QUERY:

SELECT interval '1 2' day to hour;
RESULT:
	[(datetime.timedelta(days=1, seconds=7200),)]

-----------
QUERY:

SELECT interval '1 2:03' day to hour;
RESULT:
	[(datetime.timedelta(days=1, seconds=7200),)]

-----------
QUERY:

SELECT interval '1 2:03:04' day to hour;
RESULT:
	[(datetime.timedelta(days=1, seconds=7200),)]

-----------
QUERY:

SELECT interval '1 2' day to minute;
RESULT:
	ERROR - invalid input syntax for type interval: "1 2"
LINE 2: SELECT interval '1 2' day to minute;
                        ^


-----------
QUERY:

SELECT interval '1 2:03' day to minute;
RESULT:
	[(datetime.timedelta(days=1, seconds=7380),)]

-----------
QUERY:

SELECT interval '1 2:03:04' day to minute;
RESULT:
	[(datetime.timedelta(days=1, seconds=7380),)]

-----------
QUERY:

SELECT interval '1 2' day to second;
RESULT:
	ERROR - invalid input syntax for type interval: "1 2"
LINE 2: SELECT interval '1 2' day to second;
                        ^


-----------
QUERY:

SELECT interval '1 2:03' day to second;
RESULT:
	[(datetime.timedelta(days=1, seconds=7380),)]

-----------
QUERY:

SELECT interval '1 2:03:04' day to second;
RESULT:
	[(datetime.timedelta(days=1, seconds=7384),)]

-----------
QUERY:

SELECT interval '1 2' hour to minute;
RESULT:
	ERROR - invalid input syntax for type interval: "1 2"
LINE 2: SELECT interval '1 2' hour to minute;
                        ^


-----------
QUERY:

SELECT interval '1 2:03' hour to minute;
RESULT:
	[(datetime.timedelta(days=1, seconds=7380),)]

-----------
QUERY:

SELECT interval '1 2:03:04' hour to minute;
RESULT:
	[(datetime.timedelta(days=1, seconds=7380),)]

-----------
QUERY:

SELECT interval '1 2' hour to second;
RESULT:
	ERROR - invalid input syntax for type interval: "1 2"
LINE 2: SELECT interval '1 2' hour to second;
                        ^


-----------
QUERY:

SELECT interval '1 2:03' hour to second;
RESULT:
	[(datetime.timedelta(days=1, seconds=7380),)]

-----------
QUERY:

SELECT interval '1 2:03:04' hour to second;
RESULT:
	[(datetime.timedelta(days=1, seconds=7384),)]

-----------
QUERY:

SELECT interval '1 2' minute to second;
RESULT:
	ERROR - invalid input syntax for type interval: "1 2"
LINE 2: SELECT interval '1 2' minute to second;
                        ^


-----------
QUERY:

SELECT interval '1 2:03' minute to second;
RESULT:
	[(datetime.timedelta(days=1, seconds=123),)]

-----------
QUERY:

SELECT interval '1 2:03:04' minute to second;
RESULT:
	[(datetime.timedelta(days=1, seconds=7384),)]

-----------
QUERY:

SELECT interval '1 +2:03' minute to second;
RESULT:
	[(datetime.timedelta(days=1, seconds=123),)]

-----------
QUERY:

SELECT interval '1 +2:03:04' minute to second;
RESULT:
	[(datetime.timedelta(days=1, seconds=7384),)]

-----------
QUERY:

SELECT interval '1 -2:03' minute to second;
RESULT:
	[(datetime.timedelta(seconds=86277),)]

-----------
QUERY:

SELECT interval '1 -2:03:04' minute to second;
RESULT:
	[(datetime.timedelta(seconds=79016),)]

-----------
QUERY:

SELECT interval '123 11' day to hour;
RESULT:
	[(datetime.timedelta(days=123, seconds=39600),)]

-----------
QUERY:
 -- ok
SELECT interval '123 11' day;
RESULT:
	ERROR - invalid input syntax for type interval: "123 11"
LINE 2: SELECT interval '123 11' day;
                        ^


-----------
QUERY:
 -- not ok
SELECT interval '123 11';
RESULT:
	ERROR - invalid input syntax for type interval: "123 11"
LINE 2: SELECT interval '123 11';
                        ^


-----------
QUERY:
 -- not ok, too ambiguous
SELECT interval '123 2:03 -2:04';
RESULT:
	ERROR - invalid input syntax for type interval: "123 2:03 -2:04"
LINE 2: SELECT interval '123 2:03 -2:04';
                        ^


-----------
QUERY:
 -- not ok, redundant hh:mm fields

-- test syntaxes for restricted precision
SELECT interval(0) '1 day 01:23:45.6789';
RESULT:
	[(datetime.timedelta(days=1, seconds=5026),)]

-----------
QUERY:

SELECT interval(2) '1 day 01:23:45.6789';
RESULT:
	[(datetime.timedelta(days=1, seconds=5025, microseconds=680000),)]

-----------
QUERY:

SELECT interval '12:34.5678' minute to second(2);
RESULT:
	[(datetime.timedelta(seconds=754, microseconds=570000),)]

-----------
QUERY:
  -- per SQL spec
SELECT interval '1.234' second;
RESULT:
	[(datetime.timedelta(seconds=1, microseconds=234000),)]

-----------
QUERY:

SELECT interval '1.234' second(2);
RESULT:
	[(datetime.timedelta(seconds=1, microseconds=230000),)]

-----------
QUERY:

SELECT interval '1 2.345' day to second(2);
RESULT:
	ERROR - invalid input syntax for type interval: "1 2.345"
LINE 2: SELECT interval '1 2.345' day to second(2);
                        ^


-----------
QUERY:

SELECT interval '1 2:03' day to second(2);
RESULT:
	[(datetime.timedelta(days=1, seconds=7380),)]

-----------
QUERY:

SELECT interval '1 2:03.4567' day to second(2);
RESULT:
	[(datetime.timedelta(days=1, seconds=123, microseconds=460000),)]

-----------
QUERY:

SELECT interval '1 2:03:04.5678' day to second(2);
RESULT:
	[(datetime.timedelta(days=1, seconds=7384, microseconds=570000),)]

-----------
QUERY:

SELECT interval '1 2.345' hour to second(2);
RESULT:
	ERROR - invalid input syntax for type interval: "1 2.345"
LINE 2: SELECT interval '1 2.345' hour to second(2);
                        ^


-----------
QUERY:

SELECT interval '1 2:03.45678' hour to second(2);
RESULT:
	[(datetime.timedelta(days=1, seconds=123, microseconds=460000),)]

-----------
QUERY:

SELECT interval '1 2:03:04.5678' hour to second(2);
RESULT:
	[(datetime.timedelta(days=1, seconds=7384, microseconds=570000),)]

-----------
QUERY:

SELECT interval '1 2.3456' minute to second(2);
RESULT:
	ERROR - invalid input syntax for type interval: "1 2.3456"
LINE 2: SELECT interval '1 2.3456' minute to second(2);
                        ^


-----------
QUERY:

SELECT interval '1 2:03.5678' minute to second(2);
RESULT:
	[(datetime.timedelta(days=1, seconds=123, microseconds=570000),)]

-----------
QUERY:

SELECT interval '1 2:03:04.5678' minute to second(2);
RESULT:
	[(datetime.timedelta(days=1, seconds=7384, microseconds=570000),)]

-----------
QUERY:

SELECT interval '2562047788:00:54.775807' second(2);
RESULT:
	ERROR - interval out of range
LINE 2: SELECT interval '2562047788:00:54.775807' second(2);
                        ^


-----------
QUERY:
  -- out of range
SELECT interval '-2562047788:00:54.775807' second(2);
RESULT:
	ERROR - interval out of range
LINE 2: SELECT interval '-2562047788:00:54.775807' second(2);
                        ^


-----------
QUERY:
  -- out of range

-- test casting to restricted precision (bug #14479)
SELECT f1, f1::INTERVAL DAY TO MINUTE AS "minutes",
  (f1 + INTERVAL '1 month')::INTERVAL MONTH::INTERVAL YEAR AS "years"
  FROM interval_tbl;
RESULT:
	[(datetime.timedelta(seconds=60), datetime.timedelta(seconds=60), datetime.timedelta(0)), (datetime.timedelta(seconds=18000), datetime.timedelta(seconds=18000), datetime.timedelta(0)), (datetime.timedelta(days=10), datetime.timedelta(days=10), datetime.timedelta(0)), (datetime.timedelta(days=12410), datetime.timedelta(days=12410), datetime.timedelta(days=12410)), (datetime.timedelta(days=90), datetime.timedelta(days=90), datetime.timedelta(0)), (datetime.timedelta(days=-1, seconds=86386), datetime.timedelta(0), datetime.timedelta(0)), (datetime.timedelta(days=1, seconds=7384), datetime.timedelta(days=1, seconds=7380), datetime.timedelta(0)), (datetime.timedelta(days=2190), datetime.timedelta(days=2190), datetime.timedelta(days=2190)), (datetime.timedelta(days=150), datetime.timedelta(days=150), datetime.timedelta(0)), (datetime.timedelta(days=150, seconds=43200), datetime.timedelta(days=150, seconds=43200), datetime.timedelta(0)), (datetime.timedelta(0), datetime.timedelta(0), datetime.timedelta(0)), (datetime.timedelta(0), datetime.timedelta(0), datetime.timedelta(0))]

-----------
QUERY:


-- test inputting and outputting SQL standard interval literals
SET IntervalStyle TO sql_standard;
RESULT:
	[]

-----------
QUERY:

SELECT  interval '0'                       AS "zero",
        interval '1-2' year to month       AS "year-month",
        interval '1 2:03:04' day to second AS "day-time",
        - interval '1-2'                   AS "negative year-month",
        - interval '1 2:03:04'             AS "negative day-time";
RESULT:
	ERROR - invalid literal for int() with base 10: '1-2'

-----------
QUERY:


-- test input of some not-quite-standard interval values in the sql style
SET IntervalStyle TO postgres;
RESULT:
	[]

-----------
QUERY:

SELECT  interval '+1 -1:00:00',
        interval '-1 +1:00:00',
        interval '+1-2 -3 +4:05:06.789',
        interval '-1-2 +3 -4:05:06.789';
RESULT:
	[(datetime.timedelta(seconds=82800), datetime.timedelta(days=-1, seconds=3600), datetime.timedelta(days=422, seconds=14706, microseconds=789000), datetime.timedelta(days=-423, seconds=71693, microseconds=211000))]

-----------
QUERY:


-- cases that trigger sign-matching rules in the sql style
SELECT  interval '-23 hours 45 min 12.34 sec',
        interval '-1 day 23 hours 45 min 12.34 sec',
        interval '-1 year 2 months 1 day 23 hours 45 min 12.34 sec',
        interval '-1 year 2 months 1 day 23 hours 45 min +12.34 sec';
RESULT:
	[(datetime.timedelta(days=-1, seconds=6312, microseconds=340000), datetime.timedelta(days=-1, seconds=85512, microseconds=340000), datetime.timedelta(days=-299, seconds=85512, microseconds=340000), datetime.timedelta(days=-299, seconds=85512, microseconds=340000))]

-----------
QUERY:


-- test output of couple non-standard interval values in the sql style
SET IntervalStyle TO sql_standard;
RESULT:
	[]

-----------
QUERY:

SELECT  interval '1 day -1 hours',
        interval '-1 days +1 hours',
        interval '1 years 2 months -3 days 4 hours 5 minutes 6.789 seconds',
        - interval '1 years 2 months -3 days 4 hours 5 minutes 6.789 seconds';
RESULT:
	[(datetime.timedelta(days=-1, seconds=46800), datetime.timedelta(days=-1, seconds=46800), datetime.timedelta(days=-52, seconds=50093, microseconds=211000), datetime.timedelta(days=-52, seconds=50093, microseconds=211000))]

-----------
QUERY:


-- cases that trigger sign-matching rules in the sql style
SELECT  interval '-23 hours 45 min 12.34 sec',
        interval '-1 day 23 hours 45 min 12.34 sec',
        interval '-1 year 2 months 1 day 23 hours 45 min 12.34 sec',
        interval '-1 year 2 months 1 day 23 hours 45 min +12.34 sec';
RESULT:
	[(datetime.timedelta(days=-1, seconds=887, microseconds=660000), datetime.timedelta(days=-6, seconds=72887, microseconds=660000), datetime.timedelta(days=-506, seconds=72887, microseconds=660000), datetime.timedelta(days=-422, seconds=15287, microseconds=660000))]

-----------
QUERY:


-- edge case for sign-matching rules
SELECT  interval '';
RESULT:
	ERROR - invalid input syntax for type interval: ""
LINE 4: SELECT  interval '';
                         ^


-----------
QUERY:
  -- error

-- test outputting iso8601 intervals
SET IntervalStyle to iso_8601;
RESULT:
	[]

-----------
QUERY:

select  interval '0'                                AS "zero",
        interval '1-2'                              AS "a year 2 months",
        interval '1 2:03:04'                        AS "a bit over a day",
        interval '2:03:04.45679'                    AS "a bit over 2 hours",
        (interval '1-2' + interval '3 4:05:06.7')   AS "all fields",
        (interval '1-2' - interval '3 4:05:06.7')   AS "mixed sign",
        (- interval '1-2' + interval '3 4:05:06.7') AS "negative";
RESULT:
	ERROR - iso_8601 intervalstyle currently not supported

-----------
QUERY:


-- test inputting ISO 8601 4.4.2.1 /* REPLACED */ ''Format With Time Unit Designators/* REPLACED */ ''
SET IntervalStyle to sql_standard;
RESULT:
	[]

-----------
QUERY:

select  interval 'P0Y'                    AS "zero",
        interval 'P1Y2M'                  AS "a year 2 months",
        interval 'P1W'                    AS "a week",
        interval 'P1DT2H3M4S'             AS "a bit over a day",
        interval 'P1Y2M3DT4H5M6.7S'       AS "all fields",
        interval 'P-1Y-2M-3DT-4H-5M-6.7S' AS "negative",
        interval 'PT-0.1S'                AS "fractional second";
RESULT:
	ERROR - invalid literal for int() with base 10: '1-2'

-----------
QUERY:


-- test inputting ISO 8601 4.4.2.2 /* REPLACED */ ''Alternative Format/* REPLACED */ ''
SET IntervalStyle to postgres;
RESULT:
	[]

-----------
QUERY:

select  interval 'P00021015T103020'       AS "ISO8601 Basic Format",
        interval 'P0002-10-15T10:30:20'   AS "ISO8601 Extended Format";
RESULT:
	[(datetime.timedelta(days=1045, seconds=37820), datetime.timedelta(days=1045, seconds=37820))]

-----------
QUERY:


-- Make sure optional ISO8601 alternative format fields are optional.
select  interval 'P0002'                  AS "year only",
        interval 'P0002-10'               AS "year month",
        interval 'P0002-10-15'            AS "year month day",
        interval 'P0002T1S'               AS "year only plus time",
        interval 'P0002-10T1S'            AS "year month plus time",
        interval 'P0002-10-15T1S'         AS "year month day plus time",
        interval 'PT10'                   AS "hour only",
        interval 'PT10:30'                AS "hour minute";
RESULT:
	[(datetime.timedelta(days=730), datetime.timedelta(days=1030), datetime.timedelta(days=1045), datetime.timedelta(days=730, seconds=1), datetime.timedelta(days=1030, seconds=1), datetime.timedelta(days=1045, seconds=1), datetime.timedelta(seconds=36000), datetime.timedelta(seconds=37800))]

-----------
QUERY:


-- Check handling of fractional fields in ISO8601 format.
select interval 'P1Y0M3DT4H5M6S';
RESULT:
	[(datetime.timedelta(days=368, seconds=14706),)]

-----------
QUERY:

select interval 'P1.0Y0M3DT4H5M6S';
RESULT:
	[(datetime.timedelta(days=368, seconds=14706),)]

-----------
QUERY:

select interval 'P1.1Y0M3DT4H5M6S';
RESULT:
	[(datetime.timedelta(days=398, seconds=14706),)]

-----------
QUERY:

select interval 'P1.Y0M3DT4H5M6S';
RESULT:
	[(datetime.timedelta(days=368, seconds=14706),)]

-----------
QUERY:

select interval 'P.1Y0M3DT4H5M6S';
RESULT:
	[(datetime.timedelta(days=33, seconds=14706),)]

-----------
QUERY:

select interval 'P10.5e4Y';
RESULT:
	[(datetime.timedelta(days=38325000),)]

-----------
QUERY:
  -- not per spec, but we/* REPLACED */ ''ve historically taken it
select interval 'P.Y0M3DT4H5M6S';
RESULT:
	ERROR - invalid input syntax for type interval: "P.Y0M3DT4H5M6S"
LINE 2: select interval 'P.Y0M3DT4H5M6S';
                        ^


-----------
QUERY:
  -- error

-- test a couple rounding cases that changed since 8.3 w/ HAVE_INT64_TIMESTAMP.
SET IntervalStyle to postgres_verbose;
RESULT:
	[]

-----------
QUERY:

select interval '-10 mons -3 days +03:55:06.70';
RESULT:
	[(datetime.timedelta(days=303),)]

-----------
QUERY:

select interval '1 year 2 mons 3 days 04:05:06.699999';
RESULT:
	[(datetime.timedelta(days=428),)]

-----------
QUERY:

select interval '0:0:0.7', interval '@ 0.70 secs', interval '0.7 seconds';
RESULT:
	ERROR - invalid literal for int() with base 10: '@ 0.7 secs'

-----------
QUERY:


-- test time fields using entire 64 bit microseconds range
select interval '2562047788.01521550194 hours';
RESULT:
	ERROR - interval component too big

-----------
QUERY:

select interval '-2562047788.01521550222 hours';
RESULT:
	ERROR - interval component too big

-----------
QUERY:

select interval '153722867280.912930117 minutes';
RESULT:
	ERROR - interval component too big

-----------
QUERY:

select interval '-153722867280.912930133 minutes';
RESULT:
	ERROR - interval component too big

-----------
QUERY:

select interval '9223372036854.775807 seconds';
RESULT:
	ERROR - interval component too big

-----------
QUERY:

select interval '-9223372036854.775808 seconds';
RESULT:
	ERROR - interval component too big

-----------
QUERY:

select interval '9223372036854775.807 milliseconds';
RESULT:
	ERROR - interval component too big

-----------
QUERY:

select interval '-9223372036854775.808 milliseconds';
RESULT:
	ERROR - interval component too big

-----------
QUERY:

select interval '9223372036854775807 microseconds';
RESULT:
	ERROR - interval component too big

-----------
QUERY:

select interval '-9223372036854775808 microseconds';
RESULT:
	ERROR - interval component too big

-----------
QUERY:


select interval 'PT2562047788H54.775807S';
RESULT:
	ERROR - interval component too big

-----------
QUERY:

select interval 'PT-2562047788H-54.775808S';
RESULT:
	ERROR - interval component too big

-----------
QUERY:


select interval 'PT2562047788:00:54.775807';
RESULT:
	ERROR - interval component too big

-----------
QUERY:


select interval 'PT2562047788.0152155019444';
RESULT:
	ERROR - interval component too big

-----------
QUERY:

select interval 'PT-2562047788.0152155022222';
RESULT:
	ERROR - interval component too big

-----------
QUERY:


-- overflow each date/time field
select interval '2147483648 years';
RESULT:
	ERROR - interval field value out of range: "2147483648 years"
LINE 4: select interval '2147483648 years';
                        ^


-----------
QUERY:

select interval '-2147483649 years';
RESULT:
	ERROR - interval field value out of range: "-2147483649 years"
LINE 2: select interval '-2147483649 years';
                        ^


-----------
QUERY:

select interval '2147483648 months';
RESULT:
	ERROR - interval field value out of range: "2147483648 months"
LINE 2: select interval '2147483648 months';
                        ^


-----------
QUERY:

select interval '-2147483649 months';
RESULT:
	ERROR - interval field value out of range: "-2147483649 months"
LINE 2: select interval '-2147483649 months';
                        ^


-----------
QUERY:

select interval '2147483648 days';
RESULT:
	ERROR - interval field value out of range: "2147483648 days"
LINE 2: select interval '2147483648 days';
                        ^


-----------
QUERY:

select interval '-2147483649 days';
RESULT:
	ERROR - interval field value out of range: "-2147483649 days"
LINE 2: select interval '-2147483649 days';
                        ^


-----------
QUERY:

select interval '2562047789 hours';
RESULT:
	ERROR - interval field value out of range: "2562047789 hours"
LINE 2: select interval '2562047789 hours';
                        ^


-----------
QUERY:

select interval '-2562047789 hours';
RESULT:
	ERROR - interval field value out of range: "-2562047789 hours"
LINE 2: select interval '-2562047789 hours';
                        ^


-----------
QUERY:

select interval '153722867281 minutes';
RESULT:
	ERROR - interval field value out of range: "153722867281 minutes"
LINE 2: select interval '153722867281 minutes';
                        ^


-----------
QUERY:

select interval '-153722867281 minutes';
RESULT:
	ERROR - interval field value out of range: "-153722867281 minutes"
LINE 2: select interval '-153722867281 minutes';
                        ^


-----------
QUERY:

select interval '9223372036855 seconds';
RESULT:
	ERROR - interval field value out of range: "9223372036855 seconds"
LINE 2: select interval '9223372036855 seconds';
                        ^


-----------
QUERY:

select interval '-9223372036855 seconds';
RESULT:
	ERROR - interval field value out of range: "-9223372036855 seconds"
LINE 2: select interval '-9223372036855 seconds';
                        ^


-----------
QUERY:

select interval '9223372036854777 millisecond';
RESULT:
	ERROR - interval field value out of range: "9223372036854777 millisecond"
LINE 2: select interval '9223372036854777 millisecond';
                        ^


-----------
QUERY:

select interval '-9223372036854777 millisecond';
RESULT:
	ERROR - interval field value out of range: "-9223372036854777 millisecond"
LINE 2: select interval '-9223372036854777 millisecond';
                        ^


-----------
QUERY:

select interval '9223372036854775808 microsecond';
RESULT:
	ERROR - interval field value out of range: "9223372036854775808 microsecond"
LINE 2: select interval '9223372036854775808 microsecond';
                        ^


-----------
QUERY:

select interval '-9223372036854775809 microsecond';
RESULT:
	ERROR - interval field value out of range: "-9223372036854775809 microsecond"
LINE 2: select interval '-9223372036854775809 microsecond';
                        ^


-----------
QUERY:


select interval 'P2147483648';
RESULT:
	ERROR - interval field value out of range: "P2147483648"
LINE 3: select interval 'P2147483648';
                        ^


-----------
QUERY:

select interval 'P-2147483649';
RESULT:
	ERROR - interval field value out of range: "P-2147483649"
LINE 2: select interval 'P-2147483649';
                        ^


-----------
QUERY:

select interval 'P1-2147483647-2147483647';
RESULT:
	ERROR - interval out of range
LINE 2: select interval 'P1-2147483647-2147483647';
                        ^


-----------
QUERY:

select interval 'PT2562047789';
RESULT:
	ERROR - interval field value out of range: "PT2562047789"
LINE 2: select interval 'PT2562047789';
                        ^


-----------
QUERY:

select interval 'PT-2562047789';
RESULT:
	ERROR - interval field value out of range: "PT-2562047789"
LINE 2: select interval 'PT-2562047789';
                        ^


-----------
QUERY:


-- overflow with date/time unit aliases
select interval '2147483647 weeks';
RESULT:
	ERROR - interval field value out of range: "2147483647 weeks"
LINE 4: select interval '2147483647 weeks';
                        ^


-----------
QUERY:

select interval '-2147483648 weeks';
RESULT:
	ERROR - interval field value out of range: "-2147483648 weeks"
LINE 2: select interval '-2147483648 weeks';
                        ^


-----------
QUERY:

select interval '2147483647 decades';
RESULT:
	ERROR - interval field value out of range: "2147483647 decades"
LINE 2: select interval '2147483647 decades';
                        ^


-----------
QUERY:

select interval '-2147483648 decades';
RESULT:
	ERROR - interval field value out of range: "-2147483648 decades"
LINE 2: select interval '-2147483648 decades';
                        ^


-----------
QUERY:

select interval '2147483647 centuries';
RESULT:
	ERROR - interval field value out of range: "2147483647 centuries"
LINE 2: select interval '2147483647 centuries';
                        ^


-----------
QUERY:

select interval '-2147483648 centuries';
RESULT:
	ERROR - interval field value out of range: "-2147483648 centuries"
LINE 2: select interval '-2147483648 centuries';
                        ^


-----------
QUERY:

select interval '2147483647 millennium';
RESULT:
	ERROR - interval field value out of range: "2147483647 millennium"
LINE 2: select interval '2147483647 millennium';
                        ^


-----------
QUERY:

select interval '-2147483648 millennium';
RESULT:
	ERROR - interval field value out of range: "-2147483648 millennium"
LINE 2: select interval '-2147483648 millennium';
                        ^


-----------
QUERY:


select interval '1 week 2147483647 days';
RESULT:
	ERROR - interval field value out of range: "1 week 2147483647 days"
LINE 3: select interval '1 week 2147483647 days';
                        ^


-----------
QUERY:

select interval '-1 week -2147483648 days';
RESULT:
	ERROR - interval field value out of range: "-1 week -2147483648 days"
LINE 2: select interval '-1 week -2147483648 days';
                        ^


-----------
QUERY:

select interval '2147483647 days 1 week';
RESULT:
	ERROR - interval field value out of range: "2147483647 days 1 week"
LINE 2: select interval '2147483647 days 1 week';
                        ^


-----------
QUERY:

select interval '-2147483648 days -1 week';
RESULT:
	ERROR - interval field value out of range: "-2147483648 days -1 week"
LINE 2: select interval '-2147483648 days -1 week';
                        ^


-----------
QUERY:


select interval 'P1W2147483647D';
RESULT:
	ERROR - interval field value out of range: "P1W2147483647D"
LINE 3: select interval 'P1W2147483647D';
                        ^


-----------
QUERY:

select interval 'P-1W-2147483648D';
RESULT:
	ERROR - interval field value out of range: "P-1W-2147483648D"
LINE 2: select interval 'P-1W-2147483648D';
                        ^


-----------
QUERY:

select interval 'P2147483647D1W';
RESULT:
	ERROR - interval field value out of range: "P2147483647D1W"
LINE 2: select interval 'P2147483647D1W';
                        ^


-----------
QUERY:

select interval 'P-2147483648D-1W';
RESULT:
	ERROR - interval field value out of range: "P-2147483648D-1W"
LINE 2: select interval 'P-2147483648D-1W';
                        ^


-----------
QUERY:


select interval '1 decade 2147483647 years';
RESULT:
	ERROR - interval field value out of range: "1 decade 2147483647 years"
LINE 3: select interval '1 decade 2147483647 years';
                        ^


-----------
QUERY:

select interval '1 century 2147483647 years';
RESULT:
	ERROR - interval field value out of range: "1 century 2147483647 years"
LINE 2: select interval '1 century 2147483647 years';
                        ^


-----------
QUERY:

select interval '1 millennium 2147483647 years';
RESULT:
	ERROR - interval field value out of range: "1 millennium 2147483647 years"
LINE 2: select interval '1 millennium 2147483647 years';
                        ^


-----------
QUERY:

select interval '-1 decade -2147483648 years';
RESULT:
	ERROR - interval field value out of range: "-1 decade -2147483648 years"
LINE 2: select interval '-1 decade -2147483648 years';
                        ^


-----------
QUERY:

select interval '-1 century -2147483648 years';
RESULT:
	ERROR - interval field value out of range: "-1 century -2147483648 years"
LINE 2: select interval '-1 century -2147483648 years';
                        ^


-----------
QUERY:

select interval '-1 millennium -2147483648 years';
RESULT:
	ERROR - interval field value out of range: "-1 millennium -2147483648 years"
LINE 2: select interval '-1 millennium -2147483648 years';
                        ^


-----------
QUERY:


select interval '2147483647 years 1 decade';
RESULT:
	ERROR - interval field value out of range: "2147483647 years 1 decade"
LINE 3: select interval '2147483647 years 1 decade';
                        ^


-----------
QUERY:

select interval '2147483647 years 1 century';
RESULT:
	ERROR - interval field value out of range: "2147483647 years 1 century"
LINE 2: select interval '2147483647 years 1 century';
                        ^


-----------
QUERY:

select interval '2147483647 years 1 millennium';
RESULT:
	ERROR - interval field value out of range: "2147483647 years 1 millennium"
LINE 2: select interval '2147483647 years 1 millennium';
                        ^


-----------
QUERY:

select interval '-2147483648 years -1 decade';
RESULT:
	ERROR - interval field value out of range: "-2147483648 years -1 decade"
LINE 2: select interval '-2147483648 years -1 decade';
                        ^


-----------
QUERY:

select interval '-2147483648 years -1 century';
RESULT:
	ERROR - interval field value out of range: "-2147483648 years -1 century"
LINE 2: select interval '-2147483648 years -1 century';
                        ^


-----------
QUERY:

select interval '-2147483648 years -1 millennium';
RESULT:
	ERROR - interval field value out of range: "-2147483648 years -1 millennium"
LINE 2: select interval '-2147483648 years -1 millennium';
                        ^


-----------
QUERY:


-- overflowing with fractional fields - postgres format
select interval '0.1 millennium 2147483647 months';
RESULT:
	ERROR - interval field value out of range: "0.1 millennium 2147483647 months"
LINE 4: select interval '0.1 millennium 2147483647 months';
                        ^


-----------
QUERY:

select interval '0.1 centuries 2147483647 months';
RESULT:
	ERROR - interval field value out of range: "0.1 centuries 2147483647 months"
LINE 2: select interval '0.1 centuries 2147483647 months';
                        ^


-----------
QUERY:

select interval '0.1 decades 2147483647 months';
RESULT:
	ERROR - interval field value out of range: "0.1 decades 2147483647 months"
LINE 2: select interval '0.1 decades 2147483647 months';
                        ^


-----------
QUERY:

select interval '0.1 yrs 2147483647 months';
RESULT:
	ERROR - interval field value out of range: "0.1 yrs 2147483647 months"
LINE 2: select interval '0.1 yrs 2147483647 months';
                        ^


-----------
QUERY:

select interval '-0.1 millennium -2147483648 months';
RESULT:
	ERROR - interval field value out of range: "-0.1 millennium -2147483648 months"
LINE 2: select interval '-0.1 millennium -2147483648 months';
                        ^


-----------
QUERY:

select interval '-0.1 centuries -2147483648 months';
RESULT:
	ERROR - interval field value out of range: "-0.1 centuries -2147483648 months"
LINE 2: select interval '-0.1 centuries -2147483648 months';
                        ^


-----------
QUERY:

select interval '-0.1 decades -2147483648 months';
RESULT:
	ERROR - interval field value out of range: "-0.1 decades -2147483648 months"
LINE 2: select interval '-0.1 decades -2147483648 months';
                        ^


-----------
QUERY:

select interval '-0.1 yrs -2147483648 months';
RESULT:
	ERROR - interval field value out of range: "-0.1 yrs -2147483648 months"
LINE 2: select interval '-0.1 yrs -2147483648 months';
                        ^


-----------
QUERY:


select interval '2147483647 months 0.1 millennium';
RESULT:
	ERROR - interval field value out of range: "2147483647 months 0.1 millennium"
LINE 3: select interval '2147483647 months 0.1 millennium';
                        ^


-----------
QUERY:

select interval '2147483647 months 0.1 centuries';
RESULT:
	ERROR - interval field value out of range: "2147483647 months 0.1 centuries"
LINE 2: select interval '2147483647 months 0.1 centuries';
                        ^


-----------
QUERY:

select interval '2147483647 months 0.1 decades';
RESULT:
	ERROR - interval field value out of range: "2147483647 months 0.1 decades"
LINE 2: select interval '2147483647 months 0.1 decades';
                        ^


-----------
QUERY:

select interval '2147483647 months 0.1 yrs';
RESULT:
	ERROR - interval field value out of range: "2147483647 months 0.1 yrs"
LINE 2: select interval '2147483647 months 0.1 yrs';
                        ^


-----------
QUERY:

select interval '-2147483648 months -0.1 millennium';
RESULT:
	ERROR - interval field value out of range: "-2147483648 months -0.1 millennium"
LINE 2: select interval '-2147483648 months -0.1 millennium';
                        ^


-----------
QUERY:

select interval '-2147483648 months -0.1 centuries';
RESULT:
	ERROR - interval field value out of range: "-2147483648 months -0.1 centuries"
LINE 2: select interval '-2147483648 months -0.1 centuries';
                        ^


-----------
QUERY:

select interval '-2147483648 months -0.1 decades';
RESULT:
	ERROR - interval field value out of range: "-2147483648 months -0.1 decades"
LINE 2: select interval '-2147483648 months -0.1 decades';
                        ^


-----------
QUERY:

select interval '-2147483648 months -0.1 yrs';
RESULT:
	ERROR - interval field value out of range: "-2147483648 months -0.1 yrs"
LINE 2: select interval '-2147483648 months -0.1 yrs';
                        ^


-----------
QUERY:


select interval '0.1 months 2147483647 days';
RESULT:
	ERROR - interval field value out of range: "0.1 months 2147483647 days"
LINE 3: select interval '0.1 months 2147483647 days';
                        ^


-----------
QUERY:

select interval '-0.1 months -2147483648 days';
RESULT:
	ERROR - interval field value out of range: "-0.1 months -2147483648 days"
LINE 2: select interval '-0.1 months -2147483648 days';
                        ^


-----------
QUERY:

select interval '2147483647 days 0.1 months';
RESULT:
	ERROR - interval field value out of range: "2147483647 days 0.1 months"
LINE 2: select interval '2147483647 days 0.1 months';
                        ^


-----------
QUERY:

select interval '-2147483648 days -0.1 months';
RESULT:
	ERROR - interval field value out of range: "-2147483648 days -0.1 months"
LINE 2: select interval '-2147483648 days -0.1 months';
                        ^


-----------
QUERY:


select interval '0.5 weeks 2147483647 days';
RESULT:
	ERROR - interval field value out of range: "0.5 weeks 2147483647 days"
LINE 3: select interval '0.5 weeks 2147483647 days';
                        ^


-----------
QUERY:

select interval '-0.5 weeks -2147483648 days';
RESULT:
	ERROR - interval field value out of range: "-0.5 weeks -2147483648 days"
LINE 2: select interval '-0.5 weeks -2147483648 days';
                        ^


-----------
QUERY:

select interval '2147483647 days 0.5 weeks';
RESULT:
	ERROR - interval field value out of range: "2147483647 days 0.5 weeks"
LINE 2: select interval '2147483647 days 0.5 weeks';
                        ^


-----------
QUERY:

select interval '-2147483648 days -0.5 weeks';
RESULT:
	ERROR - interval field value out of range: "-2147483648 days -0.5 weeks"
LINE 2: select interval '-2147483648 days -0.5 weeks';
                        ^


-----------
QUERY:


select interval '0.01 months 9223372036854775807 microseconds';
RESULT:
	ERROR - interval field value out of range: "0.01 months 9223372036854775807 microseconds"
LINE 3: select interval '0.01 months 9223372036854775807 microsecond...
                        ^


-----------
QUERY:

select interval '-0.01 months -9223372036854775808 microseconds';
RESULT:
	ERROR - interval field value out of range: "-0.01 months -9223372036854775808 microseconds"
LINE 2: select interval '-0.01 months -9223372036854775808 microseco...
                        ^


-----------
QUERY:

select interval '9223372036854775807 microseconds 0.01 months';
RESULT:
	ERROR - interval field value out of range: "9223372036854775807 microseconds 0.01 months"
LINE 2: select interval '9223372036854775807 microseconds 0.01 month...
                        ^


-----------
QUERY:

select interval '-9223372036854775808 microseconds -0.01 months';
RESULT:
	ERROR - interval field value out of range: "-9223372036854775808 microseconds -0.01 months"
LINE 2: select interval '-9223372036854775808 microseconds -0.01 mon...
                        ^


-----------
QUERY:


select interval '0.1 weeks 9223372036854775807 microseconds';
RESULT:
	ERROR - interval field value out of range: "0.1 weeks 9223372036854775807 microseconds"
LINE 3: select interval '0.1 weeks 9223372036854775807 microseconds'...
                        ^


-----------
QUERY:

select interval '-0.1 weeks -9223372036854775808 microseconds';
RESULT:
	ERROR - interval field value out of range: "-0.1 weeks -9223372036854775808 microseconds"
LINE 2: select interval '-0.1 weeks -9223372036854775808 microsecond...
                        ^


-----------
QUERY:

select interval '9223372036854775807 microseconds 0.1 weeks';
RESULT:
	ERROR - interval field value out of range: "9223372036854775807 microseconds 0.1 weeks"
LINE 2: select interval '9223372036854775807 microseconds 0.1 weeks'...
                        ^


-----------
QUERY:

select interval '-9223372036854775808 microseconds -0.1 weeks';
RESULT:
	ERROR - interval field value out of range: "-9223372036854775808 microseconds -0.1 weeks"
LINE 2: select interval '-9223372036854775808 microseconds -0.1 week...
                        ^


-----------
QUERY:


select interval '0.1 days 9223372036854775807 microseconds';
RESULT:
	ERROR - interval field value out of range: "0.1 days 9223372036854775807 microseconds"
LINE 3: select interval '0.1 days 9223372036854775807 microseconds';
                        ^


-----------
QUERY:

select interval '-0.1 days -9223372036854775808 microseconds';
RESULT:
	ERROR - interval field value out of range: "-0.1 days -9223372036854775808 microseconds"
LINE 2: select interval '-0.1 days -9223372036854775808 microseconds...
                        ^


-----------
QUERY:

select interval '9223372036854775807 microseconds 0.1 days';
RESULT:
	ERROR - interval field value out of range: "9223372036854775807 microseconds 0.1 days"
LINE 2: select interval '9223372036854775807 microseconds 0.1 days';
                        ^


-----------
QUERY:

select interval '-9223372036854775808 microseconds -0.1 days';
RESULT:
	ERROR - interval field value out of range: "-9223372036854775808 microseconds -0.1 days"
LINE 2: select interval '-9223372036854775808 microseconds -0.1 days...
                        ^


-----------
QUERY:


-- overflowing with fractional fields - ISO8601 format
select interval 'P0.1Y2147483647M';
RESULT:
	ERROR - interval field value out of range: "P0.1Y2147483647M"
LINE 4: select interval 'P0.1Y2147483647M';
                        ^


-----------
QUERY:

select interval 'P-0.1Y-2147483648M';
RESULT:
	ERROR - interval field value out of range: "P-0.1Y-2147483648M"
LINE 2: select interval 'P-0.1Y-2147483648M';
                        ^


-----------
QUERY:

select interval 'P2147483647M0.1Y';
RESULT:
	ERROR - interval field value out of range: "P2147483647M0.1Y"
LINE 2: select interval 'P2147483647M0.1Y';
                        ^


-----------
QUERY:

select interval 'P-2147483648M-0.1Y';
RESULT:
	ERROR - interval field value out of range: "P-2147483648M-0.1Y"
LINE 2: select interval 'P-2147483648M-0.1Y';
                        ^


-----------
QUERY:


select interval 'P0.1M2147483647D';
RESULT:
	ERROR - interval field value out of range: "P0.1M2147483647D"
LINE 3: select interval 'P0.1M2147483647D';
                        ^


-----------
QUERY:

select interval 'P-0.1M-2147483648D';
RESULT:
	ERROR - interval field value out of range: "P-0.1M-2147483648D"
LINE 2: select interval 'P-0.1M-2147483648D';
                        ^


-----------
QUERY:

select interval 'P2147483647D0.1M';
RESULT:
	ERROR - interval field value out of range: "P2147483647D0.1M"
LINE 2: select interval 'P2147483647D0.1M';
                        ^


-----------
QUERY:

select interval 'P-2147483648D-0.1M';
RESULT:
	ERROR - interval field value out of range: "P-2147483648D-0.1M"
LINE 2: select interval 'P-2147483648D-0.1M';
                        ^


-----------
QUERY:


select interval 'P0.5W2147483647D';
RESULT:
	ERROR - interval field value out of range: "P0.5W2147483647D"
LINE 3: select interval 'P0.5W2147483647D';
                        ^


-----------
QUERY:

select interval 'P-0.5W-2147483648D';
RESULT:
	ERROR - interval field value out of range: "P-0.5W-2147483648D"
LINE 2: select interval 'P-0.5W-2147483648D';
                        ^


-----------
QUERY:

select interval 'P2147483647D0.5W';
RESULT:
	ERROR - interval field value out of range: "P2147483647D0.5W"
LINE 2: select interval 'P2147483647D0.5W';
                        ^


-----------
QUERY:

select interval 'P-2147483648D-0.5W';
RESULT:
	ERROR - interval field value out of range: "P-2147483648D-0.5W"
LINE 2: select interval 'P-2147483648D-0.5W';
                        ^


-----------
QUERY:


select interval 'P0.01MT2562047788H54.775807S';
RESULT:
	ERROR - interval field value out of range: "P0.01MT2562047788H54.775807S"
LINE 3: select interval 'P0.01MT2562047788H54.775807S';
                        ^


-----------
QUERY:

select interval 'P-0.01MT-2562047788H-54.775808S';
RESULT:
	ERROR - interval field value out of range: "P-0.01MT-2562047788H-54.775808S"
LINE 2: select interval 'P-0.01MT-2562047788H-54.775808S';
                        ^


-----------
QUERY:


select interval 'P0.1DT2562047788H54.775807S';
RESULT:
	ERROR - interval field value out of range: "P0.1DT2562047788H54.775807S"
LINE 3: select interval 'P0.1DT2562047788H54.775807S';
                        ^


-----------
QUERY:

select interval 'P-0.1DT-2562047788H-54.775808S';
RESULT:
	ERROR - interval field value out of range: "P-0.1DT-2562047788H-54.775808S"
LINE 2: select interval 'P-0.1DT-2562047788H-54.775808S';
                        ^


-----------
QUERY:


select interval 'PT2562047788.1H54.775807S';
RESULT:
	ERROR - interval field value out of range: "PT2562047788.1H54.775807S"
LINE 3: select interval 'PT2562047788.1H54.775807S';
                        ^


-----------
QUERY:

select interval 'PT-2562047788.1H-54.775808S';
RESULT:
	ERROR - interval field value out of range: "PT-2562047788.1H-54.775808S"
LINE 2: select interval 'PT-2562047788.1H-54.775808S';
                        ^


-----------
QUERY:


select interval 'PT2562047788H0.1M54.775807S';
RESULT:
	ERROR - interval field value out of range: "PT2562047788H0.1M54.775807S"
LINE 3: select interval 'PT2562047788H0.1M54.775807S';
                        ^


-----------
QUERY:

select interval 'PT-2562047788H-0.1M-54.775808S';
RESULT:
	ERROR - interval field value out of range: "PT-2562047788H-0.1M-54.775808S"
LINE 2: select interval 'PT-2562047788H-0.1M-54.775808S';
                        ^


-----------
QUERY:


-- overflowing with fractional fields - ISO8601 alternative format
select interval 'P0.1-2147483647-00';
RESULT:
	ERROR - interval field value out of range: "P0.1-2147483647-00"
LINE 4: select interval 'P0.1-2147483647-00';
                        ^


-----------
QUERY:

select interval 'P00-0.1-2147483647';
RESULT:
	ERROR - interval field value out of range: "P00-0.1-2147483647"
LINE 2: select interval 'P00-0.1-2147483647';
                        ^


-----------
QUERY:

select interval 'P00-0.01-00T2562047788:00:54.775807';
RESULT:
	ERROR - interval field value out of range: "P00-0.01-00T2562047788:00:54.775807"
LINE 2: select interval 'P00-0.01-00T2562047788:00:54.775807';
                        ^


-----------
QUERY:

select interval 'P00-00-0.1T2562047788:00:54.775807';
RESULT:
	ERROR - interval field value out of range: "P00-00-0.1T2562047788:00:54.775807"
LINE 2: select interval 'P00-00-0.1T2562047788:00:54.775807';
                        ^


-----------
QUERY:

select interval 'PT2562047788.1:00:54.775807';
RESULT:
	ERROR - interval field value out of range: "PT2562047788.1:00:54.775807"
LINE 2: select interval 'PT2562047788.1:00:54.775807';
                        ^


-----------
QUERY:

select interval 'PT2562047788:01.:54.775807';
RESULT:
	ERROR - interval field value out of range: "PT2562047788:01.:54.775807"
LINE 2: select interval 'PT2562047788:01.:54.775807';
                        ^


-----------
QUERY:


-- overflowing with fractional fields - SQL standard format
select interval '0.1 2562047788:0:54.775807';
RESULT:
	ERROR - interval field value out of range: "0.1 2562047788:0:54.775807"
LINE 4: select interval '0.1 2562047788:0:54.775807';
                        ^


-----------
QUERY:

select interval '0.1 2562047788:0:54.775808 ago';
RESULT:
	ERROR - interval field value out of range: "0.1 2562047788:0:54.775808 ago"
LINE 2: select interval '0.1 2562047788:0:54.775808 ago';
                        ^


-----------
QUERY:


select interval '2562047788.1:0:54.775807';
RESULT:
	ERROR - interval field value out of range: "2562047788.1:0:54.775807"
LINE 3: select interval '2562047788.1:0:54.775807';
                        ^


-----------
QUERY:

select interval '2562047788.1:0:54.775808 ago';
RESULT:
	ERROR - interval field value out of range: "2562047788.1:0:54.775808 ago"
LINE 2: select interval '2562047788.1:0:54.775808 ago';
                        ^


-----------
QUERY:


select interval '2562047788:0.1:54.775807';
RESULT:
	ERROR - invalid input syntax for type interval: "2562047788:0.1:54.775807"
LINE 3: select interval '2562047788:0.1:54.775807';
                        ^


-----------
QUERY:

select interval '2562047788:0.1:54.775808 ago';
RESULT:
	ERROR - invalid input syntax for type interval: "2562047788:0.1:54.775808 ago"
LINE 2: select interval '2562047788:0.1:54.775808 ago';
                        ^


-----------
QUERY:


-- overflowing using AGO with INT_MIN
select interval '-2147483648 months ago';
RESULT:
	ERROR - interval field value out of range: "-2147483648 months ago"
LINE 4: select interval '-2147483648 months ago';
                        ^


-----------
QUERY:

select interval '-2147483648 days ago';
RESULT:
	ERROR - interval field value out of range: "-2147483648 days ago"
LINE 2: select interval '-2147483648 days ago';
                        ^


-----------
QUERY:

select interval '-9223372036854775808 microseconds ago';
RESULT:
	ERROR - interval field value out of range: "-9223372036854775808 microseconds ago"
LINE 2: select interval '-9223372036854775808 microseconds ago';
                        ^


-----------
QUERY:

select interval '-2147483648 months -2147483648 days -9223372036854775808 microseconds ago';
RESULT:
	ERROR - interval field value out of range: "-2147483648 months -2147483648 days -9223372036854775808 microseconds ago"
LINE 2: select interval '-2147483648 months -2147483648 days -922337...
                        ^


-----------
QUERY:


-- overflowing using make_interval
select make_interval(years := 178956971);
RESULT:
	ERROR - interval out of range


-----------
QUERY:

select make_interval(years := -178956971);
RESULT:
	ERROR - interval out of range


-----------
QUERY:

select make_interval(years := 1, months := 2147483647);
RESULT:
	ERROR - interval out of range


-----------
QUERY:

select make_interval(years := -1, months := -2147483648);
RESULT:
	ERROR - interval out of range


-----------
QUERY:

select make_interval(weeks := 306783379);
RESULT:
	ERROR - interval out of range


-----------
QUERY:

select make_interval(weeks := -306783379);
RESULT:
	ERROR - interval out of range


-----------
QUERY:

select make_interval(weeks := 1, days := 2147483647);
RESULT:
	ERROR - interval out of range


-----------
QUERY:

select make_interval(weeks := -1, days := -2147483648);
RESULT:
	ERROR - interval out of range


-----------
QUERY:

select make_interval(secs := 1e308);
RESULT:
	ERROR - value out of range: overflow


-----------
QUERY:

select make_interval(secs := 1e18);
RESULT:
	ERROR - interval out of range


-----------
QUERY:

select make_interval(secs := -1e18);
RESULT:
	ERROR - interval out of range


-----------
QUERY:

select make_interval(mins := 1, secs := 9223372036800.0);
RESULT:
	ERROR - interval out of range


-----------
QUERY:

select make_interval(mins := -1, secs := -9223372036800.0);
RESULT:
	ERROR - interval out of range


-----------
QUERY:


-- test that INT_MIN number is formatted properly
SET IntervalStyle to postgres;
RESULT:
	[]

-----------
QUERY:

select interval '-2147483647 months -2147483648 days -9223372036854775808 us';
RESULT:
	ERROR - interval component too big

-----------
QUERY:

SET IntervalStyle to sql_standard;
RESULT:
	[]

-----------
QUERY:

select interval '-2147483647 months -2147483648 days -9223372036854775808 us';
RESULT:
	ERROR - interval component too big

-----------
QUERY:

SET IntervalStyle to iso_8601;
RESULT:
	[]

-----------
QUERY:

select interval '-2147483647 months -2147483648 days -9223372036854775808 us';
RESULT:
	ERROR - iso_8601 intervalstyle currently not supported

-----------
QUERY:

SET IntervalStyle to postgres_verbose;
RESULT:
	[]

-----------
QUERY:

select interval '-2147483647 months -2147483648 days -9223372036854775808 us';
RESULT:
	ERROR - interval component too big

-----------
QUERY:


-- check that /* REPLACED */ ''30 days/* REPLACED */ '' equals /* REPLACED */ ''1 month/* REPLACED */ '' according to the hash function
select '30 days'::interval = '1 month'::interval as t;
RESULT:
	[(True,)]

-----------
QUERY:

select interval_hash('30 days'::interval) = interval_hash('1 month'::interval) as t;
RESULT:
	[(True,)]

-----------
QUERY:


-- numeric constructor
select make_interval(years := 2);
RESULT:
	[(datetime.timedelta(days=730),)]

-----------
QUERY:

select make_interval(years := 1, months := 6);
RESULT:
	[(datetime.timedelta(days=545),)]

-----------
QUERY:

select make_interval(years := 1, months := -1, weeks := 5, days := -7, hours := 25, mins := -180);
RESULT:
	[(datetime.timedelta(days=358),)]

-----------
QUERY:


select make_interval() = make_interval(years := 0, months := 0, weeks := 0, days := 0, mins := 0, secs := 0.0);
RESULT:
	[(True,)]

-----------
QUERY:

select make_interval(hours := -2, mins := -10, secs := -25.3);
RESULT:
	[(datetime.timedelta(days=6300),)]

-----------
QUERY:


select make_interval(years := 'inf'::float::int);
RESULT:
	ERROR - integer out of range


-----------
QUERY:

select make_interval(months := 'NaN'::float::int);
RESULT:
	ERROR - integer out of range


-----------
QUERY:

select make_interval(secs := 'inf');
RESULT:
	ERROR - interval out of range


-----------
QUERY:

select make_interval(secs := 'NaN');
RESULT:
	ERROR - interval out of range


-----------
QUERY:

select make_interval(secs := 7e12);
RESULT:
	ERROR - interval component too big

-----------
QUERY:


--
-- test EXTRACT
--
SELECT f1,
    EXTRACT(MICROSECOND FROM f1) AS MICROSECOND,
    EXTRACT(MILLISECOND FROM f1) AS MILLISECOND,
    EXTRACT(SECOND FROM f1) AS SECOND,
    EXTRACT(MINUTE FROM f1) AS MINUTE,
    EXTRACT(HOUR FROM f1) AS HOUR,
    EXTRACT(DAY FROM f1) AS DAY,
    EXTRACT(MONTH FROM f1) AS MONTH,
    EXTRACT(QUARTER FROM f1) AS QUARTER,
    EXTRACT(YEAR FROM f1) AS YEAR,
    EXTRACT(DECADE FROM f1) AS DECADE,
    EXTRACT(CENTURY FROM f1) AS CENTURY,
    EXTRACT(MILLENNIUM FROM f1) AS MILLENNIUM,
    EXTRACT(EPOCH FROM f1) AS EPOCH
    FROM INTERVAL_TBL;
RESULT:
	ERROR - invalid literal for int() with base 10: '@ 5 hours'

-----------
QUERY:


SELECT EXTRACT(FORTNIGHT FROM INTERVAL '2 days');
RESULT:
	ERROR - unit "fortnight" not recognized for type interval


-----------
QUERY:
  -- error
SELECT EXTRACT(TIMEZONE FROM INTERVAL '2 days');
RESULT:
	ERROR - unit "timezone" not supported for type interval


-----------
QUERY:
  -- error

SELECT EXTRACT(DECADE FROM INTERVAL '100 y');
RESULT:
	[(Decimal('10'),)]

-----------
QUERY:

SELECT EXTRACT(DECADE FROM INTERVAL '99 y');
RESULT:
	[(Decimal('9'),)]

-----------
QUERY:

SELECT EXTRACT(DECADE FROM INTERVAL '-99 y');
RESULT:
	[(Decimal('-9'),)]

-----------
QUERY:

SELECT EXTRACT(DECADE FROM INTERVAL '-100 y');
RESULT:
	[(Decimal('-10'),)]

-----------
QUERY:


SELECT EXTRACT(CENTURY FROM INTERVAL '100 y');
RESULT:
	[(Decimal('1'),)]

-----------
QUERY:

SELECT EXTRACT(CENTURY FROM INTERVAL '99 y');
RESULT:
	[(Decimal('0'),)]

-----------
QUERY:

SELECT EXTRACT(CENTURY FROM INTERVAL '-99 y');
RESULT:
	[(Decimal('0'),)]

-----------
QUERY:

SELECT EXTRACT(CENTURY FROM INTERVAL '-100 y');
RESULT:
	[(Decimal('-1'),)]

-----------
QUERY:


-- date_part implementation is mostly the same as extract, so only
-- test a few cases for additional coverage.
SELECT f1,
    date_part('microsecond', f1) AS microsecond,
    date_part('millisecond', f1) AS millisecond,
    date_part('second', f1) AS second,
    date_part('epoch', f1) AS epoch
    FROM INTERVAL_TBL;
RESULT:
	ERROR - invalid literal for int() with base 10: '@ 5 hours'

-----------
QUERY:


-- internal overflow test case
SELECT extract(epoch from interval '1000000000 days');
RESULT:
	[(Decimal('86400000000000.000000'),)]

-----------
QUERY:


--
-- test infinite intervals
--

-- largest finite intervals
SELECT interval '-2147483648 months -2147483648 days -9223372036854775807 us';
RESULT:
	ERROR - interval component too big

-----------
QUERY:

SELECT interval '2147483647 months 2147483647 days 9223372036854775806 us';
RESULT:
	ERROR - interval component too big

-----------
QUERY:


-- infinite intervals
SELECT interval '-2147483648 months -2147483648 days -9223372036854775808 us';
RESULT:
	[(datetime.timedelta(0),)]

-----------
QUERY:

SELECT interval '2147483647 months 2147483647 days 9223372036854775807 us';
RESULT:
	[(datetime.timedelta(0),)]

-----------
QUERY:


CREATE TABLE INFINITE_INTERVAL_TBL (i interval);
RESULT:
	[]

-----------
QUERY:

INSERT INTO INFINITE_INTERVAL_TBL VALUES ('infinity'), ('-infinity'), ('1 year 2 days 3 hours');
RESULT:
	[]

-----------
QUERY:


SELECT i, isfinite(i) FROM INFINITE_INTERVAL_TBL;
RESULT:
	[(datetime.timedelta(0), False), (datetime.timedelta(0), False), (datetime.timedelta(days=367), True)]

-----------
QUERY:


-- test basic arithmetic
CREATE FUNCTION eval(expr text)
RETURNS text AS
$$
DECLARE
  result text;
BEGIN
  EXECUTE 'select '||expr INTO result;
  RETURN result;
EXCEPTION WHEN OTHERS THEN
  RETURN SQLERRM;
END
$$
LANGUAGE plpgsql;
RESULT:
	[]

-----------
QUERY:


SELECT d AS date, i AS interval,
       eval(format('date %L + interval %L', d, i)) AS plus,
       eval(format('date %L - interval %L', d, i)) AS minus
FROM (VALUES (date '-infinity'),
             (date '1995-08-06'),
             (date 'infinity')) AS t1(d),
     (VALUES (interval '-infinity'),
             (interval 'infinity')) AS t2(i);
RESULT:
	[(datetime.date(1, 1, 1), datetime.timedelta(0), '-infinity', 'timestamp out of range'), (datetime.date(1, 1, 1), datetime.timedelta(0), 'timestamp out of range', '-infinity'), (datetime.date(1995, 8, 6), datetime.timedelta(0), '-infinity', 'infinity'), (datetime.date(1995, 8, 6), datetime.timedelta(0), 'infinity', '-infinity'), (datetime.date(9999, 12, 31), datetime.timedelta(0), 'timestamp out of range', 'infinity'), (datetime.date(9999, 12, 31), datetime.timedelta(0), 'infinity', 'timestamp out of range')]

-----------
QUERY:


SELECT i1 AS interval1, i2 AS interval2,
       eval(format('interval %L + interval %L', i1, i2)) AS plus,
       eval(format('interval %L - interval %L', i1, i2)) AS minus
FROM (VALUES (interval '-infinity'),
             (interval '2 months'),
             (interval 'infinity')) AS t1(i1),
     (VALUES (interval '-infinity'),
             (interval '10 days'),
             (interval 'infinity')) AS t2(i2);
RESULT:
	[(datetime.timedelta(0), datetime.timedelta(0), '-infinity', 'interval out of range'), (datetime.timedelta(0), datetime.timedelta(days=10), '-infinity', '-infinity'), (datetime.timedelta(0), datetime.timedelta(0), 'interval out of range', '-infinity'), (datetime.timedelta(days=60), datetime.timedelta(0), '-infinity', 'infinity'), (datetime.timedelta(days=60), datetime.timedelta(days=10), '@ 2 mons 10 days', '@ 2 mons -10 days'), (datetime.timedelta(days=60), datetime.timedelta(0), 'infinity', '-infinity'), (datetime.timedelta(0), datetime.timedelta(0), 'interval out of range', 'infinity'), (datetime.timedelta(0), datetime.timedelta(days=10), 'infinity', 'infinity'), (datetime.timedelta(0), datetime.timedelta(0), 'infinity', 'interval out of range')]

-----------
QUERY:


SELECT interval '2147483646 months 2147483646 days 9223372036854775806 us' + interval '1 month 1 day 1 us';
RESULT:
	ERROR - interval out of range


-----------
QUERY:

SELECT interval '-2147483647 months -2147483647 days -9223372036854775807 us' + interval '-1 month -1 day -1 us';
RESULT:
	ERROR - interval out of range


-----------
QUERY:

SELECT interval '2147483646 months 2147483646 days 9223372036854775806 us' - interval '-1 month -1 day -1 us';
RESULT:
	ERROR - interval out of range


-----------
QUERY:

SELECT interval '-2147483647 months -2147483647 days -9223372036854775807 us' - interval '1 month 1 day 1 us';
RESULT:
	ERROR - interval out of range


-----------
QUERY:


SELECT t AS timestamp, i AS interval,
       eval(format('timestamp %L + interval %L', t, i)) AS plus,
       eval(format('timestamp %L - interval %L', t, i)) AS minus
FROM (VALUES (timestamp '-infinity'),
             (timestamp '1995-08-06 12:30:15'),
             (timestamp 'infinity')) AS t1(t),
     (VALUES (interval '-infinity'),
             (interval 'infinity')) AS t2(i);
RESULT:
	[(datetime.datetime(1, 1, 1, 0, 0), datetime.timedelta(0), '-infinity', 'timestamp out of range'), (datetime.datetime(1, 1, 1, 0, 0), datetime.timedelta(0), 'timestamp out of range', '-infinity'), (datetime.datetime(1995, 8, 6, 12, 30, 15), datetime.timedelta(0), '-infinity', 'infinity'), (datetime.datetime(1995, 8, 6, 12, 30, 15), datetime.timedelta(0), 'infinity', '-infinity'), (datetime.datetime(9999, 12, 31, 23, 59, 59, 999999), datetime.timedelta(0), 'timestamp out of range', 'infinity'), (datetime.datetime(9999, 12, 31, 23, 59, 59, 999999), datetime.timedelta(0), 'infinity', 'timestamp out of range')]

-----------
QUERY:


SELECT t AT TIME ZONE 'GMT' AS timestamptz, i AS interval,
       eval(format('timestamptz %L + interval %L', t, i)) AS plus,
       eval(format('timestamptz %L - interval %L', t, i)) AS minus
FROM (VALUES (timestamptz '-infinity'),
             (timestamptz '1995-08-06 12:30:15 GMT'),
             (timestamptz 'infinity')) AS t1(t),
     (VALUES (interval '-infinity'),
             (interval 'infinity')) AS t2(i);
RESULT:
	[(datetime.datetime(1, 1, 1, 0, 0), datetime.timedelta(0), '-infinity', 'timestamp out of range'), (datetime.datetime(1, 1, 1, 0, 0), datetime.timedelta(0), 'timestamp out of range', '-infinity'), (datetime.datetime(1995, 8, 6, 12, 30, 15), datetime.timedelta(0), '-infinity', 'infinity'), (datetime.datetime(1995, 8, 6, 12, 30, 15), datetime.timedelta(0), 'infinity', '-infinity'), (datetime.datetime(9999, 12, 31, 23, 59, 59, 999999), datetime.timedelta(0), 'timestamp out of range', 'infinity'), (datetime.datetime(9999, 12, 31, 23, 59, 59, 999999), datetime.timedelta(0), 'infinity', 'timestamp out of range')]

-----------
QUERY:


-- time +/- infinite interval not supported
SELECT time '11:27:42' + interval 'infinity';
RESULT:
	ERROR - cannot add infinite interval to time


-----------
QUERY:

SELECT time '11:27:42' + interval '-infinity';
RESULT:
	ERROR - cannot add infinite interval to time


-----------
QUERY:

SELECT time '11:27:42' - interval 'infinity';
RESULT:
	ERROR - cannot subtract infinite interval from time


-----------
QUERY:

SELECT time '11:27:42' - interval '-infinity';
RESULT:
	ERROR - cannot subtract infinite interval from time


-----------
QUERY:

SELECT timetz '11:27:42' + interval 'infinity';
RESULT:
	ERROR - cannot add infinite interval to time


-----------
QUERY:

SELECT timetz '11:27:42' + interval '-infinity';
RESULT:
	ERROR - cannot add infinite interval to time


-----------
QUERY:

SELECT timetz '11:27:42' - interval 'infinity';
RESULT:
	ERROR - cannot subtract infinite interval from time


-----------
QUERY:

SELECT timetz '11:27:42' - interval '-infinity';
RESULT:
	ERROR - cannot subtract infinite interval from time


-----------
QUERY:


SELECT lhst.i lhs,
    rhst.i rhs,
    lhst.i < rhst.i AS lt,
    lhst.i <= rhst.i AS le,
    lhst.i = rhst.i AS eq,
    lhst.i > rhst.i AS gt,
    lhst.i >= rhst.i AS ge,
    lhst.i <> rhst.i AS ne
    FROM INFINITE_INTERVAL_TBL lhst CROSS JOIN INFINITE_INTERVAL_TBL rhst
    WHERE NOT isfinite(lhst.i);
RESULT:
	[(datetime.timedelta(0), datetime.timedelta(0), False, True, True, False, True, False), (datetime.timedelta(0), datetime.timedelta(0), True, True, False, False, False, True), (datetime.timedelta(0), datetime.timedelta(0), False, False, False, True, True, True), (datetime.timedelta(0), datetime.timedelta(0), False, True, True, False, True, False), (datetime.timedelta(0), datetime.timedelta(days=367), False, False, False, True, True, True), (datetime.timedelta(0), datetime.timedelta(days=367), True, True, False, False, False, True)]

-----------
QUERY:


SELECT i AS interval,
    -i AS um,
    i * 2.0 AS mul,
    i * -2.0 AS mul_neg,
    i * 'infinity' AS mul_inf,
    i * '-infinity' AS mul_inf_neg,
    i / 3.0 AS div,
    i / -3.0 AS div_neg
    FROM INFINITE_INTERVAL_TBL
    WHERE NOT isfinite(i);
RESULT:
	[(datetime.timedelta(0), datetime.timedelta(0), datetime.timedelta(0), datetime.timedelta(0), datetime.timedelta(0), datetime.timedelta(0), datetime.timedelta(0), datetime.timedelta(0)), (datetime.timedelta(0), datetime.timedelta(0), datetime.timedelta(0), datetime.timedelta(0), datetime.timedelta(0), datetime.timedelta(0), datetime.timedelta(0), datetime.timedelta(0))]

-----------
QUERY:


SELECT -interval '-2147483647 months -2147483647 days -9223372036854775807 us';
RESULT:
	ERROR - interval out of range


-----------
QUERY:

SELECT interval 'infinity' * 'nan';
RESULT:
	ERROR - interval out of range


-----------
QUERY:

SELECT interval '-infinity' * 'nan';
RESULT:
	ERROR - interval out of range


-----------
QUERY:

SELECT interval '-1073741824 months -1073741824 days -4611686018427387904 us' * 2;
RESULT:
	ERROR - interval out of range


-----------
QUERY:

SELECT interval 'infinity' * 0;
RESULT:
	ERROR - interval out of range


-----------
QUERY:

SELECT interval '-infinity' * 0;
RESULT:
	ERROR - interval out of range


-----------
QUERY:

SELECT interval '0 days' * 'infinity'::float;
RESULT:
	ERROR - interval out of range


-----------
QUERY:

SELECT interval '0 days' * '-infinity'::float;
RESULT:
	ERROR - interval out of range


-----------
QUERY:

SELECT interval '5 days' * 'infinity'::float;
RESULT:
	[(datetime.timedelta(0),)]

-----------
QUERY:

SELECT interval '5 days' * '-infinity'::float;
RESULT:
	[(datetime.timedelta(0),)]

-----------
QUERY:


SELECT interval 'infinity' / 'infinity';
RESULT:
	ERROR - interval out of range


-----------
QUERY:

SELECT interval 'infinity' / '-infinity';
RESULT:
	ERROR - interval out of range


-----------
QUERY:

SELECT interval 'infinity' / 'nan';
RESULT:
	ERROR - interval out of range


-----------
QUERY:

SELECT interval '-infinity' / 'infinity';
RESULT:
	ERROR - interval out of range


-----------
QUERY:

SELECT interval '-infinity' / '-infinity';
RESULT:
	ERROR - interval out of range


-----------
QUERY:

SELECT interval '-infinity' / 'nan';
RESULT:
	ERROR - interval out of range


-----------
QUERY:

SELECT interval '-1073741824 months -1073741824 days -4611686018427387904 us' / 0.5;
RESULT:
	ERROR - interval out of range


-----------
QUERY:


SELECT date_bin('infinity', timestamp '2001-02-16 20:38:40', timestamp '2001-02-16 20:05:00');
RESULT:
	ERROR - timestamps cannot be binned into infinite intervals


-----------
QUERY:

SELECT date_bin('-infinity', timestamp '2001-02-16 20:38:40', timestamp '2001-02-16 20:05:00');
RESULT:
	ERROR - timestamps cannot be binned into infinite intervals


-----------
QUERY:


SELECT i AS interval, date_trunc('hour', i)
    FROM INFINITE_INTERVAL_TBL
    WHERE NOT isfinite(i);
RESULT:
	[(datetime.timedelta(0), datetime.timedelta(0)), (datetime.timedelta(0), datetime.timedelta(0))]

-----------
QUERY:


SELECT i AS interval, justify_days(i), justify_hours(i), justify_interval(i)
    FROM INFINITE_INTERVAL_TBL
    WHERE NOT isfinite(i);
RESULT:
	[(datetime.timedelta(0), datetime.timedelta(0), datetime.timedelta(0), datetime.timedelta(0)), (datetime.timedelta(0), datetime.timedelta(0), datetime.timedelta(0), datetime.timedelta(0))]

-----------
QUERY:


SELECT timezone('infinity'::interval, '1995-08-06 12:12:12'::timestamp);
RESULT:
	ERROR - interval time zone "infinity" must be finite


-----------
QUERY:

SELECT timezone('-infinity'::interval, '1995-08-06 12:12:12'::timestamp);
RESULT:
	ERROR - interval time zone "-infinity" must be finite


-----------
QUERY:

SELECT timezone('infinity'::interval, '1995-08-06 12:12:12'::timestamptz);
RESULT:
	ERROR - interval time zone "infinity" must be finite


-----------
QUERY:

SELECT timezone('-infinity'::interval, '1995-08-06 12:12:12'::timestamptz);
RESULT:
	ERROR - interval time zone "-infinity" must be finite


-----------
QUERY:

SELECT timezone('infinity'::interval, '12:12:12'::time);
RESULT:
	ERROR - interval time zone "infinity" must be finite


-----------
QUERY:

SELECT timezone('-infinity'::interval, '12:12:12'::time);
RESULT:
	ERROR - interval time zone "-infinity" must be finite


-----------
QUERY:

SELECT timezone('infinity'::interval, '12:12:12'::timetz);
RESULT:
	ERROR - interval time zone "infinity" must be finite


-----------
QUERY:

SELECT timezone('-infinity'::interval, '12:12:12'::timetz);
RESULT:
	ERROR - interval time zone "-infinity" must be finite


-----------
QUERY:


SELECT 'infinity'::interval::time;
RESULT:
	ERROR - cannot convert infinite interval to time


-----------
QUERY:

SELECT '-infinity'::interval::time;
RESULT:
	ERROR - cannot convert infinite interval to time


-----------
QUERY:


SELECT to_char('infinity'::interval, 'YYYY');
RESULT:
	[(None,)]

-----------
QUERY:

SELECT to_char('-infinity'::interval, 'YYYY');
RESULT:
	[(None,)]

-----------
QUERY:


-- /* REPLACED */ ''ago/* REPLACED */ '' can only appear once at the end of an interval.
SELECT INTERVAL '42 days 2 seconds ago ago';
RESULT:
	ERROR - invalid input syntax for type interval: "42 days 2 seconds ago ago"
LINE 4: SELECT INTERVAL '42 days 2 seconds ago ago';
                        ^


-----------
QUERY:

SELECT INTERVAL '2 minutes ago 5 days';
RESULT:
	ERROR - invalid input syntax for type interval: "2 minutes ago 5 days"
LINE 2: SELECT INTERVAL '2 minutes ago 5 days';
                        ^


-----------
QUERY:


-- consecutive and dangling units are not allowed.
SELECT INTERVAL 'hour 5 months';
RESULT:
	ERROR - invalid input syntax for type interval: "hour 5 months"
LINE 4: SELECT INTERVAL 'hour 5 months';
                        ^


-----------
QUERY:

SELECT INTERVAL '1 year months days 5 hours';
RESULT:
	ERROR - invalid input syntax for type interval: "1 year months days 5 hours"
LINE 2: SELECT INTERVAL '1 year months days 5 hours';
                        ^


-----------
QUERY:


-- unacceptable reserved words in interval. Only /* REPLACED */ ''infinity/* REPLACED */ '', /* REPLACED */ ''+infinity/* REPLACED */ '' and
-- /* REPLACED */ ''-infinity/* REPLACED */ '' are allowed.
SELECT INTERVAL 'now';
RESULT:
	ERROR - invalid input syntax for type interval: "now"
LINE 5: SELECT INTERVAL 'now';
                        ^


-----------
QUERY:

SELECT INTERVAL 'today';
RESULT:
	ERROR - invalid input syntax for type interval: "today"
LINE 2: SELECT INTERVAL 'today';
                        ^


-----------
QUERY:

SELECT INTERVAL 'tomorrow';
RESULT:
	ERROR - invalid input syntax for type interval: "tomorrow"
LINE 2: SELECT INTERVAL 'tomorrow';
                        ^


-----------
QUERY:

SELECT INTERVAL 'allballs';
RESULT:
	ERROR - invalid input syntax for type interval: "allballs"
LINE 2: SELECT INTERVAL 'allballs';
                        ^


-----------
QUERY:

SELECT INTERVAL 'epoch';
RESULT:
	ERROR - invalid input syntax for type interval: "epoch"
LINE 2: SELECT INTERVAL 'epoch';
                        ^


-----------
QUERY:

SELECT INTERVAL 'yesterday';
RESULT:
	ERROR - invalid input syntax for type interval: "yesterday"
LINE 2: SELECT INTERVAL 'yesterday';
                        ^


-----------
QUERY:


-- infinity specification should be the only thing
SELECT INTERVAL 'infinity years';
RESULT:
	ERROR - invalid input syntax for type interval: "infinity years"
LINE 4: SELECT INTERVAL 'infinity years';
                        ^


-----------
QUERY:

SELECT INTERVAL 'infinity ago';
RESULT:
	ERROR - invalid input syntax for type interval: "infinity ago"
LINE 2: SELECT INTERVAL 'infinity ago';
                        ^


-----------
QUERY:

SELECT INTERVAL '+infinity -infinity';
RESULT:
	ERROR - invalid input syntax for type interval: "+infinity -infinity"
LINE 2: SELECT INTERVAL '+infinity -infinity';
                        ^

