
-----------
QUERY:
-- basic tests for the TID data type

SELECT
  '(0,0)'::tid as tid00,
  '(0,1)'::tid as tid01,
  '(-1,0)'::tid as tidm10,
  '(4294967295,65535)'::tid as tidmax;
RESULT:
	[('(0,0)', '(0,1)', '(4294967295,0)', '(4294967295,65535)')]

-----------
QUERY:


SELECT '(4294967296,1)'::tid;
RESULT:
	ERROR - invalid input syntax for type tid: "(4294967296,1)"
LINE 3: SELECT '(4294967296,1)'::tid;
               ^


-----------
QUERY:
  -- error
SELECT '(1,65536)'::tid;
RESULT:
	ERROR - invalid input syntax for type tid: "(1,65536)"
LINE 2: SELECT '(1,65536)'::tid;
               ^


-----------
QUERY:
  -- error

-- Also try it with non-error-throwing API
SELECT pg_input_is_valid('(0)', 'tid');
RESULT:
	[(False,)]

-----------
QUERY:

SELECT * FROM pg_input_error_info('(0)', 'tid');
RESULT:
	[('invalid input syntax for type tid: "(0)"', None, None, '22P02')]

-----------
QUERY:

SELECT pg_input_is_valid('(0,-1)', 'tid');
RESULT:
	[(False,)]

-----------
QUERY:

SELECT * FROM pg_input_error_info('(0,-1)', 'tid');
RESULT:
	[('invalid input syntax for type tid: "(0,-1)"', None, None, '22P02')]

-----------
QUERY:



-- tests for functions related to TID handling

CREATE TABLE tid_tab (a int);
RESULT:
	[]

-----------
QUERY:


-- min() and max() for TIDs
INSERT INTO tid_tab VALUES (1), (2);
RESULT:
	[]

-----------
QUERY:

SELECT min(ctid) FROM tid_tab;
RESULT:
	[('(0,1)',)]

-----------
QUERY:

SELECT max(ctid) FROM tid_tab;
RESULT:
	[('(0,2)',)]

-----------
QUERY:

TRUNCATE tid_tab;
RESULT:
	[]

-----------
QUERY:


-- Tests for currtid2() with various relation kinds

-- Materialized view
CREATE MATERIALIZED VIEW tid_matview AS SELECT a FROM tid_tab;
RESULT:
	[]

-----------
QUERY:

SELECT currtid2('tid_matview'::text, '(0,1)'::tid);
RESULT:
	ERROR - tid (0, 1) is not valid for relation "tid_matview"


-----------
QUERY:
 -- fails
INSERT INTO tid_tab VALUES (1);
RESULT:
	[]

-----------
QUERY:

REFRESH MATERIALIZED VIEW tid_matview;
RESULT:
	[]

-----------
QUERY:

SELECT currtid2('tid_matview'::text, '(0,1)'::tid);
RESULT:
	[('(0,1)',)]

-----------
QUERY:
 -- ok
DROP MATERIALIZED VIEW tid_matview;
RESULT:
	[]

-----------
QUERY:

TRUNCATE tid_tab;
RESULT:
	[]

-----------
QUERY:


-- Sequence
CREATE SEQUENCE tid_seq;
RESULT:
	[]

-----------
QUERY:

SELECT currtid2('tid_seq'::text, '(0,1)'::tid);
RESULT:
	[('(0,1)',)]

-----------
QUERY:
 -- ok
DROP SEQUENCE tid_seq;
RESULT:
	[]

-----------
QUERY:


-- Index, fails with incorrect relation type
CREATE INDEX tid_ind ON tid_tab(a);
RESULT:
	[]

-----------
QUERY:

SELECT currtid2('tid_ind'::text, '(0,1)'::tid);
RESULT:
	ERROR - cannot open relation "tid_ind"
DETAIL:  This operation is not supported for indexes.


-----------
QUERY:
 -- fails
DROP INDEX tid_ind;
RESULT:
	[]

-----------
QUERY:


-- Partitioned table, no storage
CREATE TABLE tid_part (a int) PARTITION BY RANGE (a);
RESULT:
	[]

-----------
QUERY:

SELECT currtid2('tid_part'::text, '(0,1)'::tid);
RESULT:
	ERROR - cannot look at latest visible tid for relation "public.tid_part"


-----------
QUERY:
 -- fails
DROP TABLE tid_part;
RESULT:
	[]

-----------
QUERY:


-- Views
-- ctid not defined in the view
CREATE VIEW tid_view_no_ctid AS SELECT a FROM tid_tab;
RESULT:
	[]

-----------
QUERY:

SELECT currtid2('tid_view_no_ctid'::text, '(0,1)'::tid);
RESULT:
	ERROR - currtid cannot handle views with no CTID


-----------
QUERY:
 -- fails
DROP VIEW tid_view_no_ctid;
RESULT:
	[]

-----------
QUERY:

-- ctid fetched directly from the source table.
CREATE VIEW tid_view_with_ctid AS SELECT ctid, a FROM tid_tab;
RESULT:
	[]

-----------
QUERY:

SELECT currtid2('tid_view_with_ctid'::text, '(0,1)'::tid);
RESULT:
	ERROR - tid (0, 1) is not valid for relation "tid_tab"


-----------
QUERY:
 -- fails
INSERT INTO tid_tab VALUES (1);
RESULT:
	[]

-----------
QUERY:

SELECT currtid2('tid_view_with_ctid'::text, '(0,1)'::tid);
RESULT:
	[('(0,1)',)]

-----------
QUERY:
 -- ok
DROP VIEW tid_view_with_ctid;
RESULT:
	[]

-----------
QUERY:

TRUNCATE tid_tab;
RESULT:
	[]

-----------
QUERY:

-- ctid attribute with incorrect data type
CREATE VIEW tid_view_fake_ctid AS SELECT 1 AS ctid, 2 AS a;
RESULT:
	[]

-----------
QUERY:

SELECT currtid2('tid_view_fake_ctid'::text, '(0,1)'::tid);
RESULT:
	ERROR - ctid isn't of type TID


-----------
QUERY:
 -- fails
DROP VIEW tid_view_fake_ctid;
RESULT:
	[]

-----------
QUERY:


DROP TABLE tid_tab CASCADE;
RESULT:
	[]
