Guest DBMS identified: postgres
-----------
QUERY:
--
-- NAME
-- all inputs are silently truncated at NAMEDATALEN-1 (63) characters
--

-- fixed-length by reference
SELECT name 'name string' = name 'name string' AS "True"
RESULT: []

-----------
QUERY:
SELECT name 'name string' = name 'name string ' AS "False"
RESULT: []

-----------
QUERY:
--
--
--

CREATE TABLE NAME_TBL(f1 name)
RESULT: []

-----------
QUERY:
INSERT INTO NAME_TBL(f1) VALUES ('1234567890ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890ABCDEFGHIJKLMNOPQR')
RESULT: []

-----------
QUERY:
INSERT INTO NAME_TBL(f1) VALUES ('1234567890abcdefghijklmnopqrstuvwxyz1234567890abcdefghijklmnopqr')
RESULT: []

-----------
QUERY:
INSERT INTO NAME_TBL(f1) VALUES ('asdfghjkl
RESULT: []

-----------
QUERY:
')
RESULT: []

-----------
QUERY:
INSERT INTO NAME_TBL(f1) VALUES ('343f%2a')
RESULT: []

-----------
QUERY:
INSERT INTO NAME_TBL(f1) VALUES ('d34aaasdf')
RESULT: []

-----------
QUERY:
INSERT INTO NAME_TBL(f1) VALUES ('')
RESULT: []

-----------
QUERY:
INSERT INTO NAME_TBL(f1) VALUES ('1234567890ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890ABCDEFGHIJKLMNOPQRSTUVWXYZ')
RESULT: []

-----------
QUERY:
SELECT * FROM NAME_TBL
RESULT: []

-----------
QUERY:
SELECT c.f1 FROM NAME_TBL c WHERE c.f1 <> '1234567890ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890ABCDEFGHIJKLMNOPQR'
RESULT: []

-----------
QUERY:
SELECT c.f1 FROM NAME_TBL c WHERE c.f1 = '1234567890ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890ABCDEFGHIJKLMNOPQR'
RESULT: []

-----------
QUERY:
SELECT c.f1 FROM NAME_TBL c WHERE c.f1 < '1234567890ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890ABCDEFGHIJKLMNOPQR'
RESULT: []

-----------
QUERY:
SELECT c.f1 FROM NAME_TBL c WHERE c.f1 <= '1234567890ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890ABCDEFGHIJKLMNOPQR'
RESULT: []

-----------
QUERY:
SELECT c.f1 FROM NAME_TBL c WHERE c.f1 > '1234567890ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890ABCDEFGHIJKLMNOPQR'
RESULT: []

-----------
QUERY:
SELECT c.f1 FROM NAME_TBL c WHERE c.f1 >= '1234567890ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890ABCDEFGHIJKLMNOPQR'
RESULT: []

-----------
QUERY:
SELECT c.f1 FROM NAME_TBL c WHERE c.f1 ~ '.*'
RESULT: []

-----------
QUERY:
SELECT c.f1 FROM NAME_TBL c WHERE c.f1 !~ '.*'
RESULT: []

-----------
QUERY:
SELECT c.f1 FROM NAME_TBL c WHERE c.f1 ~ '[0-9]'
RESULT: []

-----------
QUERY:
SELECT c.f1 FROM NAME_TBL c WHERE c.f1 ~ '.*asdf.*'
RESULT: []

-----------
QUERY:
DROP TABLE NAME_TBL
RESULT: []

-----------
QUERY:
DO $$
DECLARE r text[];
BEGIN
  r := parse_ident('Schemax.Tabley');
  RAISE NOTICE '%', format('%I.%I', r[1], r[2]);
  r := parse_ident('"SchemaX"."TableY"');
  RAISE NOTICE '%', format('%I.%I', r[1], r[2]);
END;
$$
RESULT: []

-----------
QUERY:
SELECT parse_ident('foo.boo')
RESULT: []

-----------
QUERY:
SELECT parse_ident('foo.boo[]')
RESULT: []

-----------
QUERY:
-- should fail
SELECT parse_ident('foo.boo[]', strict => false)
RESULT: []

-----------
QUERY:
-- ok

-- should fail
SELECT parse_ident(' ')
RESULT: []

-----------
QUERY:
SELECT parse_ident(' .aaa')
RESULT: []

-----------
QUERY:
SELECT parse_ident(' aaa . ')
RESULT: []

-----------
QUERY:
SELECT parse_ident('aaa.a%b')
RESULT: []

-----------
QUERY:
SELECT parse_ident(E'X\rXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX')
RESULT: []

-----------
QUERY:
SELECT length(a[1]), length(a[2]) from parse_ident('"xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx".yyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyy') as a
RESULT: []

-----------
QUERY:
SELECT parse_ident(' first . "  second  " ."   third   ". "  ' || repeat('x',66) || '"')
RESULT: []

-----------
QUERY:
SELECT parse_ident(' first . "  second  " ."   third   ". "  ' || repeat('x',66) || '"')::name[]
RESULT: []

-----------
QUERY:
SELECT parse_ident(E'"c".X XXXX\002XXXXXX')
RESULT: []

-----------
QUERY:
SELECT parse_ident('1020')
RESULT: []

-----------
QUERY:
SELECT parse_ident('10.20')
RESULT: []

-----------
QUERY:
SELECT parse_ident('.')
RESULT: []

-----------
QUERY:
SELECT parse_ident('.1020')
RESULT: []

-----------
QUERY:
SELECT parse_ident('xxx.1020')
RESULT: []
=========================================
Summary for test case name/test.sql of postgres
=========================================
