
-----------
QUERY:
CREATE TABLE xmltest (
    id int,
    data xml
);
RESULT:
	ERROR - Catalog Error: Type with name xml does not exist!
Did you mean "map"?

-----------
QUERY:


INSERT INTO xmltest VALUES (1, '<value>one</value>');
RESULT:
	ERROR - Catalog Error: Table with name xmltest does not exist!
Did you mean "temp.information_schema.tables"?

-----------
QUERY:

INSERT INTO xmltest VALUES (2, '<value>two</value>');
RESULT:
	ERROR - Catalog Error: Table with name xmltest does not exist!
Did you mean "temp.information_schema.tables"?

-----------
QUERY:

INSERT INTO xmltest VALUES (3, '<wrong');
RESULT:
	ERROR - Catalog Error: Table with name xmltest does not exist!
Did you mean "temp.information_schema.tables"?

-----------
QUERY:


SELECT * FROM xmltest;
RESULT:
	ERROR - Catalog Error: Table with name xmltest does not exist!
Did you mean "temp.information_schema.tables"?

-----------
QUERY:


-- test non-throwing API, too
SELECT pg_input_is_valid('<value>one</value>', 'xml');
RESULT:
	ERROR - Catalog Error: Scalar Function with name pg_input_is_valid does not exist!
Did you mean "json_valid"?

-----------
QUERY:

SELECT pg_input_is_valid('<value>one</', 'xml');
RESULT:
	ERROR - Catalog Error: Scalar Function with name pg_input_is_valid does not exist!
Did you mean "json_valid"?

-----------
QUERY:

SELECT message FROM pg_input_error_info('<value>one</', 'xml');
RESULT:
	ERROR - Catalog Error: Table Function with name pg_input_error_info does not exist!
Did you mean "pragma_storage_info"?

-----------
QUERY:

SELECT pg_input_is_valid('<?xml version="1.0" standalone="y"?><foo/>', 'xml');
RESULT:
	ERROR - Catalog Error: Scalar Function with name pg_input_is_valid does not exist!
Did you mean "json_valid"?

-----------
QUERY:

SELECT message FROM pg_input_error_info('<?xml version="1.0" standalone="y"?><foo/>', 'xml');
RESULT:
	ERROR - Catalog Error: Table Function with name pg_input_error_info does not exist!
Did you mean "pragma_storage_info"?

-----------
QUERY:



SELECT xmlcomment('test');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xmlcomment does not exist!
Did you mean "cot"?

-----------
QUERY:

SELECT xmlcomment('-test');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xmlcomment does not exist!
Did you mean "cot"?

-----------
QUERY:

SELECT xmlcomment('test-');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xmlcomment does not exist!
Did you mean "cot"?

-----------
QUERY:

SELECT xmlcomment('--test');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xmlcomment does not exist!
Did you mean "cot"?

-----------
QUERY:

SELECT xmlcomment('te st');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xmlcomment does not exist!
Did you mean "cot"?

-----------
QUERY:



SELECT xmlconcat(xmlcomment('hello'),
                 xmlelement(NAME qux, 'foo'),
                 xmlcomment('world'));
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


SELECT xmlconcat('hello', 'you');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlconcat(1, 2);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlconcat('bad', '<syntax');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlconcat('<foo/>', NULL, '<?xml version="1.1" standalone="no"?><bar/>');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlconcat('<?xml version="1.1"?><foo/>', NULL, '<?xml version="1.1" standalone="no"?><bar/>');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlconcat(NULL);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlconcat(NULL, NULL);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:



SELECT xmlelement(name element,
                  xmlattributes (1 as one, 'deuce' as two),
                  'content');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


SELECT xmlelement(name element,
                  xmlattributes ('unnamed and wrong'));
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


SELECT xmlelement(name element, xmlelement(name nested, 'stuff'));
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


SELECT xmlelement(name employee, xmlforest(name, age, salary as pay)) FROM emp;
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


SELECT xmlelement(name duplicate, xmlattributes(1 as a, 2 as b, 3 as a));
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


SELECT xmlelement(name num, 37);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlelement(name foo, text 'bar');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlelement(name foo, xml 'bar');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlelement(name foo, text 'b<a/>r');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlelement(name foo, xml 'b<a/>r');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlelement(name foo, array[1, 2, 3]);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SET xmlbinary TO base64;
RESULT:
	ERROR - Catalog Error: unrecognized configuration parameter "xmlbinary"

Did you mean: "binary_as_string"

-----------
QUERY:

SELECT xmlelement(name foo, bytea 'bar');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SET xmlbinary TO hex;
RESULT:
	ERROR - Catalog Error: unrecognized configuration parameter "xmlbinary"

Did you mean: "binary_as_string"

-----------
QUERY:

SELECT xmlelement(name foo, bytea 'bar');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


SELECT xmlelement(name foo, xmlattributes(true as bar));
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlelement(name foo, xmlattributes('2009-04-09 00:24:37'::timestamp as bar));
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlelement(name foo, xmlattributes('infinity'::timestamp as bar));
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlelement(name foo, xmlattributes('<>&"''' as funny, xml 'b<a/>r' as funnier));
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:



SELECT xmlparse(content '');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlparse(content '  ');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlparse(content 'abc');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlparse(content '<abc>x</abc>');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlparse(content '<invalidentity>&</invalidentity>');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlparse(content '<undefinedentity>&idontexist;
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:
</undefinedentity>');
RESULT:
	ERROR - Parser Error: syntax error at or near "</"

-----------
QUERY:

SELECT xmlparse(content '<invalidns xmlns=''&lt;
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:
''/>');
RESULT:
	ERROR - Parser Error: syntax error at or near "''"

-----------
QUERY:

SELECT xmlparse(content '<relativens xmlns=''relative''/>');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlparse(content '<twoerrors>&idontexist;
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:
</unbalanced>');
RESULT:
	ERROR - Parser Error: syntax error at or near "</"

-----------
QUERY:

SELECT xmlparse(content '<nosuchprefix:tag/>');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


SELECT xmlparse(document '   ');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlparse(document 'abc');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlparse(document '<abc>x</abc>');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlparse(document '<invalidentity>&</abc>');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlparse(document '<undefinedentity>&idontexist;
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:
</abc>');
RESULT:
	ERROR - Parser Error: syntax error at or near "</"

-----------
QUERY:

SELECT xmlparse(document '<invalidns xmlns=''&lt;
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:
''/>');
RESULT:
	ERROR - Parser Error: syntax error at or near "''"

-----------
QUERY:

SELECT xmlparse(document '<relativens xmlns=''relative''/>');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlparse(document '<twoerrors>&idontexist;
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:
</unbalanced>');
RESULT:
	ERROR - Parser Error: syntax error at or near "</"

-----------
QUERY:

SELECT xmlparse(document '<nosuchprefix:tag/>');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:



SELECT xmlpi(name foo);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlpi(name xml);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlpi(name xmlstuff);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlpi(name foo, 'bar');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlpi(name foo, 'in?>valid');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlpi(name foo, null);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlpi(name xml, null);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlpi(name xmlstuff, null);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlpi(name "xml-stylesheet", 'href="mystyle.css" type="text/css"');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlpi(name foo, '   bar');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:



SELECT xmlroot(xml '<foo/>', version no value, standalone no value);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlroot(xml '<foo/>', version '2.0');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlroot(xml '<foo/>', version no value, standalone yes);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlroot(xml '<?xml version="1.1"?><foo/>', version no value, standalone yes);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlroot(xmlroot(xml '<foo/>', version '1.0'), version '1.1', standalone no);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlroot('<?xml version="1.1" standalone="yes"?><foo/>', version no value, standalone no);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlroot('<?xml version="1.1" standalone="yes"?><foo/>', version no value, standalone no value);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlroot('<?xml version="1.1" standalone="yes"?><foo/>', version no value);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:



SELECT xmlroot (
  xmlelement (
    name gazonk,
    xmlattributes (
      'val' AS name,
      1 + 1 AS num
    ),
    xmlelement (
      NAME qux,
      'foo'
    )
  ),
  version '1.0',
  standalone yes
);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:



SELECT xmlserialize(content data as character varying(20)) FROM xmltest;
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlserialize(content 'good' as char(10));
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlserialize(document 'bad' as text);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


-- indent
SELECT xmlserialize(DOCUMENT '<foo><bar><val x="y">42</val></bar></foo>' AS text INDENT);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlserialize(CONTENT  '<foo><bar><val x="y">42</val></bar></foo>' AS text INDENT);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

-- no indent
SELECT xmlserialize(DOCUMENT '<foo><bar><val x="y">42</val></bar></foo>' AS text NO INDENT);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlserialize(CONTENT  '<foo><bar><val x="y">42</val></bar></foo>' AS text NO INDENT);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

-- indent non singly-rooted xml
SELECT xmlserialize(DOCUMENT '<foo>73</foo><bar><val x="y">42</val></bar>' AS text INDENT);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlserialize(CONTENT  '<foo>73</foo><bar><val x="y">42</val></bar>' AS text INDENT);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

-- indent non singly-rooted xml with mixed contents
SELECT xmlserialize(DOCUMENT 'text node<foo>73</foo>text node<bar><val x="y">42</val></bar>' AS text INDENT);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlserialize(CONTENT  'text node<foo>73</foo>text node<bar><val x="y">42</val></bar>' AS text INDENT);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

-- indent singly-rooted xml with mixed contents
SELECT xmlserialize(DOCUMENT '<foo><bar><val x="y">42</val><val x="y">text node<val>73</val></val></bar></foo>' AS text INDENT);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlserialize(CONTENT  '<foo><bar><val x="y">42</val><val x="y">text node<val>73</val></val></bar></foo>' AS text INDENT);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

-- indent empty string
SELECT xmlserialize(DOCUMENT '' AS text INDENT);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlserialize(CONTENT  '' AS text INDENT);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

-- whitespaces
SELECT xmlserialize(DOCUMENT '  ' AS text INDENT);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlserialize(CONTENT  '  ' AS text INDENT);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

-- indent null
SELECT xmlserialize(DOCUMENT NULL AS text INDENT);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlserialize(CONTENT  NULL AS text INDENT);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

-- indent with XML declaration
SELECT xmlserialize(DOCUMENT '<?xml version="1.0" encoding="UTF-8"?><foo><bar><val>73</val></bar></foo>' AS text INDENT);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlserialize(CONTENT  '<?xml version="1.0" encoding="UTF-8"?><foo><bar><val>73</val></bar></foo>' AS text INDENT);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

-- indent containing DOCTYPE declaration
SELECT xmlserialize(DOCUMENT '<!DOCTYPE a><a/>' AS text INDENT);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlserialize(CONTENT  '<!DOCTYPE a><a/>' AS text INDENT);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

-- indent xml with empty element
SELECT xmlserialize(DOCUMENT '<foo><bar></bar></foo>' AS text INDENT);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlserialize(CONTENT  '<foo><bar></bar></foo>' AS text INDENT);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

-- /* REPLACED */ ''no indent/* REPLACED */ '' = not using /* REPLACED */ ''no indent/* REPLACED */ ''
SELECT xmlserialize(DOCUMENT '<foo><bar><val x="y">42</val></bar></foo>' AS text) = xmlserialize(DOCUMENT '<foo><bar><val x="y">42</val></bar></foo>' AS text NO INDENT);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlserialize(CONTENT  '<foo><bar><val x="y">42</val></bar></foo>' AS text) = xmlserialize(CONTENT '<foo><bar><val x="y">42</val></bar></foo>' AS text NO INDENT);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


SELECT xml '<foo>bar</foo>' IS DOCUMENT;
RESULT:
	ERROR - Parser Error: syntax error at or near "DOCUMENT"

-----------
QUERY:

SELECT xml '<foo>bar</foo><bar>foo</bar>' IS DOCUMENT;
RESULT:
	ERROR - Parser Error: syntax error at or near "DOCUMENT"

-----------
QUERY:

SELECT xml '<abc/>' IS NOT DOCUMENT;
RESULT:
	ERROR - Parser Error: syntax error at or near "DOCUMENT"

-----------
QUERY:

SELECT xml 'abc' IS NOT DOCUMENT;
RESULT:
	ERROR - Parser Error: syntax error at or near "DOCUMENT"

-----------
QUERY:

SELECT '<>' IS NOT DOCUMENT;
RESULT:
	ERROR - Parser Error: syntax error at or near "DOCUMENT"

-----------
QUERY:



SELECT xmlagg(data) FROM xmltest;
RESULT:
	ERROR - Catalog Error: Table with name xmltest does not exist!
Did you mean "temp.information_schema.tables"?

-----------
QUERY:

SELECT xmlagg(data) FROM xmltest WHERE id > 10;
RESULT:
	ERROR - Catalog Error: Table with name xmltest does not exist!
Did you mean "temp.information_schema.tables"?

-----------
QUERY:

SELECT xmlelement(name employees, xmlagg(xmlelement(name name, name))) FROM emp;
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:



-- Check mapping SQL identifier to XML name

SELECT xmlpi(name ":::_xml_abc135.%-&_");
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlpi(name "123");
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:



PREPARE foo (xml) AS SELECT xmlconcat('<foo/>', $1);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


SET XML OPTION DOCUMENT;
RESULT:
	ERROR - Parser Error: syntax error at or near "OPTION"

-----------
QUERY:

EXECUTE foo ('<bar/>');
RESULT:
	ERROR - Binder Error: Prepared statement "foo" does not exist

-----------
QUERY:

EXECUTE foo ('bad');
RESULT:
	ERROR - Binder Error: Prepared statement "foo" does not exist

-----------
QUERY:

SELECT xml '<!DOCTYPE a><a/><b/>';
RESULT:
	ERROR - Catalog Error: Type with name xml does not exist!
Did you mean "map"?

-----------
QUERY:


SET XML OPTION CONTENT;
RESULT:
	ERROR - Parser Error: syntax error at or near "OPTION"

-----------
QUERY:

EXECUTE foo ('<bar/>');
RESULT:
	ERROR - Binder Error: Prepared statement "foo" does not exist

-----------
QUERY:

EXECUTE foo ('good');
RESULT:
	ERROR - Binder Error: Prepared statement "foo" does not exist

-----------
QUERY:

SELECT xml '<!-- in SQL:2006+ a doc is content too--> <?y z?> <!DOCTYPE a><a/>';
RESULT:
	ERROR - Catalog Error: Type with name xml does not exist!
Did you mean "map"?

-----------
QUERY:

SELECT xml '<?xml version="1.0"?> <!-- hi--> <!DOCTYPE a><a/>';
RESULT:
	ERROR - Catalog Error: Type with name xml does not exist!
Did you mean "map"?

-----------
QUERY:

SELECT xml '<!DOCTYPE a><a/>';
RESULT:
	ERROR - Catalog Error: Type with name xml does not exist!
Did you mean "map"?

-----------
QUERY:

SELECT xml '<!-- hi--> oops <!DOCTYPE a><a/>';
RESULT:
	ERROR - Catalog Error: Type with name xml does not exist!
Did you mean "map"?

-----------
QUERY:

SELECT xml '<!-- hi--> <oops/> <!DOCTYPE a><a/>';
RESULT:
	ERROR - Catalog Error: Type with name xml does not exist!
Did you mean "map"?

-----------
QUERY:

SELECT xml '<!DOCTYPE a><a/><b/>';
RESULT:
	ERROR - Catalog Error: Type with name xml does not exist!
Did you mean "map"?

-----------
QUERY:



-- Test backwards parsing

CREATE VIEW xmlview1 AS SELECT xmlcomment('test');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xmlcomment does not exist!
Did you mean "cot"?
LINE 6: CREATE VIEW xmlview1 AS SELECT xmlcomment('test');
                                       ^

-----------
QUERY:

CREATE VIEW xmlview2 AS SELECT xmlconcat('hello', 'you');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

CREATE VIEW xmlview3 AS SELECT xmlelement(name element, xmlattributes (1 as ":one:", 'deuce' as two), 'content&');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

CREATE VIEW xmlview4 AS SELECT xmlelement(name employee, xmlforest(name, age, salary as pay)) FROM emp;
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

CREATE VIEW xmlview5 AS SELECT xmlparse(content '<abc>x</abc>');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

CREATE VIEW xmlview6 AS SELECT xmlpi(name foo, 'bar');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

CREATE VIEW xmlview7 AS SELECT xmlroot(xml '<foo/>', version no value, standalone yes);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

CREATE VIEW xmlview8 AS SELECT xmlserialize(content 'good' as char(10));
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

CREATE VIEW xmlview9 AS SELECT xmlserialize(content 'good' as text);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


SELECT table_name, view_definition FROM information_schema.views
  WHERE table_name LIKE 'xmlview%' ORDER BY 1;
RESULT:
	ERROR - Catalog Error: Table with name views does not exist!
Did you mean "temp.pg_catalog.pg_views"?

-----------
QUERY:


-- Text XPath expressions evaluation

SELECT xpath('/value', data) FROM xmltest;
RESULT:
	ERROR - Catalog Error: Table with name xmltest does not exist!
Did you mean "temp.information_schema.tables"?

-----------
QUERY:

SELECT xpath(NULL, NULL) IS NULL FROM xmltest;
RESULT:
	ERROR - Catalog Error: Table with name xmltest does not exist!
Did you mean "temp.information_schema.tables"?

-----------
QUERY:

SELECT xpath('', '<!-- error -->');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xpath does not exist!
Did you mean "exp"?

-----------
QUERY:

SELECT xpath('//text()', '<local:data xmlns:local="http://127.0.0.1"><local:piece id="1">number one</local:piece><local:piece id="2" /></local:data>');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xpath does not exist!
Did you mean "exp"?

-----------
QUERY:

SELECT xpath('//loc:piece/@id', '<local:data xmlns:local="http://127.0.0.1"><local:piece id="1">number one</local:piece><local:piece id="2" /></local:data>', ARRAY[ARRAY['loc', 'http://127.0.0.1']]);
RESULT:
	ERROR - Catalog Error: Scalar Function with name xpath does not exist!
Did you mean "exp"?

-----------
QUERY:

SELECT xpath('//loc:piece', '<local:data xmlns:local="http://127.0.0.1"><local:piece id="1">number one</local:piece><local:piece id="2" /></local:data>', ARRAY[ARRAY['loc', 'http://127.0.0.1']]);
RESULT:
	ERROR - Catalog Error: Scalar Function with name xpath does not exist!
Did you mean "exp"?

-----------
QUERY:

SELECT xpath('//loc:piece', '<local:data xmlns:local="http://127.0.0.1" xmlns="http://127.0.0.2"><local:piece id="1"><internal>number one</internal><internal2/></local:piece><local:piece id="2" /></local:data>', ARRAY[ARRAY['loc', 'http://127.0.0.1']]);
RESULT:
	ERROR - Catalog Error: Scalar Function with name xpath does not exist!
Did you mean "exp"?

-----------
QUERY:

SELECT xpath('//b', '<a>one <b>two</b> three <b>etc</b></a>');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xpath does not exist!
Did you mean "exp"?

-----------
QUERY:

SELECT xpath('//text()', '<root>&lt;
RESULT:
	ERROR - Parser Error: unterminated quoted string at or near "'<root>&lt;"

-----------
QUERY:
</root>');
RESULT:
	ERROR - Parser Error: syntax error at or near "</"

-----------
QUERY:

SELECT xpath('//@value', '<root value="&lt;
RESULT:
	ERROR - Parser Error: unterminated quoted string at or near "'<root value="&lt;"

-----------
QUERY:
"/>');
RESULT:
	ERROR - Parser Error: unterminated quoted identifier at or near ""/>');"

-----------
QUERY:

SELECT xpath('''<<invalid>>''', '<root/>');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xpath does not exist!
Did you mean "exp"?

-----------
QUERY:

SELECT xpath('count(//*)', '<root><sub/><sub/></root>');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xpath does not exist!
Did you mean "exp"?

-----------
QUERY:

SELECT xpath('count(//*)=0', '<root><sub/><sub/></root>');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xpath does not exist!
Did you mean "exp"?

-----------
QUERY:

SELECT xpath('count(//*)=3', '<root><sub/><sub/></root>');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xpath does not exist!
Did you mean "exp"?

-----------
QUERY:

SELECT xpath('name(/*)', '<root><sub/><sub/></root>');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xpath does not exist!
Did you mean "exp"?

-----------
QUERY:

SELECT xpath('/nosuchtag', '<root/>');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xpath does not exist!
Did you mean "exp"?

-----------
QUERY:

SELECT xpath('root', '<root/>');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xpath does not exist!
Did you mean "exp"?

-----------
QUERY:


-- Round-trip non-ASCII data through xpath().
DO $$
DECLARE
  xml_declaration text := '<?xml version="1.0" encoding="ISO-8859-1"?>';
  degree_symbol text;
  res xml[];
BEGIN
  -- Per the documentation, except when the server encoding is UTF8, xpath()
  -- may not work on non-ASCII data.  The untranslatable_character and
  -- undefined_function traps below, currently dead code, will become relevant
  -- if we remove this limitation.
  IF current_setting('server_encoding') <> 'UTF8' THEN
    RAISE LOG 'skip: encoding % unsupported for xpath',
      current_setting('server_encoding');
    RETURN;
  END IF;

  degree_symbol := convert_from('\xc2b0', 'UTF8');
  res := xpath('text()', (xml_declaration ||
    '<x>' || degree_symbol || '</x>')::xml);
  IF degree_symbol <> res[1]::text THEN
    RAISE 'expected % (%), got % (%)',
      degree_symbol, convert_to(degree_symbol, 'UTF8'),
      res[1], convert_to(res[1]::text, 'UTF8');
  END IF;
EXCEPTION
  -- character with byte sequence 0xc2 0xb0 in encoding /* REPLACED */ ''UTF8/* REPLACED */ '' has no equivalent in encoding /* REPLACED */ ''LATIN8/* REPLACED */ ''
  WHEN untranslatable_character
  -- default conversion function for encoding /* REPLACED */ ''UTF8/* REPLACED */ '' to /* REPLACED */ ''MULE_INTERNAL/* REPLACED */ '' does not exist
  OR undefined_function
  -- unsupported XML feature
  OR feature_not_supported THEN
    RAISE LOG 'skip: %', SQLERRM;
END
$$;
RESULT:
	ERROR - Parser Error: syntax error at or near "DO"

-----------
QUERY:


-- Test xmlexists and xpath_exists
SELECT xmlexists('//town[text() = ''Toronto'']' PASSING BY REF '<towns><town>Bidford-on-Avon</town><town>Cwmbran</town><town>Bristol</town></towns>');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlexists('//town[text() = ''Cwmbran'']' PASSING BY REF '<towns><town>Bidford-on-Avon</town><town>Cwmbran</town><town>Bristol</town></towns>');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmlexists('count(/nosuchtag)' PASSING BY REF '<root/>');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xpath_exists('//town[text() = ''Toronto'']','<towns><town>Bidford-on-Avon</town><town>Cwmbran</town><town>Bristol</town></towns>'::xml);
RESULT:
	ERROR - Catalog Error: Scalar Function with name xpath_exists does not exist!
Did you mean "hex"?

-----------
QUERY:

SELECT xpath_exists('//town[text() = ''Cwmbran'']','<towns><town>Bidford-on-Avon</town><town>Cwmbran</town><town>Bristol</town></towns>'::xml);
RESULT:
	ERROR - Catalog Error: Scalar Function with name xpath_exists does not exist!
Did you mean "hex"?

-----------
QUERY:

SELECT xpath_exists('count(/nosuchtag)', '<root/>'::xml);
RESULT:
	ERROR - Catalog Error: Scalar Function with name xpath_exists does not exist!
Did you mean "hex"?

-----------
QUERY:


INSERT INTO xmltest VALUES (4, '<menu><beers><name>Budvar</name><cost>free</cost><name>Carling</name><cost>lots</cost></beers></menu>'::xml);
RESULT:
	ERROR - Catalog Error: Table with name xmltest does not exist!
Did you mean "temp.information_schema.tables"?

-----------
QUERY:

INSERT INTO xmltest VALUES (5, '<menu><beers><name>Molson</name><cost>free</cost><name>Carling</name><cost>lots</cost></beers></menu>'::xml);
RESULT:
	ERROR - Catalog Error: Table with name xmltest does not exist!
Did you mean "temp.information_schema.tables"?

-----------
QUERY:

INSERT INTO xmltest VALUES (6, '<myns:menu xmlns:myns="http://myns.com"><myns:beers><myns:name>Budvar</myns:name><myns:cost>free</myns:cost><myns:name>Carling</myns:name><myns:cost>lots</myns:cost></myns:beers></myns:menu>'::xml);
RESULT:
	ERROR - Catalog Error: Table with name xmltest does not exist!
Did you mean "temp.information_schema.tables"?

-----------
QUERY:

INSERT INTO xmltest VALUES (7, '<myns:menu xmlns:myns="http://myns.com"><myns:beers><myns:name>Molson</myns:name><myns:cost>free</myns:cost><myns:name>Carling</myns:name><myns:cost>lots</myns:cost></myns:beers></myns:menu>'::xml);
RESULT:
	ERROR - Catalog Error: Table with name xmltest does not exist!
Did you mean "temp.information_schema.tables"?

-----------
QUERY:


SELECT COUNT(id) FROM xmltest WHERE xmlexists('/menu/beer' PASSING data);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT COUNT(id) FROM xmltest WHERE xmlexists('/menu/beer' PASSING BY REF data BY REF);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT COUNT(id) FROM xmltest WHERE xmlexists('/menu/beers' PASSING BY REF data);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT COUNT(id) FROM xmltest WHERE xmlexists('/menu/beers/name[text() = ''Molson'']' PASSING BY REF data);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


SELECT COUNT(id) FROM xmltest WHERE xpath_exists('/menu/beer',data);
RESULT:
	ERROR - Catalog Error: Table with name xmltest does not exist!
Did you mean "temp.information_schema.tables"?

-----------
QUERY:

SELECT COUNT(id) FROM xmltest WHERE xpath_exists('/menu/beers',data);
RESULT:
	ERROR - Catalog Error: Table with name xmltest does not exist!
Did you mean "temp.information_schema.tables"?

-----------
QUERY:

SELECT COUNT(id) FROM xmltest WHERE xpath_exists('/menu/beers/name[text() = ''Molson'']',data);
RESULT:
	ERROR - Catalog Error: Table with name xmltest does not exist!
Did you mean "temp.information_schema.tables"?

-----------
QUERY:

SELECT COUNT(id) FROM xmltest WHERE xpath_exists('/myns:menu/myns:beer',data,ARRAY[ARRAY['myns','http://myns.com']]);
RESULT:
	ERROR - Catalog Error: Table with name xmltest does not exist!
Did you mean "temp.information_schema.tables"?

-----------
QUERY:

SELECT COUNT(id) FROM xmltest WHERE xpath_exists('/myns:menu/myns:beers',data,ARRAY[ARRAY['myns','http://myns.com']]);
RESULT:
	ERROR - Catalog Error: Table with name xmltest does not exist!
Did you mean "temp.information_schema.tables"?

-----------
QUERY:

SELECT COUNT(id) FROM xmltest WHERE xpath_exists('/myns:menu/myns:beers/myns:name[text() = ''Molson'']',data,ARRAY[ARRAY['myns','http://myns.com']]);
RESULT:
	ERROR - Catalog Error: Table with name xmltest does not exist!
Did you mean "temp.information_schema.tables"?

-----------
QUERY:


CREATE TABLE query ( expr TEXT );
RESULT:
	[]

-----------
QUERY:

INSERT INTO query VALUES ('/menu/beers/cost[text() = ''lots'']');
RESULT:
	[]

-----------
QUERY:

SELECT COUNT(id) FROM xmltest, query WHERE xmlexists(expr PASSING BY REF data);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


-- Test xml_is_well_formed and variants

SELECT xml_is_well_formed_document('<foo>bar</foo>');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xml_is_well_formed_document does not exist!
Did you mean "list_element"?

-----------
QUERY:

SELECT xml_is_well_formed_document('abc');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xml_is_well_formed_document does not exist!
Did you mean "list_element"?

-----------
QUERY:

SELECT xml_is_well_formed_content('<foo>bar</foo>');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xml_is_well_formed_content does not exist!
Did you mean "list_element"?

-----------
QUERY:

SELECT xml_is_well_formed_content('abc');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xml_is_well_formed_content does not exist!
Did you mean "list_element"?

-----------
QUERY:


SET xmloption TO DOCUMENT;
RESULT:
	ERROR - Catalog Error: unrecognized configuration parameter "xmloption"

Did you mean: "extension_directory"

-----------
QUERY:

SELECT xml_is_well_formed('abc');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xml_is_well_formed does not exist!
Did you mean "list_where"?

-----------
QUERY:

SELECT xml_is_well_formed('<>');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xml_is_well_formed does not exist!
Did you mean "list_where"?

-----------
QUERY:

SELECT xml_is_well_formed('<abc/>');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xml_is_well_formed does not exist!
Did you mean "list_where"?

-----------
QUERY:

SELECT xml_is_well_formed('<foo>bar</foo>');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xml_is_well_formed does not exist!
Did you mean "list_where"?

-----------
QUERY:

SELECT xml_is_well_formed('<foo>bar</foo');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xml_is_well_formed does not exist!
Did you mean "list_where"?

-----------
QUERY:

SELECT xml_is_well_formed('<foo><bar>baz</foo>');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xml_is_well_formed does not exist!
Did you mean "list_where"?

-----------
QUERY:

SELECT xml_is_well_formed('<local:data xmlns:local="http://127.0.0.1"><local:piece id="1">number one</local:piece><local:piece id="2" /></local:data>');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xml_is_well_formed does not exist!
Did you mean "list_where"?

-----------
QUERY:

SELECT xml_is_well_formed('<pg:foo xmlns:pg="http://postgresql.org/stuff">bar</my:foo>');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xml_is_well_formed does not exist!
Did you mean "list_where"?

-----------
QUERY:

SELECT xml_is_well_formed('<pg:foo xmlns:pg="http://postgresql.org/stuff">bar</pg:foo>');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xml_is_well_formed does not exist!
Did you mean "list_where"?

-----------
QUERY:

SELECT xml_is_well_formed('<invalidentity>&</abc>');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xml_is_well_formed does not exist!
Did you mean "list_where"?

-----------
QUERY:

SELECT xml_is_well_formed('<undefinedentity>&idontexist;
RESULT:
	ERROR - Parser Error: unterminated quoted string at or near "'<undefinedentity>&idontexist;"

-----------
QUERY:
</abc>');
RESULT:
	ERROR - Parser Error: syntax error at or near "</"

-----------
QUERY:

SELECT xml_is_well_formed('<invalidns xmlns=''&lt;
RESULT:
	ERROR - Parser Error: unterminated quoted string at or near "'<invalidns xmlns=''&lt;"

-----------
QUERY:
''/>');
RESULT:
	ERROR - Parser Error: syntax error at or near "''"

-----------
QUERY:

SELECT xml_is_well_formed('<relativens xmlns=''relative''/>');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xml_is_well_formed does not exist!
Did you mean "list_where"?

-----------
QUERY:

SELECT xml_is_well_formed('<twoerrors>&idontexist;
RESULT:
	ERROR - Parser Error: unterminated quoted string at or near "'<twoerrors>&idontexist;"

-----------
QUERY:
</unbalanced>');
RESULT:
	ERROR - Parser Error: syntax error at or near "</"

-----------
QUERY:


SET xmloption TO CONTENT;
RESULT:
	ERROR - Catalog Error: unrecognized configuration parameter "xmloption"

Did you mean: "extension_directory"

-----------
QUERY:

SELECT xml_is_well_formed('abc');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xml_is_well_formed does not exist!
Did you mean "list_where"?

-----------
QUERY:


-- Since xpath() deals with namespaces, it/* REPLACED */ ''s a bit stricter about
-- what/* REPLACED */ ''s well-formed and what/* REPLACED */ ''s not. If we don/* REPLACED */ ''t obey these rules
-- (i.e. ignore namespace-related errors from libxml), xpath()
-- fails in subtle ways. The following would for example produce
-- the xml value
--   <invalidns xmlns=/* REPLACED */ ''</* REPLACED */ ''/>
-- which is invalid because /* REPLACED */ ''</* REPLACED */ '' may not appear un-escaped in
-- attribute values.
-- Since different libxml versions emit slightly different
-- error messages, we suppress the DETAIL in this test.
-- \set VERBOSITY terse
SELECT xpath('/*', '<invalidns xmlns=''&lt;
RESULT:
	ERROR - Parser Error: unterminated quoted string at or near "'<invalidns xmlns=''&lt;"

-----------
QUERY:
''/>');
RESULT:
	ERROR - Parser Error: syntax error at or near "''"

-----------
QUERY:

-- \set VERBOSITY default

-- Again, the XML isn/* REPLACED */ ''t well-formed for namespace purposes
SELECT xpath('/*', '<nosuchprefix:tag/>');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xpath does not exist!
Did you mean "exp"?

-----------
QUERY:


-- XPath deprecates relative namespaces, but they/* REPLACED */ ''re not supposed to
-- throw an error, only a warning.
SELECT xpath('/*', '<relativens xmlns=''relative''/>');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xpath does not exist!
Did you mean "exp"?

-----------
QUERY:


-- External entity references should not leak filesystem information.
SELECT XMLPARSE(DOCUMENT '<!DOCTYPE foo [<!ENTITY c SYSTEM "/etc/passwd">]><foo>&c;
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:
</foo>');
RESULT:
	ERROR - Parser Error: syntax error at or near "</"

-----------
QUERY:

SELECT XMLPARSE(DOCUMENT '<!DOCTYPE foo [<!ENTITY c SYSTEM "/etc/no.such.file">]><foo>&c;
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:
</foo>');
RESULT:
	ERROR - Parser Error: syntax error at or near "</"

-----------
QUERY:

-- This might or might not load the requested DTD, but it mustn/* REPLACED */ ''t throw error.
SELECT XMLPARSE(DOCUMENT '<!DOCTYPE chapter PUBLIC "-//OASIS//DTD DocBook XML V4.1.2//EN" "http://www.oasis-open.org/docbook/xml/4.1.2/docbookx.dtd"><chapter>&nbsp;
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:
</chapter>');
RESULT:
	ERROR - Parser Error: syntax error at or near "</"

-----------
QUERY:


-- XMLPATH tests
CREATE TABLE xmldata(data xml);
RESULT:
	ERROR - Catalog Error: Type with name xml does not exist!
Did you mean "map"?

-----------
QUERY:

INSERT INTO xmldata VALUES('<ROWS>
<ROW id="1">
  <COUNTRY_ID>AU</COUNTRY_ID>
  <COUNTRY_NAME>Australia</COUNTRY_NAME>
  <REGION_ID>3</REGION_ID>
</ROW>
<ROW id="2">
  <COUNTRY_ID>CN</COUNTRY_ID>
  <COUNTRY_NAME>China</COUNTRY_NAME>
  <REGION_ID>3</REGION_ID>
</ROW>
<ROW id="3">
  <COUNTRY_ID>HK</COUNTRY_ID>
  <COUNTRY_NAME>HongKong</COUNTRY_NAME>
  <REGION_ID>3</REGION_ID>
</ROW>
<ROW id="4">
  <COUNTRY_ID>IN</COUNTRY_ID>
  <COUNTRY_NAME>India</COUNTRY_NAME>
  <REGION_ID>3</REGION_ID>
</ROW>
<ROW id="5">
  <COUNTRY_ID>JP</COUNTRY_ID>
  <COUNTRY_NAME>Japan</COUNTRY_NAME>
  <REGION_ID>3</REGION_ID><PREMIER_NAME>Sinzo Abe</PREMIER_NAME>
</ROW>
<ROW id="6">
  <COUNTRY_ID>SG</COUNTRY_ID>
  <COUNTRY_NAME>Singapore</COUNTRY_NAME>
  <REGION_ID>3</REGION_ID><SIZE unit="km">791</SIZE>
</ROW>
</ROWS>');
RESULT:
	ERROR - Catalog Error: Table with name xmldata does not exist!
Did you mean "temp.information_schema.schemata"?

-----------
QUERY:


-- XMLTABLE with columns
SELECT  xmltable.*
   FROM (SELECT data FROM xmldata) x,
        LATERAL XMLTABLE('/ROWS/ROW'
                         PASSING data
                         COLUMNS id int PATH '@id',
                                  _id FOR ORDINALITY,
                                  country_name text PATH 'COUNTRY_NAME/text()' NOT NULL,
                                  country_id text PATH 'COUNTRY_ID',
                                  region_id int PATH 'REGION_ID',
                                  size float PATH 'SIZE',
                                  unit text PATH 'SIZE/@unit',
                                  premier_name text PATH 'PREMIER_NAME' DEFAULT 'not specified');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


CREATE VIEW xmltableview1 AS SELECT  xmltable.*
   FROM (SELECT data FROM xmldata) x,
        LATERAL XMLTABLE('/ROWS/ROW'
                         PASSING data
                         COLUMNS id int PATH '@id',
                                  _id FOR ORDINALITY,
                                  country_name text PATH 'COUNTRY_NAME/text()' NOT NULL,
                                  country_id text PATH 'COUNTRY_ID',
                                  region_id int PATH 'REGION_ID',
                                  size float PATH 'SIZE',
                                  unit text PATH 'SIZE/@unit',
                                  premier_name text PATH 'PREMIER_NAME' DEFAULT 'not specified');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


SELECT * FROM xmltableview1;
RESULT:
	ERROR - Catalog Error: Table with name xmltableview1 does not exist!
Did you mean "temp.information_schema.tables"?

-----------
QUERY:


-- \sv xmltableview1

EXPLAIN (COSTS OFF) SELECT * FROM xmltableview1;
RESULT:
	ERROR - Not implemented Error: Unimplemented explain type: COSTS

-----------
QUERY:

EXPLAIN (COSTS OFF, VERBOSE) SELECT * FROM xmltableview1;
RESULT:
	ERROR - Not implemented Error: Unimplemented explain type: COSTS

-----------
QUERY:


-- errors
SELECT * FROM XMLTABLE (ROW () PASSING null COLUMNS v1 timestamp) AS f (v1, v2);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


-- XMLNAMESPACES tests
SELECT * FROM XMLTABLE(XMLNAMESPACES('http://x.y' AS zz),
                      '/zz:rows/zz:row'
                      PASSING '<rows xmlns="http://x.y"><row><a>10</a></row></rows>'
                      COLUMNS a int PATH 'zz:a');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


CREATE VIEW xmltableview2 AS SELECT * FROM XMLTABLE(XMLNAMESPACES('http://x.y' AS zz),
                      '/zz:rows/zz:row'
                      PASSING '<rows xmlns="http://x.y"><row><a>10</a></row></rows>'
                      COLUMNS a int PATH 'zz:a');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


SELECT * FROM xmltableview2;
RESULT:
	ERROR - Catalog Error: Table with name xmltableview2 does not exist!
Did you mean "temp.information_schema.tables"?

-----------
QUERY:


SELECT * FROM XMLTABLE(XMLNAMESPACES(DEFAULT 'http://x.y'),
                      '/rows/row'
                      PASSING '<rows xmlns="http://x.y"><row><a>10</a></row></rows>'
                      COLUMNS a int PATH 'a');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


SELECT * FROM XMLTABLE('.'
                       PASSING '<foo/>'
                       COLUMNS a text PATH 'foo/namespace::node()');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


-- used in prepare statements
PREPARE pp AS
SELECT  xmltable.*
   FROM (SELECT data FROM xmldata) x,
        LATERAL XMLTABLE('/ROWS/ROW'
                         PASSING data
                         COLUMNS id int PATH '@id',
                                  _id FOR ORDINALITY,
                                  country_name text PATH 'COUNTRY_NAME' NOT NULL,
                                  country_id text PATH 'COUNTRY_ID',
                                  region_id int PATH 'REGION_ID',
                                  size float PATH 'SIZE',
                                  unit text PATH 'SIZE/@unit',
                                  premier_name text PATH 'PREMIER_NAME' DEFAULT 'not specified');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


EXECUTE pp;
RESULT:
	ERROR - Binder Error: Prepared statement "pp" does not exist

-----------
QUERY:


SELECT xmltable.* FROM xmldata, LATERAL xmltable('/ROWS/ROW[COUNTRY_NAME="Japan" or COUNTRY_NAME="India"]' PASSING data COLUMNS "COUNTRY_NAME" text, "REGION_ID" int);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmltable.* FROM xmldata, LATERAL xmltable('/ROWS/ROW[COUNTRY_NAME="Japan" or COUNTRY_NAME="India"]' PASSING data COLUMNS id FOR ORDINALITY, "COUNTRY_NAME" text, "REGION_ID" int);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmltable.* FROM xmldata, LATERAL xmltable('/ROWS/ROW[COUNTRY_NAME="Japan" or COUNTRY_NAME="India"]' PASSING data COLUMNS id int PATH '@id', "COUNTRY_NAME" text, "REGION_ID" int);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmltable.* FROM xmldata, LATERAL xmltable('/ROWS/ROW[COUNTRY_NAME="Japan" or COUNTRY_NAME="India"]' PASSING data COLUMNS id int PATH '@id');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmltable.* FROM xmldata, LATERAL xmltable('/ROWS/ROW[COUNTRY_NAME="Japan" or COUNTRY_NAME="India"]' PASSING data COLUMNS id FOR ORDINALITY);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmltable.* FROM xmldata, LATERAL xmltable('/ROWS/ROW[COUNTRY_NAME="Japan" or COUNTRY_NAME="India"]' PASSING data COLUMNS id int PATH '@id', "COUNTRY_NAME" text, "REGION_ID" int, rawdata xml PATH '.');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmltable.* FROM xmldata, LATERAL xmltable('/ROWS/ROW[COUNTRY_NAME="Japan" or COUNTRY_NAME="India"]' PASSING data COLUMNS id int PATH '@id', "COUNTRY_NAME" text, "REGION_ID" int, rawdata xml PATH './*');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


SELECT * FROM xmltable('/root' passing '<root><element>a1a<!-- aaaa -->a2a<?aaaaa?> <!--z-->  bbbb<x>xxx</x>cccc</element></root>' COLUMNS element text);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT * FROM xmltable('/root' passing '<root><element>a1a<!-- aaaa -->a2a<?aaaaa?> <!--z-->  bbbb<x>xxx</x>cccc</element></root>' COLUMNS element text PATH 'element/text()');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:
 -- should fail

-- CDATA test
select * from xmltable('d/r' passing '<d><r><c><![CDATA[<hello> &"<>!<a>foo</a>]]></c></r><r><c>2</c></r></d>' columns c text);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


-- XML builtin entities
SELECT * FROM xmltable('/x/a' PASSING '<x><a><ent>&apos;
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:
</ent></a><a><ent>&quot;
RESULT:
	ERROR - Parser Error: syntax error at or near "</"

-----------
QUERY:
</ent></a><a><ent>&amp;
RESULT:
	ERROR - Parser Error: syntax error at or near "</"

-----------
QUERY:
</ent></a><a><ent>&lt;
RESULT:
	ERROR - Parser Error: syntax error at or near "</"

-----------
QUERY:
</ent></a><a><ent>&gt;
RESULT:
	ERROR - Parser Error: syntax error at or near "</"

-----------
QUERY:
</ent></a></x>' COLUMNS ent text);
RESULT:
	ERROR - Parser Error: syntax error at or near "</"

-----------
QUERY:

SELECT * FROM xmltable('/x/a' PASSING '<x><a><ent>&apos;
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:
</ent></a><a><ent>&quot;
RESULT:
	ERROR - Parser Error: syntax error at or near "</"

-----------
QUERY:
</ent></a><a><ent>&amp;
RESULT:
	ERROR - Parser Error: syntax error at or near "</"

-----------
QUERY:
</ent></a><a><ent>&lt;
RESULT:
	ERROR - Parser Error: syntax error at or near "</"

-----------
QUERY:
</ent></a><a><ent>&gt;
RESULT:
	ERROR - Parser Error: syntax error at or near "</"

-----------
QUERY:
</ent></a></x>' COLUMNS ent xml);
RESULT:
	ERROR - Parser Error: syntax error at or near "</"

-----------
QUERY:


EXPLAIN (VERBOSE, COSTS OFF)
SELECT  xmltable.*
   FROM (SELECT data FROM xmldata) x,
        LATERAL XMLTABLE('/ROWS/ROW'
                         PASSING data
                         COLUMNS id int PATH '@id',
                                  _id FOR ORDINALITY,
                                  country_name text PATH 'COUNTRY_NAME' NOT NULL,
                                  country_id text PATH 'COUNTRY_ID',
                                  region_id int PATH 'REGION_ID',
                                  size float PATH 'SIZE',
                                  unit text PATH 'SIZE/@unit',
                                  premier_name text PATH 'PREMIER_NAME' DEFAULT 'not specified');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


-- test qual
SELECT xmltable.* FROM xmldata, LATERAL xmltable('/ROWS/ROW[COUNTRY_NAME="Japan" or COUNTRY_NAME="India"]' PASSING data COLUMNS "COUNTRY_NAME" text, "REGION_ID" int) WHERE "COUNTRY_NAME" = 'Japan';
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


EXPLAIN (VERBOSE, COSTS OFF)
SELECT f.* FROM xmldata, LATERAL xmltable('/ROWS/ROW[COUNTRY_NAME="Japan" or COUNTRY_NAME="India"]' PASSING data COLUMNS "COUNTRY_NAME" text, "REGION_ID" int) AS f WHERE "COUNTRY_NAME" = 'Japan';
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


EXPLAIN (VERBOSE, FORMAT JSON, COSTS OFF)
SELECT f.* FROM xmldata, LATERAL xmltable('/ROWS/ROW[COUNTRY_NAME="Japan" or COUNTRY_NAME="India"]' PASSING data COLUMNS "COUNTRY_NAME" text, "REGION_ID" int) AS f WHERE "COUNTRY_NAME" = 'Japan';
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


-- should to work with more data
INSERT INTO xmldata VALUES('<ROWS>
<ROW id="10">
  <COUNTRY_ID>CZ</COUNTRY_ID>
  <COUNTRY_NAME>Czech Republic</COUNTRY_NAME>
  <REGION_ID>2</REGION_ID><PREMIER_NAME>Milos Zeman</PREMIER_NAME>
</ROW>
<ROW id="11">
  <COUNTRY_ID>DE</COUNTRY_ID>
  <COUNTRY_NAME>Germany</COUNTRY_NAME>
  <REGION_ID>2</REGION_ID>
</ROW>
<ROW id="12">
  <COUNTRY_ID>FR</COUNTRY_ID>
  <COUNTRY_NAME>France</COUNTRY_NAME>
  <REGION_ID>2</REGION_ID>
</ROW>
</ROWS>');
RESULT:
	ERROR - Catalog Error: Table with name xmldata does not exist!
Did you mean "temp.information_schema.schemata"?

-----------
QUERY:


INSERT INTO xmldata VALUES('<ROWS>
<ROW id="20">
  <COUNTRY_ID>EG</COUNTRY_ID>
  <COUNTRY_NAME>Egypt</COUNTRY_NAME>
  <REGION_ID>1</REGION_ID>
</ROW>
<ROW id="21">
  <COUNTRY_ID>SD</COUNTRY_ID>
  <COUNTRY_NAME>Sudan</COUNTRY_NAME>
  <REGION_ID>1</REGION_ID>
</ROW>
</ROWS>');
RESULT:
	ERROR - Catalog Error: Table with name xmldata does not exist!
Did you mean "temp.information_schema.schemata"?

-----------
QUERY:


SELECT  xmltable.*
   FROM (SELECT data FROM xmldata) x,
        LATERAL XMLTABLE('/ROWS/ROW'
                         PASSING data
                         COLUMNS id int PATH '@id',
                                  _id FOR ORDINALITY,
                                  country_name text PATH 'COUNTRY_NAME' NOT NULL,
                                  country_id text PATH 'COUNTRY_ID',
                                  region_id int PATH 'REGION_ID',
                                  size float PATH 'SIZE',
                                  unit text PATH 'SIZE/@unit',
                                  premier_name text PATH 'PREMIER_NAME' DEFAULT 'not specified');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


SELECT  xmltable.*
   FROM (SELECT data FROM xmldata) x,
        LATERAL XMLTABLE('/ROWS/ROW'
                         PASSING data
                         COLUMNS id int PATH '@id',
                                  _id FOR ORDINALITY,
                                  country_name text PATH 'COUNTRY_NAME' NOT NULL,
                                  country_id text PATH 'COUNTRY_ID',
                                  region_id int PATH 'REGION_ID',
                                  size float PATH 'SIZE',
                                  unit text PATH 'SIZE/@unit',
                                  premier_name text PATH 'PREMIER_NAME' DEFAULT 'not specified')
  WHERE region_id = 2;
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


EXPLAIN (VERBOSE, COSTS OFF)
SELECT  xmltable.*
   FROM (SELECT data FROM xmldata) x,
        LATERAL XMLTABLE('/ROWS/ROW'
                         PASSING data
                         COLUMNS id int PATH '@id',
                                  _id FOR ORDINALITY,
                                  country_name text PATH 'COUNTRY_NAME' NOT NULL,
                                  country_id text PATH 'COUNTRY_ID',
                                  region_id int PATH 'REGION_ID',
                                  size float PATH 'SIZE',
                                  unit text PATH 'SIZE/@unit',
                                  premier_name text PATH 'PREMIER_NAME' DEFAULT 'not specified')
  WHERE region_id = 2;
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


-- should fail, NULL value
SELECT  xmltable.*
   FROM (SELECT data FROM xmldata) x,
        LATERAL XMLTABLE('/ROWS/ROW'
                         PASSING data
                         COLUMNS id int PATH '@id',
                                  _id FOR ORDINALITY,
                                  country_name text PATH 'COUNTRY_NAME' NOT NULL,
                                  country_id text PATH 'COUNTRY_ID',
                                  region_id int PATH 'REGION_ID',
                                  size float PATH 'SIZE' NOT NULL,
                                  unit text PATH 'SIZE/@unit',
                                  premier_name text PATH 'PREMIER_NAME' DEFAULT 'not specified');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


-- if all is ok, then result is empty
-- one line xml test
WITH
   x AS (SELECT proname, proowner, procost::numeric, pronargs,
                array_to_string(proargnames,',') as proargnames,
                case when proargtypes <> '' then array_to_string(proargtypes::oid[],',') end as proargtypes
           FROM pg_proc WHERE proname = 'f_leak'),
   y AS (SELECT xmlelement(name proc,
                           xmlforest(proname, proowner,
                                     procost, pronargs,
                                     proargnames, proargtypes)) as proc
           FROM x),
   z AS (SELECT xmltable.*
           FROM y,
                LATERAL xmltable('/proc' PASSING proc
                                 COLUMNS proname name,
                                         proowner oid,
                                         procost float,
                                         pronargs int,
                                         proargnames text,
                                         proargtypes text))
   SELECT * FROM z
   EXCEPT SELECT * FROM x;
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


-- multi line xml test, result should be empty too
WITH
   x AS (SELECT proname, proowner, procost::numeric, pronargs,
                array_to_string(proargnames,',') as proargnames,
                case when proargtypes <> '' then array_to_string(proargtypes::oid[],',') end as proargtypes
           FROM pg_proc),
   y AS (SELECT xmlelement(name data,
                           xmlagg(xmlelement(name proc,
                                             xmlforest(proname, proowner, procost,
                                                       pronargs, proargnames, proargtypes)))) as doc
           FROM x),
   z AS (SELECT xmltable.*
           FROM y,
                LATERAL xmltable('/data/proc' PASSING doc
                                 COLUMNS proname name,
                                         proowner oid,
                                         procost float,
                                         pronargs int,
                                         proargnames text,
                                         proargtypes text))
   SELECT * FROM z
   EXCEPT SELECT * FROM x;
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


CREATE TABLE xmltest2(x xml, _path text);
RESULT:
	ERROR - Catalog Error: Type with name xml does not exist!
Did you mean "map"?

-----------
QUERY:


INSERT INTO xmltest2 VALUES('<d><r><ac>1</ac></r></d>', 'A');
RESULT:
	ERROR - Catalog Error: Table with name xmltest2 does not exist!
Did you mean "temp.information_schema.tables"?

-----------
QUERY:

INSERT INTO xmltest2 VALUES('<d><r><bc>2</bc></r></d>', 'B');
RESULT:
	ERROR - Catalog Error: Table with name xmltest2 does not exist!
Did you mean "temp.information_schema.tables"?

-----------
QUERY:

INSERT INTO xmltest2 VALUES('<d><r><cc>3</cc></r></d>', 'C');
RESULT:
	ERROR - Catalog Error: Table with name xmltest2 does not exist!
Did you mean "temp.information_schema.tables"?

-----------
QUERY:

INSERT INTO xmltest2 VALUES('<d><r><dc>2</dc></r></d>', 'D');
RESULT:
	ERROR - Catalog Error: Table with name xmltest2 does not exist!
Did you mean "temp.information_schema.tables"?

-----------
QUERY:


SELECT xmltable.* FROM xmltest2, LATERAL xmltable('/d/r' PASSING x COLUMNS a int PATH '' || lower(_path) || 'c');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmltable.* FROM xmltest2, LATERAL xmltable(('/d/r/' || lower(_path) || 'c') PASSING x COLUMNS a int PATH '.');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

SELECT xmltable.* FROM xmltest2, LATERAL xmltable(('/d/r/' || lower(_path) || 'c') PASSING x COLUMNS a int PATH 'x' DEFAULT ascii(_path) - 54);
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


-- XPath result can be boolean or number too
SELECT * FROM XMLTABLE('*' PASSING '<a>a</a>' COLUMNS a xml PATH '.', b text PATH '.', c text PATH '"hi"', d boolean PATH '. = "a"', e integer PATH 'string-length(.)');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:

-- \x
SELECT * FROM XMLTABLE('*' PASSING '<e>pre<!--c1--><?pi arg?><![CDATA[&ent1]]><n2>&amp;
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:
deep</n2>post</e>' COLUMNS x xml PATH '/e/n2', y xml PATH '/');
RESULT:
	ERROR - Parser Error: syntax error at or near "deep"

-----------
QUERY:

-- \x

SELECT * FROM XMLTABLE('.' PASSING XMLELEMENT(NAME a) columns a varchar(20) PATH '"<foo/>"', b xml PATH '"<foo/>"');
RESULT:
	ERROR - Parser Error: syntax error at or near "("

-----------
QUERY:


SELECT xmltext(NULL);
RESULT:
	ERROR - Catalog Error: Scalar Function with name xmltext does not exist!
Did you mean "left"?

-----------
QUERY:

SELECT xmltext('');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xmltext does not exist!
Did you mean "left"?

-----------
QUERY:

SELECT xmltext('  ');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xmltext does not exist!
Did you mean "left"?

-----------
QUERY:

SELECT xmltext('foo `$_-+?=*^%!|/\()[]{}');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xmltext does not exist!
Did you mean "left"?

-----------
QUERY:

SELECT xmltext('foo & <"bar">');
RESULT:
	ERROR - Catalog Error: Scalar Function with name xmltext does not exist!
Did you mean "left"?

-----------
QUERY:

SELECT xmltext('x'|| '<P>73</P>'::xml || .42 || true || 'j'::char);
RESULT:
	ERROR - Catalog Error: Scalar Function with name xmltext does not exist!
Did you mean "left"?
