
-----------
QUERY:
--
-- NAME
-- all inputs are silently truncated at NAMEDATALEN-1 (63) characters
--

-- fixed-length by reference
SELECT name 'name string' = name 'name string' AS "True";
RESULT:
	ERROR - Catalog Error: Type with name name does not exist!
Did you mean "date"?

-----------
QUERY:


SELECT name 'name string' = name 'name string ' AS "False";
RESULT:
	ERROR - Catalog Error: Type with name name does not exist!
Did you mean "date"?

-----------
QUERY:


--
--
--

CREATE TABLE NAME_TBL(f1 name);
RESULT:
	ERROR - Catalog Error: Type with name name does not exist!
Did you mean "date"?

-----------
QUERY:


INSERT INTO NAME_TBL(f1) VALUES ('1234567890ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890ABCDEFGHIJKLMNOPQR');
RESULT:
	ERROR - Catalog Error: Table with name NAME_TBL does not exist!
Did you mean "CHAR_TBL"?

-----------
QUERY:


INSERT INTO NAME_TBL(f1) VALUES ('1234567890abcdefghijklmnopqrstuvwxyz1234567890abcdefghijklmnopqr');
RESULT:
	ERROR - Catalog Error: Table with name NAME_TBL does not exist!
Did you mean "CHAR_TBL"?

-----------
QUERY:


INSERT INTO NAME_TBL(f1) VALUES ('asdfghjkl;
RESULT:
	ERROR - Parser Error: unterminated quoted string at or near "'asdfghjkl;"

-----------
QUERY:
');
RESULT:
	ERROR - Parser Error: unterminated quoted string at or near "');"

-----------
QUERY:


INSERT INTO NAME_TBL(f1) VALUES ('343f%2a');
RESULT:
	ERROR - Catalog Error: Table with name NAME_TBL does not exist!
Did you mean "CHAR_TBL"?

-----------
QUERY:


INSERT INTO NAME_TBL(f1) VALUES ('d34aaasdf');
RESULT:
	ERROR - Catalog Error: Table with name NAME_TBL does not exist!
Did you mean "CHAR_TBL"?

-----------
QUERY:


INSERT INTO NAME_TBL(f1) VALUES ('');
RESULT:
	ERROR - Catalog Error: Table with name NAME_TBL does not exist!
Did you mean "CHAR_TBL"?

-----------
QUERY:


INSERT INTO NAME_TBL(f1) VALUES ('1234567890ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890ABCDEFGHIJKLMNOPQRSTUVWXYZ');
RESULT:
	ERROR - Catalog Error: Table with name NAME_TBL does not exist!
Did you mean "CHAR_TBL"?

-----------
QUERY:



SELECT * FROM NAME_TBL;
RESULT:
	ERROR - Catalog Error: Table with name NAME_TBL does not exist!
Did you mean "CHAR_TBL"?

-----------
QUERY:


SELECT c.f1 FROM NAME_TBL c WHERE c.f1 <> '1234567890ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890ABCDEFGHIJKLMNOPQR';
RESULT:
	ERROR - Catalog Error: Table with name NAME_TBL does not exist!
Did you mean "CHAR_TBL"?

-----------
QUERY:


SELECT c.f1 FROM NAME_TBL c WHERE c.f1 = '1234567890ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890ABCDEFGHIJKLMNOPQR';
RESULT:
	ERROR - Catalog Error: Table with name NAME_TBL does not exist!
Did you mean "CHAR_TBL"?

-----------
QUERY:


SELECT c.f1 FROM NAME_TBL c WHERE c.f1 < '1234567890ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890ABCDEFGHIJKLMNOPQR';
RESULT:
	ERROR - Catalog Error: Table with name NAME_TBL does not exist!
Did you mean "CHAR_TBL"?

-----------
QUERY:


SELECT c.f1 FROM NAME_TBL c WHERE c.f1 <= '1234567890ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890ABCDEFGHIJKLMNOPQR';
RESULT:
	ERROR - Catalog Error: Table with name NAME_TBL does not exist!
Did you mean "CHAR_TBL"?

-----------
QUERY:


SELECT c.f1 FROM NAME_TBL c WHERE c.f1 > '1234567890ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890ABCDEFGHIJKLMNOPQR';
RESULT:
	ERROR - Catalog Error: Table with name NAME_TBL does not exist!
Did you mean "CHAR_TBL"?

-----------
QUERY:


SELECT c.f1 FROM NAME_TBL c WHERE c.f1 >= '1234567890ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890ABCDEFGHIJKLMNOPQR';
RESULT:
	ERROR - Catalog Error: Table with name NAME_TBL does not exist!
Did you mean "CHAR_TBL"?

-----------
QUERY:


SELECT c.f1 FROM NAME_TBL c WHERE c.f1 ~ '.*';
RESULT:
	ERROR - Catalog Error: Table with name NAME_TBL does not exist!
Did you mean "CHAR_TBL"?

-----------
QUERY:


SELECT c.f1 FROM NAME_TBL c WHERE c.f1 !~ '.*';
RESULT:
	ERROR - Catalog Error: Table with name NAME_TBL does not exist!
Did you mean "CHAR_TBL"?

-----------
QUERY:


SELECT c.f1 FROM NAME_TBL c WHERE c.f1 ~ '[0-9]';
RESULT:
	ERROR - Catalog Error: Table with name NAME_TBL does not exist!
Did you mean "CHAR_TBL"?

-----------
QUERY:


SELECT c.f1 FROM NAME_TBL c WHERE c.f1 ~ '.*asdf.*';
RESULT:
	ERROR - Catalog Error: Table with name NAME_TBL does not exist!
Did you mean "CHAR_TBL"?

-----------
QUERY:


DROP TABLE NAME_TBL;
RESULT:
	ERROR - Catalog Error: Table with name NAME_TBL does not exist!
Did you mean "CHAR_TBL"?

-----------
QUERY:


DO $$
DECLARE r text[];
BEGIN
  r := parse_ident('Schemax.Tabley');
  RAISE NOTICE '%', format('%I.%I', r[1], r[2]);
  r := parse_ident('"SchemaX"."TableY"');
  RAISE NOTICE '%', format('%I.%I', r[1], r[2]);
END;
$$;
RESULT:
	ERROR - Parser Error: syntax error at or near "DO"

-----------
QUERY:


SELECT parse_ident('foo.boo');
RESULT:
	ERROR - Catalog Error: Scalar Function with name parse_ident does not exist!
Did you mean "asin"?

-----------
QUERY:

SELECT parse_ident('foo.boo[]');
RESULT:
	ERROR - Catalog Error: Scalar Function with name parse_ident does not exist!
Did you mean "asin"?

-----------
QUERY:
 -- should fail
SELECT parse_ident('foo.boo[]', strict => false);
RESULT:
	ERROR - Catalog Error: Scalar Function with name parse_ident does not exist!
Did you mean "asin"?

-----------
QUERY:
 -- ok

-- should fail
SELECT parse_ident(' ');
RESULT:
	ERROR - Catalog Error: Scalar Function with name parse_ident does not exist!
Did you mean "asin"?

-----------
QUERY:

SELECT parse_ident(' .aaa');
RESULT:
	ERROR - Catalog Error: Scalar Function with name parse_ident does not exist!
Did you mean "asin"?

-----------
QUERY:

SELECT parse_ident(' aaa . ');
RESULT:
	ERROR - Catalog Error: Scalar Function with name parse_ident does not exist!
Did you mean "asin"?

-----------
QUERY:

SELECT parse_ident('aaa.a%b');
RESULT:
	ERROR - Catalog Error: Scalar Function with name parse_ident does not exist!
Did you mean "asin"?

-----------
QUERY:

SELECT parse_ident(E'X\rXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX');
RESULT:
	ERROR - Catalog Error: Scalar Function with name parse_ident does not exist!
Did you mean "asin"?

-----------
QUERY:


SELECT length(a[1]), length(a[2]) from parse_ident('"xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx".yyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyy') as a ;
RESULT:
	ERROR - Catalog Error: Table Function with name parse_ident does not exist!
Did you mean "dsdgen"?

-----------
QUERY:


SELECT parse_ident(' first . "  second  " ."   third   ". "  ' || repeat('x',66) || '"');
RESULT:
	ERROR - Catalog Error: Scalar Function with name parse_ident does not exist!
Did you mean "asin"?

-----------
QUERY:

SELECT parse_ident(' first . "  second  " ."   third   ". "  ' || repeat('x',66) || '"')::name[];
RESULT:
	ERROR - Catalog Error: Scalar Function with name parse_ident does not exist!
Did you mean "asin"?

-----------
QUERY:


SELECT parse_ident(E'"c".X XXXX\002XXXXXX');
RESULT:
	ERROR - Catalog Error: Scalar Function with name parse_ident does not exist!
Did you mean "asin"?

-----------
QUERY:

SELECT parse_ident('1020');
RESULT:
	ERROR - Catalog Error: Scalar Function with name parse_ident does not exist!
Did you mean "asin"?

-----------
QUERY:

SELECT parse_ident('10.20');
RESULT:
	ERROR - Catalog Error: Scalar Function with name parse_ident does not exist!
Did you mean "asin"?

-----------
QUERY:

SELECT parse_ident('.');
RESULT:
	ERROR - Catalog Error: Scalar Function with name parse_ident does not exist!
Did you mean "asin"?

-----------
QUERY:

SELECT parse_ident('.1020');
RESULT:
	ERROR - Catalog Error: Scalar Function with name parse_ident does not exist!
Did you mean "asin"?

-----------
QUERY:

SELECT parse_ident('xxx.1020');
RESULT:
	ERROR - Catalog Error: Scalar Function with name parse_ident does not exist!
Did you mean "asin"?
